amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
<?xml version='1.0' encoding='utf-8'?>
<device xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xsi:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
    <vendor>Renesas</vendor>
    <vendorID>Renesas</vendorID>
    <name>R7FA6M3AH</name>
    <series>RA6</series>
    <version>1.2</version>
    <description>ARM 32-bit Cortex,M4F Microcontroller based device, CPU clock up to 120MHz, etc. </description>
    <cpu>
        <name>CM4</name>
        <revision>r0p1</revision>
        <endian>little</endian>
        <mpuPresent>true</mpuPresent>
        <fpuPresent>true</fpuPresent>
        <vtorPresent>true</vtorPresent>
        <nvicPrioBits>4</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <peripherals>
        <peripheral>
            <name>PORT0</name>
            <description>Port 0 Control Registers</description>
            <baseAddress>0x40040000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x00</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x06</offset>
                <size>6</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PCNTR1</name>
                    <description>Port Control Register 1</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PODR</name>
                            <description>Pmn Output Data</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PDR</name>
                            <description>Pmn Direction</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PODR</name>
                    <description>Output data register</description>
                    <alternateRegister>PCNTR1</alternateRegister>
                    <addressOffset>0x00</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PODR</name>
                            <description>Pmn Output Data</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDR</name>
                    <description>Data direction register</description>
                    <alternateRegister>PCNTR1</alternateRegister>
                    <addressOffset>0x02</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PDR</name>
                            <description>Pmn Direction</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNTR2</name>
                    <description>Port Control Register 2</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFF0000</resetMask>
                    <fields>
                        <field>
                            <name>EIDR</name>
                            <description>Pmn Event Input Data</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PIDR</name>
                            <description>Pmn Input Data</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PIDR</name>
                    <description>Input data register</description>
                    <alternateRegister>PCNTR2</alternateRegister>
                    <addressOffset>0x06</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                    <fields>
                        <field>
                            <name>PIDR</name>
                            <description>Pmn Input Data</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNTR3</name>
                    <description>Port Control Register 3</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PORR</name>
                            <description>Pmn Output Reset</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>POSR</name>
                            <description>Pmn Output Set</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PORR</name>
                    <description>Output reset register</description>
                    <alternateRegister>PCNTR3</alternateRegister>
                    <addressOffset>0x08</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PORR</name>
                            <description>Pmn Output Reset</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POSR</name>
                    <description>Output set register</description>
                    <alternateRegister>PCNTR3</alternateRegister>
                    <addressOffset>0x0A</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POSR</name>
                            <description>Pmn Output Set</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
