amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="PORT1">
            <name>PORT2</name>
            <description>Port 2 Control Registers</description>
            <baseAddress>0x40040040</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT1">
            <name>PORT3</name>
            <description>Port 3 Control Registers</description>
            <baseAddress>0x40040060</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT1">
            <name>PORT4</name>
            <description>Port 4 Control Registers</description>
            <baseAddress>0x40040080</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORT5</name>
            <description>Port 5 Control Registers</description>
            <baseAddress>0x400400A0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORT6</name>
            <description>Port 6 Control Registers</description>
            <baseAddress>0x400400C0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORT7</name>
            <description>Port 7 Control Registers</description>
            <baseAddress>0x400400E0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORT8</name>
            <description>Port 8 Control Registers</description>
            <baseAddress>0x40040100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORT9</name>
            <description>Port 9 Control Registers</description>
            <baseAddress>0x40040120</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORTA</name>
            <description>Port A Control Registers</description>
            <baseAddress>0x40040140</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORTB</name>
            <description>Port B Control Registers</description>
            <baseAddress>0x40040160</baseAddress>
        </peripheral>
        <peripheral>
            <name>PFS</name>
            <description>Pmn Pin Function Control Register</description>
            <baseAddress>0x40040800</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x02</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x03</offset>
                <size>29</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x06</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x07</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x22</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x23</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x38</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x3A</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x3B</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x42</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x43</offset>
                <size>29</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x46</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x47</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x60</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x62</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x63</offset>
                <size>5</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x66</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x67</offset>
                <size>5</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x6A</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x6B</offset>
                <size>21</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x6E</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x6F</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x80</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x82</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x83</offset>
                <size>5</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x86</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x87</offset>
                <size>33</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8A</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8B</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA8</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xAA</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xAB</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC0</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC2</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC3</offset>
                <size>37</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC6</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC7</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xE8</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xEA</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xEB</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>40</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x102</offset>
                <size>40</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x103</offset>
                <size>40</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x128</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x12A</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x12B</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x140</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x142</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x143</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x16C</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x16E</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x16F</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x180</offset>
                <size>40</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x182</offset>
                <size>40</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x183</offset>
                <size>40</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1A8</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1AA</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1AB</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C0</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C2</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C3</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1E4</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1E6</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1E7</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1E8</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1EA</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1EB</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x200</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x202</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x203</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x240</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x242</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x243</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x254</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x256</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x257</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x280</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x282</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x283</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2A0</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2A2</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2A3</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2A8</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2AA</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2AB</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2C0</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2C2</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2C3</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>P000PFS</name>
                    <description>P000 Pin Function Control Register</description>
                    <addressOffset>0x000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00008000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                    <fields>
                        <field>
                            <name>PSEL</name>
                            <description>Port Function SelectThese bits select the peripheral function. For individual pin functions, see the MPC table</description>
                            <lsb>24</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PMR</name>
                            <description>Port Mode Control</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ASEL</name>
                            <description>Analog Input enable</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ISEL</name>
                            <description>IRQ input enable</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DSCR</name>
                            <description>Drive Strength Control Register</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NCODR</name>
                            <description>N,Channel Open Drain Control</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PCR</name>
                            <description>Pull,up Control</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PDR</name>
                            <description>Port Direction</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PIDR</name>
                            <description>Port Input Data</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PODR</name>
                            <description>Port Output Data</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
