amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>P100PFS_BY</name>
                    <description>P100 Pin Function Control Register</description>
                    <addressOffset>0x043</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                    <fields>
                        <field>
                            <name>NCODR</name>
                            <description>N,Channel Open Drain Control</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PCR</name>
                            <description>Pull,up Control</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PDR</name>
                            <description>Port Direction</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PIDR</name>
                            <description>Port Input Data</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PODR</name>
                            <description>Port Output Data</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>7</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-7</dimIndex>
                    <name>P10%sPFS</name>
                    <description>P10%s Pin Function Control Register</description>
                    <alternateRegister>P10%sPFS</alternateRegister>
                    <addressOffset>0x044</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>7</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-7</dimIndex>
                    <name>P10%sPFS_HA</name>
                    <description>P10%s Pin Function Control Register</description>
                    <alternateRegister>P10%sPFS</alternateRegister>
                    <addressOffset>0x046</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>7</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-7</dimIndex>
                    <name>P10%sPFS_BY</name>
                    <description>P10%s Pin Function Control Register</description>
                    <alternateRegister>P10%sPFS</alternateRegister>
                    <addressOffset>0x047</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <name>P108PFS</name>
                    <description>P108 Pin Function Control Register</description>
                    <addressOffset>0x060</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010410</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                    <fields>
                        <field>
                            <name>PSEL</name>
                            <description>Port Function SelectThese bits select the peripheral function. For individual pin functions, see the MPC table</description>
                            <lsb>24</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PMR</name>
                            <description>Port Mode Control</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ASEL</name>
                            <description>Analog Input enable</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ISEL</name>
                            <description>IRQ input enable</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EOF</name>
                            <description>Event on Falling</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EOR</name>
                            <description>Event on Rising</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DSCR</name>
                            <description>Drive Strength Control Register</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NCODR</name>
                            <description>N,Channel Open Drain Control</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PCR</name>
                            <description>Pull,up Control</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PDR</name>
                            <description>Port Direction</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PIDR</name>
                            <description>Port Input Data</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PODR</name>
                            <description>Port Output Data</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>P108PFS_HA</name>
                    <description>P108 Pin Function Control Register</description>
                    <alternateRegister>P108PFS</alternateRegister>
                    <addressOffset>0x062</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0410</resetValue>
                    <resetMask>0xFFFD</resetMask>
                    <fields>
                        <field>
                            <name>ASEL</name>
                            <description>Analog Input enable</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ISEL</name>
                            <description>IRQ input enable</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EOF</name>
                            <description>Event on Falling</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EOR</name>
                            <description>Event on Rising</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DSCR</name>
                            <description>Drive Strength Control Register</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NCODR</name>
                            <description>N,Channel Open Drain Control</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PCR</name>
                            <description>Pull,up Control</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PDR</name>
                            <description>Port Direction</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PIDR</name>
                            <description>Port Input Data</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PODR</name>
                            <description>Port Output Data</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>P108PFS_BY</name>
                    <description>P108 Pin Function Control Register</description>
                    <alternateRegister>P108PFS</alternateRegister>
                    <addressOffset>0x063</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFD</resetMask>
                    <fields>
                        <field>
                            <name>NCODR</name>
                            <description>N,Channel Open Drain Control</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PCR</name>
                            <description>Pull,up Control</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PDR</name>
                            <description>Port Direction</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PIDR</name>
                            <description>Port Input Data</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PODR</name>
                            <description>Port Output Data</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>P109PFS</name>
                    <description>P109 Pin Function Control Register</description>
                    <addressOffset>0x064</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010410</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <name>P109PFS_HA</name>
                    <description>P109 Pin Function Control Register</description>
                    <alternateRegister>P109PFS</alternateRegister>
                    <addressOffset>0x066</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0410</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <name>P109PFS_BY</name>
                    <description>P109 Pin Function Control Register</description>
                    <alternateRegister>P109PFS</alternateRegister>
                    <addressOffset>0x067</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
