amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>P201PFS_HA</name>
                    <description>P201 Pin Function Control Register</description>
                    <alternateRegister>P201PFS</alternateRegister>
                    <addressOffset>0x086</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0010</resetValue>
                    <resetMask>0xFFFD</resetMask>
                    <fields>
                        <field>
                            <name>ASEL</name>
                            <description>Analog Input enable</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ISEL</name>
                            <description>IRQ input enable</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EOF</name>
                            <description>Event on Falling</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EOR</name>
                            <description>Event on Rising</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DSCR</name>
                            <description>Drive Strength Control Register</description>
                            <lsb>10</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NCODR</name>
                            <description>N,Channel Open Drain Control</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PCR</name>
                            <description>Pull,up Control</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PDR</name>
                            <description>Port Direction</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PIDR</name>
                            <description>Port Input Data</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PODR</name>
                            <description>Port Output Data</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>P201PFS_BY</name>
                    <description>P201 Pin Function Control Register</description>
                    <alternateRegister>P201PFS</alternateRegister>
                    <addressOffset>0x087</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFD</resetMask>
                    <fields>
                        <field>
                            <name>NCODR</name>
                            <description>N,Channel Open Drain Control</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PCR</name>
                            <description>Pull,up Control</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PDR</name>
                            <description>Port Direction</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PIDR</name>
                            <description>Port Input Data</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PODR</name>
                            <description>Port Output Data</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>2-9</dimIndex>
                    <name>P20%sPFS</name>
                    <description>P20%s Pin Function Control Register</description>
                    <addressOffset>0x088</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>2-9</dimIndex>
                    <name>P20%sPFS_HA</name>
                    <description>P20%s Pin Function Control Register</description>
                    <alternateRegister>P20%sPFS</alternateRegister>
                    <addressOffset>0x08A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>2-9</dimIndex>
                    <name>P20%sPFS_BY</name>
                    <description>P20%s Pin Function Control Register</description>
                    <alternateRegister>P20%sPFS</alternateRegister>
                    <addressOffset>0x08B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>5</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-14</dimIndex>
                    <name>P2%sPFS</name>
                    <description>P2%s Pin Function Control Register</description>
                    <addressOffset>0x0A8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>5</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-14</dimIndex>
                    <name>P2%sPFS_HA</name>
                    <description>P2%s Pin Function Control Register</description>
                    <alternateRegister>P2%sPFS</alternateRegister>
                    <addressOffset>0x0AA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>5</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-14</dimIndex>
                    <name>P2%sPFS_BY</name>
                    <description>P2%s Pin Function Control Register</description>
                    <alternateRegister>P2%sPFS</alternateRegister>
                    <addressOffset>0x0AB</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <name>P300PFS</name>
                    <description>P300 Pin Function Control Register</description>
                    <addressOffset>0x0C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010010</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <name>P300PFS_HA</name>
                    <description>P300 Pin Function Control Register</description>
                    <alternateRegister>P300PFS</alternateRegister>
                    <addressOffset>0x0C2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0010</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <name>P300PFS_BY</name>
                    <description>P300 Pin Function Control Register</description>
                    <alternateRegister>P300PFS</alternateRegister>
                    <addressOffset>0x0C3</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>9</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-9</dimIndex>
                    <name>P30%sPFS</name>
                    <description>P30%s Pin Function Control Register</description>
                    <addressOffset>0x0C4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>9</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-9</dimIndex>
                    <name>P30%sPFS_HA</name>
                    <description>P30%s Pin Function Control Register</description>
                    <alternateRegister>P30%sPFS</alternateRegister>
                    <addressOffset>0x0C6</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>9</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-9</dimIndex>
                    <name>P30%sPFS_BY</name>
                    <description>P30%s Pin Function Control Register</description>
                    <alternateRegister>P30%sPFS</alternateRegister>
                    <addressOffset>0x0C7</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-15</dimIndex>
                    <name>P3%sPFS</name>
                    <description>P3%s Pin Function Control Register</description>
                    <addressOffset>0x0E8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-15</dimIndex>
                    <name>P3%sPFS_HA</name>
                    <description>P30%s Pin Function Control Register</description>
                    <alternateRegister>P3%sPFS</alternateRegister>
                    <addressOffset>0x0EA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-15</dimIndex>
                    <name>P3%sPFS_BY</name>
                    <description>P30%s Pin Function Control Register</description>
                    <alternateRegister>P3%sPFS</alternateRegister>
                    <addressOffset>0x0EB</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-9</dimIndex>
                    <name>P40%sPFS</name>
                    <description>P40%s Pin Function Control Register</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-9</dimIndex>
                    <name>P40%sPFS_HA</name>
                    <description>P40%s Pin Function Control Register</description>
                    <alternateRegister>P40%sPFS</alternateRegister>
                    <addressOffset>0x102</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-9</dimIndex>
                    <name>P40%sPFS_BY</name>
                    <description>P40%s Pin Function Control Register</description>
                    <alternateRegister>P40%sPFS</alternateRegister>
                    <addressOffset>0x103</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-15</dimIndex>
                    <name>P4%sPFS</name>
                    <description>P4%s Pin Function Control Register</description>
                    <addressOffset>0x128</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-15</dimIndex>
                    <name>P4%sPFS_HA</name>
                    <description>P4%s Pin Function Control Register</description>
                    <alternateRegister>P4%sPFS</alternateRegister>
                    <addressOffset>0x12A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-15</dimIndex>
                    <name>P4%sPFS_BY</name>
                    <description>P4%s Pin Function Control Register</description>
                    <alternateRegister>P4%sPFS</alternateRegister>
                    <addressOffset>0x12B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>9</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-8</dimIndex>
                    <name>P50%sPFS</name>
                    <description>P50%s Pin Function Control Register</description>
                    <addressOffset>0x140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>9</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-8</dimIndex>
                    <name>P50%sPFS_HA</name>
                    <description>P50%s Pin Function Control Register</description>
                    <alternateRegister>P50%sPFS</alternateRegister>
                    <addressOffset>0x142</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>9</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-8</dimIndex>
                    <name>P50%sPFS_BY</name>
                    <description>P50%s Pin Function Control Register</description>
                    <alternateRegister>P50%sPFS</alternateRegister>
                    <addressOffset>0x143</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>5</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>11-15</dimIndex>
                    <name>P5%sPFS</name>
                    <description>P5%s Pin Function Control Register</description>
                    <addressOffset>0x16C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
                <register>
                    <dim>5</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>11-15</dimIndex>
                    <name>P5%sPFS_HA</name>
                    <description>P5%s Pin Function Control Register</description>
                    <alternateRegister>P5%sPFS</alternateRegister>
                    <addressOffset>0x16E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFD</resetMask>
                </register>
                <register>
                    <dim>5</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>11-15</dimIndex>
                    <name>P5%sPFS_BY</name>
                    <description>P5%s Pin Function Control Register</description>
                    <alternateRegister>P5%sPFS</alternateRegister>
                    <addressOffset>0x16F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                </register>
                <register>
                    <dim>10</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-9</dimIndex>
                    <name>P60%sPFS</name>
                    <description>P60%s Pin Function Control Register</description>
                    <addressOffset>0x180</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                </register>
