amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>GTCSR</name>
                    <description>General PWM Timer Clear Source Select Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CCLR</name>
                            <description>Software Source Counter Clear Enable</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSELCH</name>
                            <description>ELC_GPTH Event Source Counter Clear Enable</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSELCG</name>
                            <description>ELC_GPTG Event Source Counter Clear Enable</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSELCF</name>
                            <description>ELC_GPTF Event Source Counter Clear Enable</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSELCE</name>
                            <description>ELC_GPTE Event Source Counter Clear Enable</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSELCD</name>
                            <description>ELC_GPTD Event Source Counter Clear Enable</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSELCC</name>
                            <description>ELC_GPTC Event Source Counter Clear Enable</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSELCB</name>
                            <description>ELC_GPTB Event Source Counter Clear Enable</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSELCA</name>
                            <description>ELC_GPTA Event Source Counter Clear Enable</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSCBFAH</name>
                            <description>GTIOCB Pin Falling Input during GTIOCA Value High Source Counter Clear Enable</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSCBFAL</name>
                            <description>GTIOCB Pin Falling Input during GTIOCA Value Low Source Counter Clear Enable</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSCBRAH</name>
                            <description>GTIOCB Pin Rising Input during GTIOCA Value High Source Counter Clear Enable</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSCBRAL</name>
                            <description>GTIOCB Pin Rising Input during GTIOCA Value Low Source Counter Clear Enable</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSCAFBH</name>
                            <description>GTIOCA Pin Falling Input during GTIOCB Value High Source Counter Clear Enable</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSCAFBL</name>
                            <description>GTIOCA Pin Falling Input during GTIOCB Value Low Source Counter Clear Enable</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSCARBH</name>
                            <description>GTIOCA Pin Rising Input during GTIOCB Value High Source Counter Clear Enable</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSCARBL</name>
                            <description>GTIOCA Pin Rising Input during GTIOCB Value Low Source Counter Clear Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSGTRGDF</name>
                            <description>GTETRGD Pin Falling Input Source Counter Clear Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSGTRGDR</name>
                            <description>GTETRGD Pin Rising Input Source Counter Clear Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSGTRGCF</name>
                            <description>GTETRGC Pin Falling Input Source Counter Clear Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSGTRGCR</name>
                            <description>GTETRGC Pin Rising Input Source Counter Clear Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSGTRGBF</name>
                            <description>GTETRGB Pin Falling Input Source Counter Clear Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSGTRGBR</name>
                            <description>GTETRGB Pin Rising Input Source Counter Clear Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSGTRGAF</name>
                            <description>GTETRGA Pin Falling Input Source Counter Clear Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CSGTRGAR</name>
                            <description>GTETRGA Pin Rising Input Source Counter Clear Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GTUPSR</name>
                    <description>General PWM Timer Up Count Source Select Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>USELCH</name>
                            <description>ELC_GPTH Event Source Counter Count Up Enable</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USELCG</name>
                            <description>ELC_GPTG Event Source Counter Count Up Enable</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USELCF</name>
                            <description>ELC_GPTF Event Source Counter Count Up Enable</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USELCE</name>
                            <description>ELC_GPTE Event Source Counter Count Up Enable</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USELCD</name>
                            <description>ELC_GPTD Event Source Counter Count Up Enable</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USELCC</name>
                            <description>ELC_GPTC Event Source Counter Count Up Enable</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USELCB</name>
                            <description>ELC_GPTB Event Source Counter Count Up Enable</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USELCA</name>
                            <description>ELC_GPTA Event Source Counter Count Up Enable</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USCBFAH</name>
                            <description>GTIOCB Pin Falling Input during GTIOCA Value High Source Counter Count Up Enable</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USCBFAL</name>
                            <description>GTIOCB Pin Falling Input during GTIOCA Value Low Source Counter Count Up Enable</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USCBRAH</name>
                            <description>GTIOCB Pin Rising Input during GTIOCA Value High Source Counter Count Up Enable</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USCBRAL</name>
                            <description>GTIOCB Pin Rising Input during GTIOCA Value Low Source Counter Count Up Enable</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USCAFBH</name>
                            <description>GTIOCA Pin Falling Input during GTIOCB Value High Source Counter Count Up Enable</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USCAFBL</name>
                            <description>GTIOCA Pin Falling Input during GTIOCB Value Low Source Counter Count Up Enable</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USCARBH</name>
                            <description>GTIOCA Pin Rising Input during GTIOCB Value High Source Counter Count Up Enable</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USCARBL</name>
                            <description>GTIOCA Pin Rising Input during GTIOCB Value Low Source Counter Count Up Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USGTRGDF</name>
                            <description>GTETRGD Pin Falling Input Source Counter Count Up Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USGTRGDR</name>
                            <description>GTETRGD Pin Rising Input Source Counter Count Up Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USGTRGCF</name>
                            <description>GTETRGC Pin Falling Input Source Counter Count Up Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USGTRGCR</name>
                            <description>GTETRGC Pin Rising Input Source Counter Count Up Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USGTRGBF</name>
                            <description>GTETRGB Pin Falling Input Source Counter Count Up Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USGTRGBR</name>
                            <description>GTETRGB Pin Rising Input Source Counter Count Up Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USGTRGAF</name>
                            <description>GTETRGA Pin Falling Input Source Counter Count Up Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USGTRGAR</name>
                            <description>GTETRGA Pin Rising Input Source Counter Count Up Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
