amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>GTDBD</name>
                    <description>General PWM Timer Dead Time Buffer Register D</description>
                    <addressOffset>0x98</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GTDBD</name>
                            <description>Dead Time Buffer Register D</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GTSOS</name>
                    <description>General PWM Timer Output Protection Function Status Register</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SOS</name>
                            <description>Output Protection Function Status</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GTSOTR</name>
                    <description>General PWM Timer Output Protection Function Temporary Release Register</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SOTR</name>
                            <description>Output Protection Function Temporary Release</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="GPT32EH0">
            <name>GPT32EH1</name>
            <description>General PWM Timer 1  (32-bit Enhanced High Resolution)</description>
            <baseAddress>0x40078100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT32EH0">
            <name>GPT32EH2</name>
            <description>General PWM Timer 2  (32-bit Enhanced High Resolution)</description>
            <baseAddress>0x40078200</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT32EH0">
            <name>GPT32EH3</name>
            <description>General PWM Timer 3  (32-bit Enhanced High Resolution)</description>
            <baseAddress>0x40078300</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT32EH0">
            <name>GPT32E4</name>
            <description>General PWM Timer 4  (32-bit Enhanced)</description>
            <baseAddress>0x40078400</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT32EH0">
            <name>GPT32E5</name>
            <description>General PWM Timer 5  (32-bit Enhanced)</description>
            <baseAddress>0x40078500</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT32EH0">
            <name>GPT32E6</name>
            <description>General PWM Timer 6  (32-bit Enhanced)</description>
            <baseAddress>0x40078600</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT32EH0">
            <name>GPT32E7</name>
            <description>General PWM Timer 7  (32-bit Enhanced)</description>
            <baseAddress>0x40078700</baseAddress>
        </peripheral>
        <peripheral>
            <name>GLCDC</name>
            <description>Graphics LCD Controller</description>
            <baseAddress>0x400E0000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>4124</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1100</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1104</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1108</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x110C</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1110</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1114</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1118</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x111C</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1120</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1124</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1128</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x112C</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1130</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1134</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1138</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x113C</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1140</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x114C</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1150</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1154</offset>
                <size>512</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1300</offset>
                <size>192</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1304</offset>
                <size>196</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x130C</offset>
                <size>192</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1310</offset>
                <size>192</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1314</offset>
                <size>192</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1318</offset>
                <size>192</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x131C</offset>
                <size>192</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1320</offset>
                <size>192</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1324</offset>
                <size>192</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1328</offset>
                <size>192</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x132C</offset>
                <size>192</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1330</offset>
                <size>192</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1334</offset>
                <size>192</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1338</offset>
                <size>192</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x13C0</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x13E4</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1404</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x140C</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1418</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x141C</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1428</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1440</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>256</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-255</dimIndex>
                    <name>GR1_CLUT0[%s]</name>
                    <description>Color Palette 0 Plane for Graphics 1 Plane</description>
                    <addressOffset>0x0000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>A</name>
                            <description>Alpha Blending Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>R Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>G</name>
                            <description>G Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>B</name>
                            <description>B Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>256</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-255</dimIndex>
                    <name>GR1_CLUT1[%s]</name>
                    <description>Color Palette 1 Plane for Graphics 1 Plane</description>
                    <addressOffset>0x0400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>A</name>
                            <description>Alpha Blending Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>R Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>G</name>
                            <description>G Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>B</name>
                            <description>B Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>256</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-255</dimIndex>
                    <name>GR2_CLUT0[%s]</name>
                    <description>Color Palette 0 Plane for Graphics 2 Plane</description>
                    <addressOffset>0x0800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>A</name>
                            <description>Alpha Blending Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>R Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>G</name>
                            <description>G Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>B</name>
                            <description>B Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>256</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-255</dimIndex>
                    <name>GR2_CLUT1[%s]</name>
                    <description>Color Palette 1 Plane for Graphics 2 Plane</description>
                    <addressOffset>0x0C00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>A</name>
                            <description>Alpha Blending Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>R Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>G</name>
                            <description>G Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>B</name>
                            <description>B Value of Color Palette n Plane for Graphics m Plane</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_EN</name>
                    <description>Background Plane Setting Operation Control Register</description>
                    <addressOffset>0x1000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SWRST</name>
                            <description>Entire module SW reset control</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>VEN</name>
                            <description>Control of LCDC internal register value reflection to internal operations</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToSet</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>Background plane generation module operation enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
