amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>BG_PERI</name>
                    <description>Background Plane Setting Free,Running Period Register</description>
                    <addressOffset>0x1004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00170017</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FV</name>
                            <description>Background plane vertical synchronization signal period on the basis of line.</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x013</minimum>
                                    <maximum>0x3FF</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FH</name>
                            <description>Background plane horizontal synchronization signal period on the basis of pixel clock (PXCLK).</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x017</minimum>
                                    <maximum>0x3FF</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_SYNC</name>
                    <description>Background Plane Setting Synchronization Position Register</description>
                    <addressOffset>0x1008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010001</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VP</name>
                            <description>Background plane vertical synchronization signal assertion position on the basis of line.</description>
                            <lsb>16</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HP</name>
                            <description>Background plane horizontal synchronization signal assertion position on the basis of pixel clock (PXCLK).</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_VSIZE</name>
                    <description>Background Plane Setting Full Image Vertical Size Register</description>
                    <addressOffset>0x100C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00070010</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VP</name>
                            <description>Background plane vertical valid pixel start position on the basis of line</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x0003</minimum>
                                    <maximum>0x3EF</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>VW</name>
                            <description>Background plane vertical valid pixel width on the basis of line </description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x0010</minimum>
                                    <maximum>0x03FC</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_HSIZE</name>
                    <description>Background Plane Setting Full Image Horizontal Size Register</description>
                    <addressOffset>0x1010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00060010</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HP</name>
                            <description>Background plane horizontal valid pixel start position on the basis of pixel clock (PXCLK).</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x006</minimum>
                                    <maximum>0x3EE</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HW</name>
                            <description>Background plane horizontall valid pixel width on the basis of pixel clock (PXCLK)Note: When serial RGB is selected as the output format for the output control block, add two to the horizontal enable signal width and set the resulting value to this field. </description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x010</minimum>
                                    <maximum>0x3F8</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_BGC</name>
                    <description>Background Plane Setting Background Color Register</description>
                    <addressOffset>0x1014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>R</name>
                            <description>R value for background plane valid pixel area.Unsigned; 8-bit integer.</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>G</name>
                            <description>G value for background plane valid pixel areaUnsigned; 8-bit integer</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>B</name>
                            <description>B value for background plane valid pixel areaUnsigned; 8-bit integer</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BG_MON</name>
                    <description>Background Plane Setting Status Monitor Register</description>
                    <addressOffset>0x1018</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SWRST</name>
                            <description>Entire module SW reset state monitor.</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>VEN</name>
                            <description>Entire module internal operation reflection control signal monitor.The signal  state for controlling reflection of the register values to the internal operations upon assertion of the vertical synchronization signal.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>Background plane generation module operation state monitor.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_VEN</name>
                    <description>Graphics %s  Register Update Control Register</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PVEN</name>
                            <description>Control of graphics n module register value reflection to internal operations.Reflection of the register values to the internal operation at the assertion of the vertical synchronization signal (VS).</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_FLMRD</name>
                    <description>Graphics %s Frame Buffer Read Control Register</description>
                    <addressOffset>0x1104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RENB</name>
                            <description>Graphics data (frame buffer data) read enable.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_FLM1</name>
                    <description>Graphics %s Frame Buffer Control Register 1</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BSTMD</name>
                            <description>Burst transfer control for graphics data (frame buffer data)access</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_FLM2</name>
                    <description>Graphics %s Frame Buffer Control Register 2</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BASE</name>
                            <description>Base address for accessing graphics data (frame buffer data)Set the head address in the frame buffer where graphics data is to be stored. GRn_FLM2.BASE[5:0] should be fixed to 0 during 64-byte burst transfer.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_FLM3</name>
                    <description>Graphics %s Frame Buffer Control Register 3</description>
                    <addressOffset>0x1110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LNOFF</name>
                            <description>Macro line offset address for accessing graphics data(frame buffer data)Signed; 16-bit integer</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_FLM5</name>
                    <description>Graphics %s Frame Buffer Control Register 5</description>
                    <addressOffset>0x1118</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000F0000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LNNUM</name>
                            <description>Number of lines per frame for accessing graphics data (frame buffer data).</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x00F</minimum>
                                    <maximum>0x3FF</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DATANUM</name>
                            <description>Number of data transfer times per line for accessing graphics data (frame buffer data), where one transfer is defined as 16-beat burst access (64-byte boundary)</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_FLM6</name>
                    <description>Graphics %s Frame Buffer Control Register 6</description>
                    <addressOffset>0x111C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FORMAT</name>
                            <description>Data format for accessing graphics data (frame buffer data).</description>
                            <lsb>28</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_AB1</name>
                    <description>Graphics %s Alpha Blending Control Register 1</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ARCON</name>
                            <description>Rectangular area alpha blending control.</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ARCDISPON</name>
                            <description>Image area border display control for rectangular area alpha blending.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>GRCDISPON</name>
                            <description>Graphics image area border display control.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DISPSEL</name>
                            <description>Graphics display plane control.</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
