amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_AB2</name>
                    <description>Graphics %s Alpha Blending Control Register 2</description>
                    <addressOffset>0x1124</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00060010</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GRCVS</name>
                            <description>Vertical start position of graphics image area.</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x002</minimum>
                                    <maximum>0x3EE</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>GRCVW</name>
                            <description>Vertical width of graphics image area.</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x010</minimum>
                                    <maximum>0x3FC</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_AB3</name>
                    <description>Graphics %s Alpha Blending Control Register 3</description>
                    <addressOffset>0x1128</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00050010</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GRCHS</name>
                            <description>Horizontal start position of graphics image area.</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x005</minimum>
                                    <maximum>0x3ED</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>GRCHW</name>
                            <description>Horizontal width of graphics image area.</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x010</minimum>
                                    <maximum>0x3F0</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_AB4</name>
                    <description>Graphics %s Alpha Blending Control Register 4</description>
                    <addressOffset>0x112C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00060010</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ARCVS</name>
                            <description>Vertical start position of rectangular area alpha blending image area</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x002</minimum>
                                    <maximum>0x3EE</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ARCVW</name>
                            <description>Vertical width of rectangular area alpha blending image area.</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x001</minimum>
                                    <maximum>0x3FC</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_AB5</name>
                    <description>Graphics %s Alpha Blending Control Register 5</description>
                    <addressOffset>0x1130</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00050010</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ARCHS</name>
                            <description>Horizontal start position of rectangular area alpha blending image area.</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x005</minimum>
                                    <maximum>0x3ED</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ARCHW</name>
                            <description>Horizontal width of rectangular area alpha blending image area.</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x001</minimum>
                                    <maximum>0x3F8</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_AB6</name>
                    <description>Graphics %s Alpha Blending Control Register 6</description>
                    <addressOffset>0x1134</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ARCCOEF</name>
                            <description>Alpha coefficient for alpha blending in rectangular area (-255 to 255).[8]: Sign (0: addition, 1: subtraction)[7:0]: Variation (absolute value)</description>
                            <lsb>16</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARCRATE</name>
                            <description>Frame rate for alpha blending in rectangular area.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_AB7</name>
                    <description>Graphics %s Alpha Blending Control Register 7</description>
                    <addressOffset>0x1138</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ARCDEF</name>
                            <description>Initial alpha value for alpha blending in rectangular area.</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKON</name>
                            <description>RGB,index chroma,key processing control.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_AB8</name>
                    <description>Graphics %s Alpha Blending Control Register 8</description>
                    <addressOffset>0x113C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CKKG</name>
                            <description>G signal for RGB,index chroma,key processingUnsigned; 8 bits.</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKKB</name>
                            <description>B signal for RGB,index chroma,key processingUnsigned; 8 bits.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKKR</name>
                            <description>R signal for RGB,index chroma,key processingUnsigned; 8 bits.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_AB9</name>
                    <description>Graphics %s Alpha Blending Control Register 9</description>
                    <addressOffset>0x1140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CKA</name>
                            <description>A value after RGB,index chroma,key processing replacement.</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKG</name>
                            <description>G value after RGB,index chroma,key processing replacementUnsigned; 8 bits.</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKB</name>
                            <description>B value after RGB,index chroma,key processing replacementUnsigned; 8 bits.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKR</name>
                            <description>R value after RGB,index chroma,key processing replacementUnsigned; 8 bits.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_BASE</name>
                    <description>Graphics %s Background Color Control Register</description>
                    <addressOffset>0x114C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>G</name>
                            <description>Background color G valueUnsigned; 8 bits</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>B</name>
                            <description>Background color B valueUnsigned; 8 bits</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R</name>
                            <description>Background color R valueUnsigned; 8 bits</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_CLUTINT</name>
                    <description>Graphics %s CLUT Table Interrupt Control Register</description>
                    <addressOffset>0x1150</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>CLUT table control</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LINE</name>
                            <description>Number of detection lines</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x000</minimum>
                                    <maximum>0x400</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>GR%s_MON</name>
                    <description>Graphics %s Status Monitor Register</description>
                    <addressOffset>0x1154</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>UNDFLST</name>
                            <description>Status monitor for underflow</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ARCST</name>
                            <description>Status monitor for alpha blending in rectangular area</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x40</dimIncrement>
                    <dimIndex>G,B,R</dimIndex>
                    <name>GAM%s_LATCH</name>
                    <description>Gamma %s Register Update Control Register</description>
                    <addressOffset>0x1300</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VEN</name>
                            <description>Control of gamma correction x module register value reflection to internal operations.The register values to be reflected to the internal operations at the assertion of the vertical synchronization signal (VS). </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GAM_SW</name>
                    <description>Gamma Correction Block Function Switch Register</description>
                    <addressOffset>0x1304</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GAMON</name>
                            <description>Gamma correction on/off control</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
