amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>OUT_SET</name>
                    <description>Output Control Block Output Interface Register</description>
                    <addressOffset>0x13C4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ENDIANON</name>
                            <description>Bit endian change control</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SWAPON</name>
                            <description>Pixel order control</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FORMAT</name>
                            <description>Output format select</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FRQSEL</name>
                            <description>Clock frequency division control</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIRSEL</name>
                            <description>Invalid data position control in serial RGB format</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PHASE</name>
                            <description>Data delay in serial RGB format (based on OUTCLK)</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT_BRIGHT1</name>
                    <description>Output Control Block Brightness Correction Register 1</description>
                    <addressOffset>0x13C8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BRTG</name>
                            <description>Brightness (DC) adjustment of G signalUnsigned; 10 bits; +512 with offset; integer</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT_BRIGHT2</name>
                    <description>Output Control Block Brightness Correction Register 2</description>
                    <addressOffset>0x13CC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BRTB</name>
                            <description>Brightness (DC) adjustment of B signalUnsigned; 10 bits; +512 with offset; integer</description>
                            <lsb>16</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BRTR</name>
                            <description>Brightness (DC) adjustment of R signalUnsigned; 10 bits; +512 with offset; integer</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT_CONTRAST</name>
                    <description>Output Control Block Contrast Correction Register</description>
                    <addressOffset>0x13D0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CONTG</name>
                            <description>Contrast (GAIN) adjustment of G signalUnsigned; 8 bits fixed point.</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CONTB</name>
                            <description>Contrast (GAIN) adjustment of B signalUnsigned; 8 bits fixed point</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CONTR</name>
                            <description>Contrast (GAIN) adjustment of R signalUnsigned; 8 bits fixed point</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT_PDTHA</name>
                    <description>Output Control Block Panel Dither Correction Register</description>
                    <addressOffset>0x13D4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>Operation mode</description>
                            <lsb>20</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FORM</name>
                            <description>Output format select</description>
                            <lsb>16</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PA</name>
                            <description>Pattern value (A) of 2 x 2 pattern ditherUnsigned 2-bit integer</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PB</name>
                            <description>Pattern value (B) of 2 x 2 pattern ditherUnsigned 2-bit integer</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PC</name>
                            <description>Pattern value (C) of 2 x 2 pattern ditherUnsigned 2-bit integer</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PD</name>
                            <description>Pattern value (D) of 2 x 2 pattern ditherUnsigned 2-bit integer</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT_CLKPHASE</name>
                    <description>Output Control Block Output Phase Control Register</description>
                    <addressOffset>0x13E4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FRONTGAM</name>
                            <description>Correction control</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LCDEDGE</name>
                            <description>LCD_DATA Output Phase Control</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TCON0EDGE</name>
                            <description>LCD_TCON0 Output Phase Control</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TCON1EDGE</name>
                            <description>LCD_TCON1 Output Phase Control</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TCON2EDGE</name>
                            <description>LCD_TCON2 Output Phase Control</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TCON3EDGE</name>
                            <description>LCD_TCON3 Output Phase Control</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TCON_TIM</name>
                    <description>TCON Reference Timing Setting Register</description>
                    <addressOffset>0x1404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HALF</name>
                            <description>Vertical synchronization signal generation change timing Sets the delay from the assertion of the internal horizontal synchronization signal in terms of pixels.</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x000</minimum>
                                    <maximum>0x3FF</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OFFSET</name>
                            <description>Horizontal synchronization signal generation reference timingSets the offset from the assertion of the internal horizontal synchronization signal in terms of pixels.</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x000</minimum>
                                    <maximum>0x3FF</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>A,B</dimIndex>
                    <name>TCON_STV%s1</name>
                    <description>TCON Vertical Timing Setting Register %s1</description>
                    <addressOffset>0x1408</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VS</name>
                            <description>STVx1 first change timing</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x000</minimum>
                                    <maximum>0x7FF</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>VW</name>
                            <description>STVx1 second change timingSets the signal assertion width.</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x000</minimum>
                                    <maximum>0x7FF</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>A,B</dimIndex>
                    <name>TCON_STV%s2</name>
                    <description>TCON Vertical Timing Setting Register %s2</description>
                    <addressOffset>0x140C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INV</name>
                            <description>STVx signal polarity inversion control </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL</name>
                            <description>Output signal select control for VSOUT (controlled by TCON_STVA2 register)/VEOUT (controlled by the TCON_STVB2 register) pin</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>A,B</dimIndex>
                    <name>TCON_STH%s1</name>
                    <description>TCON Horizontal Timing Setting Register STH%s1</description>
                    <addressOffset>0x1418</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HS</name>
                            <description>STHx1 first change timing</description>
                            <lsb>16</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x000</minimum>
                                    <maximum>0x3FF</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HW</name>
                            <description>STHx1 second change timing.Sets the signal assertion width.</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x000</minimum>
                                    <maximum>0x3FF</maximum>
                                </range>
                            </writeConstraint>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>A,B</dimIndex>
                    <name>TCON_STH%s2</name>
                    <description>TCON Horizontal Timing Setting Register STH%s2</description>
                    <addressOffset>0x141C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HSSEL</name>
                            <description>STHx signal generation reference timing control.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>INV</name>
                            <description>STVx signal polarity inversion control.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL</name>
                            <description>Output signal select control for LCD_TCON2 (controlled by TCON_STHA2 register)/LCD_TCON3 (controlled by the TCON_STHB2 register) pin.</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
