amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>TCON_DE</name>
                    <description>TCON Data Enable Polarity Setting Register</description>
                    <addressOffset>0x1428</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INV</name>
                            <description>DE signal polarity inversion control.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCNT_DTCTEN</name>
                    <description>System Control Block State Detection Control Register</description>
                    <addressOffset>0x1440</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>L2UNDFDTC</name>
                            <description>Graphics 2 underflow detection control</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>L1UNDFDTC</name>
                            <description>Graphics 1 underflow detection control</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>VPOSDTC</name>
                            <description>Specified line detection control</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCNT_INTEN</name>
                    <description>System Control Block Interrupt Request Enable Control Register</description>
                    <addressOffset>0x1444</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>L2UNDFINTEN</name>
                            <description>Interrupt request signal GLCDC_L2UNDF enable control.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>L1UNDFINTEN</name>
                            <description>Interrupt request signal GLCDC_L1UNDF enable control.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>VPOSINTEN</name>
                            <description>Interrupt request signal GLCDC_VPOS enable control.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCNT_STCLR</name>
                    <description>System Control Block Status Clear Register</description>
                    <addressOffset>0x1448</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>L2UNDFCLR</name>
                            <description>Graphics 2 underflow detection flag clear field</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>L1UNDFCLR</name>
                            <description>Graphics 1 underflow detection flag clear field</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>VPOSCLR</name>
                            <description>Graphics 2 specified line detection flag clear field</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCNT_STMON</name>
                    <description>System Control Block Status Monitor Register</description>
                    <addressOffset>0x144C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>L2UNDF</name>
                            <description>Graphics 2 underflow detection flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>L1UNDF</name>
                            <description>Graphics 1 underflow detection flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>VPOS</name>
                            <description>Graphics 2 specified line detection flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCNT_PANEL_CLK</name>
                    <description>System Control Block Version and Panel Clock Control Register</description>
                    <addressOffset>0x1450</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x01100000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VER</name>
                            <description>Version informationVersion information of the GLCD</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIXSEL</name>
                            <description>Pixel clock select control.Must be set to the same value as OUT_SET.FRQSEL[1].</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CLKSEL</name>
                            <description>Panel clock supply source select</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CLKEN</name>
                            <description>Panel clock output enable controlNote: Before changing the PIXSEL,CLKSEL or DCDR bit, this bit must be set to 0.</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DCDR</name>
                            <description>Clock division ratio setting controlRefer toTable 2.7.1 for details about setting value.Note: Settings that are not listed in table 2.7.1 are prohibited.</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
