amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>CONTROL2</name>
                    <description>Surface Control Register </description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RLEPIXELWIDTH</name>
                            <description>Texel width for RLE unit</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BDIA</name>
                            <description>Blend destination factor inverted in alpha channel (USEACB = 1)</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BSIA</name>
                            <description>Blend source factor inverted in alpha channel (USEACB = 1)</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CLUTFORMAT</name>
                            <description>Format of the CLUT</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>COLKEYENABLE</name>
                            <description>color keying enable</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CLUTENABLE</name>
                            <description>CLUT enable</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RLEENABLE</name>
                            <description>RLE enable</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WRITEALPHA</name>
                            <description>Writeback alpha source for framebufferSet the 'alpha source' for the framebuffer(USEACB = 0)Blend alpha in color 2 instead of framebuffer alpha((USEACB = 1))In not alpha channel blending mode (USEACB = 0):Set the 'alpha source' for the framebuffer.In alpha channel blending mode (USEACB = 1):Blend alpha in color 2 instead of framebuffer alpha00B:  BC2A = 1: use alpha from framebuffer as destination (DST_A)else: BC2A = 0: use alpha in color 2 as destination (DST_A)</description>
                            <lsb>22</lsb>
                            <msb>23</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WRITEFORMAT10</name>
                            <description>Pixel format of the framebuffer</description>
                            <lsb>20</lsb>
                            <msb>21</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>READFORMAT10</name>
                            <description>Pixel format of the texture buffer{READFORMAT32,READFORMAT10}0000: 8 bpp a(8)0001: 16 bpp RGB(565)0010: 32 bpp aRGB(8888)0011: 16 bpp aRGB(4444)0100: 16 bpp aRGB(1555)0101: 8 bpp aCLUT(44) 4 bit alpha and 4 bit indexed color1001: 8 bpp CLUT(8)/I(8), 8 bit indexed color/luminance1010: 4 bpp CLUT(4)/I(4), 4 bit indexed color/luminance1011: 2 bpp CLUT(2)/I(2), 2 bit indexed color/luminance 1100: 1 bpp CLUT(1)/I(1), 1 bit indexed color/luminance</description>
                            <lsb>18</lsb>
                            <msb>19</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEXTUREFILTERY</name>
                            <description>Linear filtering on texture V axis</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEXTUREFILTERX</name>
                            <description>Linear filtering on texture U axis</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEXTURECLAMPY</name>
                            <description>Calculating V limiter outside use textureThe bit describes what happens if the V limiter (y direction in texture space) calculates a V value outside of the used texture</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEXTURECLAMPX</name>
                            <description>Calculating U limiter outside use textureThe bit describes what happens if the U limiter (x direction in texture space) calculates a U value outside of the used texture</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BC2</name>
                            <description>Blend color 2 instead of framebuffer pixel</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BDI</name>
                            <description>Blend destination factor is inverteddst factor will be inverted (meaning 1-a or 1-1 depending on BDF)</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BSI</name>
                            <description>Blend source factor is invertedsrc factor will be inverted (meaning 1-a or 1-1 depending on BSF)</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BDF</name>
                            <description>Blend destination factordst factor is alpha (factor is 1 per default)</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BSF</name>
                            <description>Blend source factorsrc factor is alpha (factor is 1 per default)</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WRITEFORMAT2</name>
                            <description>Bit 3 of framebuffer pixel formatSee WRITEFORMAT above description.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BDFA</name>
                            <description>Blend destinetion factor  for alpha channel in alpha channel blending mode (USEACB = 1)</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BSFA</name>
                            <description>Blend source factor  for alpha channel in alpha channel blending mode (USEACB = 1)</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>READFORMAT32</name>
                            <description>Bit 4 and 3 of the texture buffer format.See READFORMAT above for description</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>USEACB</name>
                            <description>Alpha blend mode</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PATTERNSOURCEL5</name>
                            <description>Limiter 5 is used as pattern index instead of the default U limiter.Limiter 5 can be combined with limiter 6 to form a quadratic limiter which can be used to make quadratic pattern functions to draw radial patterns.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TEXTUREENABLE</name>
                            <description>Pixel source is read from texture and used as an alpha to blend between COLOR1 and COLOR2</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PATTERNENABLE</name>
                            <description>Pixel source is a pattern color (blend of COLOR1 and COLOR2 depending on PATTERN and pattern index)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IRQCTL</name>
                    <description>Interrupt Control Register</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BUSIRQCLR</name>
                            <description>Clear bus error interrupt BUSIRQ</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSIRQEN</name>
                            <description>BUSIRQ interrupt mask enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLISTIRQCLR</name>
                            <description>Clear display list interrupt DLISTIRQ</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ENUMIRQCLR</name>
                            <description>Clear enumeration interrupt ENUMIRQ</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLISTIRQEN</name>
                            <description>DLISTIRQ interrupt mask enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ENUMIRQEN</name>
                            <description>ENUMIRQ interrupt mask enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CACHECTL</name>
                    <description>Cache Control Register</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CFLUSHTX</name>
                            <description>Flush texture cache</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CENABLETX</name>
                            <description>Texture cache enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CFLUSHFX</name>
                            <description>Flush framebuffer cache</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CENABLEFX</name>
                            <description>Framebuffer cache enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
