amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>STATUS</name>
                    <description>Status Control Register</description>
                    <alternateRegister>CONTROL</alternateRegister>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BUSERRMDL</name>
                            <description>display list bus error interrupt triggered</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSERRMTXMRL</name>
                            <description>texture bus error interrupt triggered</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSERRMFB</name>
                            <description>framebuffer bus error interrupt triggered</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSIRQ</name>
                            <description>bus error interrupt triggered</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLISTIRQ</name>
                            <description>display list finished interrupt triggered</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ENUMIRQ</name>
                            <description>enumeration finished interrupt triggered</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLISTACTIVE</name>
                            <description>Display list reader status</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CACHEDIRTY</name>
                            <description>Framebuffer cache status</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSYWRITE</name>
                            <description>Framebuffer writeback status</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSYENUM</name>
                            <description>Enumeration unit status</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HWREVISION</name>
                    <description>Hardware Version and Feature Set ID Register</description>
                    <alternateRegister>CONTROL2</alternateRegister>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0FBE0107</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ACBLEND</name>
                            <description>Alpha channel blending feature </description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>COLORKEY</name>
                            <description>Colorkey feature </description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEXCLUT256</name>
                            <description>Texture CLUT feature </description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RLEUNIT</name>
                            <description>RLE unit feature </description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEXCLU</name>
                            <description>Texture CLUT with 16 or 256 entries feature </description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PERFCOUNT</name>
                            <description>Two performance counter feature</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TXCACHE</name>
                            <description>Texture cache feature</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FBCACHE</name>
                            <description>Framebuffer cache feature</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLR</name>
                            <description>Display list reader feature</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>REV</name>
                            <description>Revision number</description>
                            <lsb>0</lsb>
                            <msb>11</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COLOR1</name>
                    <description>Base Color Register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>COLOR1A</name>
                            <description>Alpha channel of color 1(0x00: transparent. . .  0xFF: opaque)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>COLOR1R</name>
                            <description>Red channel of color 1</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>COLOR1G</name>
                            <description>Green channel of color 1</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>COLOR1B</name>
                            <description>Blue channel of color 1</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COLOR2</name>
                    <description>Secondary Color Register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>COLOR2A</name>
                            <description>Alpha channel of color 2(0x00: transparent. . .   0xFF: opaque)</description>
                            <lsb>24</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>COLOR2R</name>
                            <description>Red channel of color 2</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>COLOR2G</name>
                            <description>Green channel of color 2</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>COLOR2B</name>
                            <description>Blue channel of color 2</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PATTERN</name>
                    <description>Pattern Register</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PATTERN</name>
                            <description>Bitmap of the pattern</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-6</dimIndex>
                    <name>L%sSTART</name>
                    <description>Limiter %s Start Value Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LSTART</name>
                            <description>Start value of the n'th limiter(n=1-6)</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-6</dimIndex>
                    <name>L%sXADD</name>
                    <description>Limiter %s X,Axis Increment Register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LXADD</name>
                            <description>X,axis increment</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-6</dimIndex>
                    <name>L%sYADD</name>
                    <description>Limiter %s Y,Axis Increment Register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LYADD</name>
                            <description>Y,axis increment</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>L%sBAND</name>
                    <description>Limiter %s Band Width Parameter Register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LBAND</name>
                            <description>Limiter m band width parameter</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TEXORIGIN</name>
                    <description>Texture Base Address Register </description>
                    <addressOffset>0xBC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TEXORIGIN</name>
                            <description>Texture base address</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TEXPITCH</name>
                    <description>Texels Per Texture Line Register</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TEXPITCH</name>
                            <description>Texels per texture linevalid range: 0 to 2048</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TEXMASK</name>
                    <description>Texture Size or Texture Address Mask Register</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TEXVMASK</name>
                            <description>V maskSet TEXVMASK[20:0] = TEXPITCH * (texture_height - 1).In texture wrapping mode (CONTROL2.TEXTURECLAMPY = 0): texture_height must be a power of 2In texture clamping mode (CONTROL2.TEXTURECLAMPY = 1):all heights up to 1024 are allowed.</description>
                            <lsb>11</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TEXUMASK</name>
                            <description>U maskSet TEXUMASK[10:0] = texture_width -1In texture wrapping mode (CONTROL2.TEXTURECLAMPX = 0): texture_width must be a power of 2.In texture clamping mode (CONTROL2.TEXTURECLAMPX = 1):all widths up to 2048 are allowed.</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LUSTART</name>
                    <description>U Limiter Start Value Register </description>
                    <addressOffset>0x90</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LUSTART</name>
                            <description>U limiter start value</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LUXADD</name>
                    <description>U Limiter X,Axis Increment Register</description>
                    <addressOffset>0x94</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LUXADD</name>
                            <description>U limiter x,axis increment</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LUYADD</name>
                    <description>U Limiter Y,Axis Increment Register</description>
                    <addressOffset>0x98</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LUYADD</name>
                            <description>U limiter y,axis increment</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
