amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>LVSTARTI</name>
                    <description>V Limiter Start Value Integer Part Register</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LVSTARTI</name>
                            <description>V limiter start value integer part</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVSTARTF</name>
                    <description>V Limiter Start Value Fractional Part Register</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LVSTARTF</name>
                            <description>V limiter start value fractional part</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVXADDI</name>
                    <description>V Limiter X,Axis Increment Integer Part Register</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LVXADDI</name>
                            <description>V limiter x,axis increment integer part</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVYADDI</name>
                    <description>V Limiter Y,Axis Increment Integer Part Register</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LVYADDI</name>
                            <description>V limiter y,axis increment integer part</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVYXADDF</name>
                    <description>V Limiter Increment Fractional Parts Register</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LVYADDF</name>
                            <description>V y limiter increment fractional part</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>LVXADDF</name>
                            <description>V xlimiter increment fractional part</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TEXCLADDR</name>
                    <description>CLUT Start Address Register</description>
                    <addressOffset>0xDC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CLADDR</name>
                            <description>Texture CLUT start address for indexed texture format</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TEXCLDATA</name>
                    <description>CLUT Data Register</description>
                    <addressOffset>0xE0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CLDATA</name>
                            <description>Texture CLUT data for Indexed texture format</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TEXCLOFFSET</name>
                    <description>CLUT Offset Register</description>
                    <addressOffset>0xE4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CLOFFSET</name>
                            <description>Texture CLUT offset for Indexed texture format. CLOFFSET[7:0] is or'ed with the original index</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COLKEY</name>
                    <description>Color Key Register</description>
                    <addressOffset>0xE8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>COLKEYR</name>
                            <description>Red channel of color key</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>COLKEYG</name>
                            <description>Green channel of color key</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>COLKEYB</name>
                            <description>Blue channel of color key</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SIZE</name>
                    <description>Bounding Box Dimension Register</description>
                    <addressOffset>0x78</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SIZEY</name>
                            <description>Height of the bounding box in pixelsvalid range: 0 to 1024</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SIZEX</name>
                            <description> Width of the bounding box in pixelsvalid range: 0 to 1024</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PITCH</name>
                    <description>Framebuffer Pitch And Spanstore Delay Register</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SSD</name>
                            <description>Spanstore delay</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PITCH</name>
                            <description>pitch of the framebuffer. A negative width can be used to render bottom,up instead of top,down</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ORIGIN</name>
                    <description>Framebuffer Base Address Register</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ORIGIN</name>
                            <description>Address of the first pixel in framebuffer</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DLISTSTART</name>
                    <description>Display List Start Address Register</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DLISTSTART</name>
                            <description>Display list start address</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERFTRIGGER</name>
                    <description>Performance Counters Control Register</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PERFTRIGGER2</name>
                            <description>Selects the internal event that will increment PERFCOUNT2 register</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PERFTRIGGER1</name>
                            <description>Selects the internal event that will increment PERFCOUNT1 register.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>PERFCOUNT%s</name>
                    <description>Performance Counter %s</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PERFCOUNT</name>
                            <description>Counter value.The counter is reset by writing PERFCOUNT = 0000 0000H.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
