amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>INTSTS1</name>
                    <description>Interrupt Status Register 1</description>
                    <addressOffset>0x042</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xDB71</resetMask>
                    <fields>
                        <field>
                            <name>OVRCR</name>
                            <description>Overcurrent Interrupt Status</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BCHG</name>
                            <description>USB Bus Change Interrupt Status</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DTCH</name>
                            <description>USB Disconnection Detection Interrupt Status</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ATTCH</name>
                            <description>USB Connection Detection Interrupt Status</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>L1RSMEND</name>
                            <description>L1 Resume End Interrupt Status</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LPMEND</name>
                            <description>LPM Transaction End Interrupt Status</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EOFERR</name>
                            <description>EOF Error Detection Interrupt Status</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SIGN</name>
                            <description>Setup Transaction Error Interrupt Status</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SACK</name>
                            <description>Setup Transaction Normal Response Interrupt Status</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PDDETINT</name>
                            <description>PDDET Detection Interrupt Status</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BRDYSTS</name>
                    <description>BRDY Interrupt Status Register</description>
                    <addressOffset>0x046</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PIPEBRDY</name>
                            <description>BRDY Interrupt Status for Each Pipe</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NRDYSTS</name>
                    <description>NRDY Interrupt Status Register</description>
                    <addressOffset>0x048</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PIPENRDY</name>
                            <description>NRDY Interrupt Status for Each Pipe</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BEMPSTS</name>
                    <description>BEMP Interrupt Status Register</description>
                    <addressOffset>0x04A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PIPEBEMP</name>
                            <description>BEMP Interrupt Status for Each Pipe</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRMNUM</name>
                    <description>Frame Number Register</description>
                    <addressOffset>0x04C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xC7FF</resetMask>
                    <fields>
                        <field>
                            <name>OVRN</name>
                            <description>Overrun/Underrun Detection Status</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CRCE</name>
                            <description>CRC Error Detection Status</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FRNM</name>
                            <description>Frame Number.Indicate the latest frame number.</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UFRMNUM</name>
                    <description>uFrame Number Register </description>
                    <addressOffset>0x04E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x8007</resetMask>
                    <fields>
                        <field>
                            <name>DVCHG</name>
                            <description>Device State Change</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>UFRNM</name>
                            <description>MicroframeIndicate the microframe number.</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USBADDR</name>
                    <description>USB Address Register</description>
                    <addressOffset>0x050</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x077F</resetMask>
                    <fields>
                        <field>
                            <name>STSRECOV0</name>
                            <description>Status Recovery</description>
                            <lsb>8</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USBADDR</name>
                            <description>USB Address In device controller mode, these flags indicate the USB address assigned by the host when the USBHS processed the SET_ADDRESS request successfully.</description>
                            <lsb>0</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USBREQ</name>
                    <description>USB Request Type Register</description>
                    <addressOffset>0x054</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BREQUEST</name>
                            <description>USB request bRequest value     Finction controller selected : read,only     Host controller selected : read,write</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BMREQUESTTYPE</name>
                            <description>USB request bmRequestType value     Finction controller selected : read,only     Host controller selected : read,write</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USBVAL</name>
                    <description>USB Request Value Register</description>
                    <addressOffset>0x056</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WVALUE</name>
                            <description>Value of USB request wValue     Finction controller selected : read,only     Host controller selected : read,write</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USBINDX</name>
                    <description>USB Request Index Register</description>
                    <addressOffset>0x058</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WINDEX</name>
                            <description>Value of USB request wIndex     Finction controller selected : read,only     Host controller selected : read,write</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USBLENG</name>
                    <description>USB Request Length Register </description>
                    <addressOffset>0x05A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WLENGTH</name>
                            <description>Value of USB request wLength     Finction controller selected : read,only     Host controller selected : read,write</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCPCFG</name>
                    <description>DCP Configuration Register</description>
                    <addressOffset>0x05C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0190</resetMask>
                    <fields>
                        <field>
                            <name>CNTMD</name>
                            <description>Continuous Transfer Mode</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SHTNAK</name>
                            <description>Pipe Blocking on End of Transfer</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIR</name>
                            <description>Transfer Direction</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCPMAXP</name>
                    <description>DCP Maximum Packet Size Register </description>
                    <addressOffset>0x05E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0040</resetValue>
                    <resetMask>0xF07F</resetMask>
                    <fields>
                        <field>
                            <name>DEVSEL</name>
                            <description>Device SelectThese bits specify the address of the destination function device for control transfer when the host controller function is selected.</description>
                            <lsb>12</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MXPS</name>
                            <description>Maximum Packet SizeThese bits specify the maximum data payload (maximum packet size) for the DCP.</description>
                            <lsb>0</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
