amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>DPUSR1R</name>
                    <description>Deep Standby USB Suspend/Resume Interrupt Register</description>
                    <addressOffset>0x164</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DVBSTSH</name>
                            <description>Indication of Return from VBUS Interrupt Source</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOVCBH</name>
                            <description>Indication of Return from OVRCURB Interrupt Source</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOVCAH</name>
                            <description>Indication of Return from OVRCURA Interrupt Source</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DVBSTSHE</name>
                            <description>VBUS Interrupt Enable/Clear</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOVCBHE</name>
                            <description>OVRCURB Interrupt Enable Clear</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOVCAHE</name>
                            <description>OVRCURA Interrupt Enable Clear</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPUSR2R</name>
                    <description>Deep Standby USB Suspend/Resume Interrupt Register</description>
                    <addressOffset>0x168</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DMINTE</name>
                            <description>DM Interrupt Enable Clear</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DPINTE</name>
                            <description>DP Interrupt Enable Clear</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DMVAL</name>
                            <description>DM InputIndicates DM input signal on the HS side of USB port.</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DPVAL</name>
                            <description>DP InputIndicates DP input signal on the HS side of USB port.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DMINT</name>
                            <description>Indication of Return from DM Interrupt Source</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DPINT</name>
                            <description>Indication of Return from DP Interrupt Source</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPUSRCR</name>
                    <description>Deep Standby USB Suspend/Resume Command Register</description>
                    <addressOffset>0x16A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FIXPHYPD</name>
                            <description>USB Transceiver Control Fix for PLL</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FIXPHY</name>
                            <description>USB Transceiver Control Fix</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
