amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SCI0</name>
            <description>Serial Communication Interface 0</description>
            <baseAddress>0x40070000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x00</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x02</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0E</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0E</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>6</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x16</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1A</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>SMR</name>
                    <description>Serial Mode Register (SCMR.SMIF = 0)</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CM</name>
                            <description>Communications Mode</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CHR</name>
                            <description>Character Length(Valid only in asynchronous mode)</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PE</name>
                            <description>Parity Enable(Valid only in asynchronous mode)</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PM</name>
                            <description>Parity Mode (Valid only when the PE bit is 1)</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>STOP</name>
                            <description>Stop Bit Length(Valid only in asynchronous mode)</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MP</name>
                            <description>Multi,Processor Mode(Valid only in asynchronous mode)</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CKS</name>
                            <description>Clock Select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMR_SMCI</name>
                    <description>Serial mode register (SCMR.SMIF = 1)</description>
                    <alternateRegister>SMR</alternateRegister>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>GM</name>
                            <description>GSM Mode</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BLK</name>
                            <description>Block Transfer Mode</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PE</name>
                            <description>Parity Enable(Valid only in asynchronous mode)</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PM</name>
                            <description>Parity Mode (Valid only when the PE bit is 1)</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BCP</name>
                            <description>Stop Bit Length(Valid only in asynchronous mode)</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CKS</name>
                            <description>Clock Select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BRR</name>
                    <description>Bit Rate Register</description>
                    <addressOffset>0x01</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>BRR</name>
                            <description>BRR is an 8-bit register that adjusts the bit rate.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCR</name>
                    <description>Serial Control Register (SCMR.SMIF = 0)</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TIE</name>
                            <description>Transmit Interrupt Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RIE</name>
                            <description>Receive Interrupt Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TE</name>
                            <description>Transmit Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RE</name>
                            <description>Receive Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MPIE</name>
                            <description>Multi,Processor Interrupt Enable(Valid in asynchronous mode when SMR.MP = 1)</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEIE</name>
                            <description>Transmit End Interrupt Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CKE</name>
                            <description>Clock Enable</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCR_SMCI</name>
                    <description>Serial Control Register (SCMR.SMIF =1)</description>
                    <alternateRegister>SCR</alternateRegister>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TIE</name>
                            <description>Transmit Interrupt Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RIE</name>
                            <description>Receive Interrupt Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TE</name>
                            <description>Transmit Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RE</name>
                            <description>Receive Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MPIE</name>
                            <description>Multi,Processor Interrupt EnableSet this bit to 0 in smart card interface mode.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TEIE</name>
                            <description>Transmit End Interrupt EnableSet this bit to 0 in smart card interface mode.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKE</name>
                            <description>Clock Enable</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDR</name>
                    <description>Transmit Data Register</description>
                    <addressOffset>0x03</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TDR</name>
                            <description>TDR is an 8-bit register that stores transmit data.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSR</name>
                    <description>Serial Status Register(SCMR.SMIF = 0 and FCR.FM=0)</description>
                    <addressOffset>0x04</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x84</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TDRE</name>
                            <description>Transmit Data Empty Flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RDRF</name>
                            <description>Receive Data Full Flag</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ORER</name>
                            <description>Overrun Error Flag</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FER</name>
                            <description>Framing Error Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PER</name>
                            <description>Parity Error Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEND</name>
                            <description>Transmit End Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MPB</name>
                            <description>Multi,Processor Bit. Value of the multi,processor bit in the reception frame</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MPBT</name>
                            <description>Multi,Processor Bit Transfer. Sets the multi,processor bit for adding to the transmission frame</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
