amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>SSR_FIFO</name>
                    <description>Serial Status Register(SCMR.SMIF = 0 and FCR.FM=1)</description>
                    <alternateRegister>SSR</alternateRegister>
                    <addressOffset>0x04</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xFD</resetMask>
                    <fields>
                        <field>
                            <name>TDFE</name>
                            <description>Transmit FIFO data empty flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RDF</name>
                            <description>Receive FIFO data full flag</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ORER</name>
                            <description>Overrun Error Flag</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FER</name>
                            <description>Framing Error Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PER</name>
                            <description>Parity Error Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEND</name>
                            <description>Transmit End Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DR</name>
                            <description>Receive Data Ready flag(Valid only in asynchronous mode(including multi,processor) and FIFO selected)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSR_SMCI</name>
                    <description>Serial Status Register(SCMR.SMIF = 1)</description>
                    <alternateRegister>SSR</alternateRegister>
                    <addressOffset>0x04</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x84</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TDRE</name>
                            <description>Transmit Data Empty Flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RDRF</name>
                            <description>Receive Data Full Flag</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ORER</name>
                            <description>Overrun Error Flag</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ERS</name>
                            <description>Error Signal Status Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PER</name>
                            <description>Parity Error Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEND</name>
                            <description>Transmit End Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MPB</name>
                            <description>This bit should be 0 in smart card interface mode.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MPBT</name>
                            <description>This bit should be 0 in smart card interface mode.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDR</name>
                    <description>Receive Data Register</description>
                    <addressOffset>0x05</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RDR</name>
                            <description>RDR is an 8-bit register that stores receive data.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCMR</name>
                    <description>Smart Card Mode Register</description>
                    <addressOffset>0x06</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xF2</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>BCP2</name>
                            <description>Base Clock Pulse 2Selects the number of base clock cycles in combination with the SMR.BCP[1:0] bits</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CHR1</name>
                            <description>Character Length 1(Only valid in asynchronous mode)</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SDIR</name>
                            <description>Transmitted/Received Data Transfer DirectionNOTE: The setting is invalid and a fixed data length of 8 bits is used in modes other than asynchronous mode.Set this bit to 1 if operation is to be in simple I2C mode.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SINV</name>
                            <description>Transmitted/Received Data InvertSet this bit to 0 if operation is to be in simple I2C mode.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SMIF</name>
                            <description>Smart Card Interface Mode Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEMR</name>
                    <description>Serial Extended Mode Register</description>
                    <addressOffset>0x07</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RXDESEL</name>
                            <description>Asynchronous Start Bit Edge Detection Select(Valid only in asynchronous mode)</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BGDM</name>
                            <description>Baud Rate Generator Double,Speed Mode Select(Only valid the CKE[1] bit in SCR is 0 in asynchronous mode).</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NFEN</name>
                            <description>Digital Noise Filter Function Enable(The NFEN bit should be 0 without simple I2C mode and asynchronous mode.)In asynchronous mode, for RXDn input only. In simple I2C mode, for RXDn/TxDn input.</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ABCS</name>
                            <description>Asynchronous Mode Base Clock Select(Valid only in asynchronous mode)</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ABCSE</name>
                            <description>Asynchronous Mode Extended Base Clock Select1(Valid only in asynchronous mode and SCR.CKE[1]=0)</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BRME</name>
                            <description>Bit Modulation Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNFR</name>
                    <description>Noise Filter Setting Register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>NFCS</name>
                            <description>Noise Filter Clock Select</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SIMR1</name>
                    <description>I2C Mode Register 1</description>
                    <addressOffset>0x09</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>IICDL</name>
                            <description>SSDA Delay Output SelectCycles below are of the clock signal from the on,chip baud rate generator.</description>
                            <lsb>3</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IICM</name>
                            <description>Simple I2C Mode Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SIMR2</name>
                    <description>I2C Mode Register 2</description>
                    <addressOffset>0x0A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>IICACKT</name>
                            <description>ACK Transmission Data</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IICCSC</name>
                            <description>Clock Synchronization</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IICINTM</name>
                            <description>I2C Interrupt Mode Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SIMR3</name>
                    <description>I2C Mode Register 3</description>
                    <addressOffset>0x0B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>IICSCLS</name>
                            <description>SCL Output Select</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IICSDAS</name>
                            <description>SDA Output Select</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IICSTIF</name>
                            <description>Issuing of Start, Restart, or Stop Condition Completed Flag(When 0 is written to IICSTIF, it is cleared to 0.)</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IICSTPREQ</name>
                            <description>Stop Condition Generation</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IICRSTAREQ</name>
                            <description>Restart Condition Generation</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IICSTAREQ</name>
                            <description>Start Condition Generation</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
