amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>ICFER</name>
                    <description>I2C Bus Function Enable Register </description>
                    <addressOffset>0x05</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x72</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FMPE</name>
                            <description>Fast,mode Plus Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SCLE</name>
                            <description>SCL Synchronous Circuit Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NFE</name>
                            <description>Digital Noise Filter Circuit Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NACKE</name>
                            <description>NACK Reception Transfer Suspension Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SALE</name>
                            <description>Slave Arbitration,Lost Detection Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NALE</name>
                            <description>NACK Transmission Arbitration,Lost Detection Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MALE</name>
                            <description>Master Arbitration,Lost Detection Enable </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TMOE</name>
                            <description>Timeout Function Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICSER</name>
                    <description>I2C Bus Status Enable Register</description>
                    <addressOffset>0x06</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x09</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>HOAE</name>
                            <description>Host Address Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIDE</name>
                            <description>Device,ID Address Detection Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>GCAE</name>
                            <description>General Call Address Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAR2E</name>
                            <description>Slave Address Register 2 Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAR1E</name>
                            <description>Slave Address Register 1 Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SAR0E</name>
                            <description>Slave Address Register 0 Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICIER</name>
                    <description>I2C Bus Interrupt Enable Register</description>
                    <addressOffset>0x07</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TIE</name>
                            <description>Transmit Data Empty Interrupt Request Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEIE</name>
                            <description>Transmit End Interrupt Request  Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RIE</name>
                            <description>Receive Data Full Interrupt Request Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NAKIE</name>
                            <description>NACK Reception Interrupt Request Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SPIE</name>
                            <description>Stop Condition Detection Interrupt Request Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>STIE</name>
                            <description>Start Condition Detection Interrupt Request Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ALIE</name>
                            <description>Arbitration,Lost Interrupt Request Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TMOIE</name>
                            <description>Timeout Interrupt Request Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICSR1</name>
                    <description>I2C Bus Status Register 1</description>
                    <addressOffset>0x08</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>HOA</name>
                            <description>Host Address Detection Flag </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DID</name>
                            <description>Device,ID Address Detection Flag</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>GCA</name>
                            <description>General Call Address Detection Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>AAS2</name>
                            <description>Slave Address 2 Detection Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>AAS1</name>
                            <description>Slave Address 1 Detection Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>AAS0</name>
                            <description>Slave Address 0 Detection Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICSR2</name>
                    <description>I2C Bus Status Register 2</description>
                    <addressOffset>0x09</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TDRE</name>
                            <description>Transmit Data Empty Flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEND</name>
                            <description>Transmit End Flag</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RDRF</name>
                            <description>Receive Data Full Flag</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NACKF</name>
                            <description>NACK Detection Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>STOP</name>
                            <description>Stop Condition Detection Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>START</name>
                            <description>Start Condition Detection Flag </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>AL</name>
                            <description>Arbitration,Lost Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TMOF</name>
                            <description>Timeout Detection Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x2</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>SARL%s</name>
                    <description>Slave Address Register L%s</description>
                    <addressOffset>0x0A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SVA</name>
                            <description>A slave address is set.7-Bit Address = SVA[7:1] 10-Bit Address = { SVA9,SVA8,SVA[7:0] }</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x2</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>SARU%s</name>
                    <description>Slave Address Register U%s</description>
                    <addressOffset>0x0B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SVA9</name>
                            <description>10-Bit Address(bit9)</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SVA8</name>
                            <description>10-Bit Address(bit8)</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FS</name>
                            <description>7-Bit/10-Bit Address Format Selection</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICBRL</name>
                    <description>I2C Bus Bit Rate Low,Level Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>BRL</name>
                            <description>Bit Rate Low,Level Period(Low,level period of SCL clock)</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
