amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>HOCOCR</name>
                    <description>High,Speed On,Chip Oscillator Control Register</description>
                    <addressOffset>0x036</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFE</resetMask>
                    <fields>
                        <field>
                            <name>HCSTP</name>
                            <description>HOCO Stop</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MOCOCR</name>
                    <description>Middle,Speed On,Chip Oscillator Control Register</description>
                    <addressOffset>0x038</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MCSTP</name>
                            <description>MOCO Stop</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLLCR1</name>
                    <description>FLL Control Register 1</description>
                    <addressOffset>0x039</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FLLEN</name>
                            <description>FLL Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLLCR2</name>
                    <description>FLL Control Register 2</description>
                    <addressOffset>0x03A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FLLCNTL</name>
                            <description>FLL Multiplication ControlMultiplication ratio  of the FLL reference clock select</description>
                            <lsb>0</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OSCSF</name>
                    <description>Oscillation Stabilization Flag Register</description>
                    <addressOffset>0x03C</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFE</resetMask>
                    <fields>
                        <field>
                            <name>PLLSF</name>
                            <description>PLL Clock Oscillation Stabilization Flag</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MOSCSF</name>
                            <description>Main Clock Oscillation Stabilization Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HOCOSF</name>
                            <description>HOCO Clock Oscillation Stabilization FlagNOTE: The HOCOSF bit value after a reset is 1 when the OFS1.HOCOEN bit is 0. It is 0 when the OFS1.HOCOEN bit is 1.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CKOCR</name>
                    <description>Clock Out Control Register</description>
                    <addressOffset>0x03E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CKOEN</name>
                            <description>Clock out enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CKODIV</name>
                            <description>Clock out input frequency Division Select</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CKOSEL</name>
                            <description>Clock out source select</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TRCKCR</name>
                    <description>Trace Clock Control Register</description>
                    <addressOffset>0x03F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TRCKEN</name>
                            <description>Trace Clock operating Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TRCK</name>
                            <description>Trace Clock operating frequency select</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OSTDCR</name>
                    <description>Oscillation Stop Detection Control Register</description>
                    <addressOffset>0x040</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>OSTDE</name>
                            <description>Oscillation Stop Detection Function Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OSTDIE</name>
                            <description>Oscillation Stop Detection Interrupt Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OSTDSR</name>
                    <description>Oscillation Stop Detection Status Register</description>
                    <addressOffset>0x041</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>OSTDF</name>
                            <description>Oscillation Stop Detection Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EBCKOCR</name>
                    <description>External Bus Clock Output Control Register</description>
                    <addressOffset>0x052</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>EBCKOEN</name>
                            <description>BCLK Pin Output Control</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SDCKOCR</name>
                    <description>SDRAM Clock Output Control Register</description>
                    <addressOffset>0x053</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SDCKOEN</name>
                            <description>SDCLK Pin Output Control</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MOCOUTCR</name>
                    <description>MOCO User Trimming Control Register</description>
                    <addressOffset>0x061</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MOCOUTRM</name>
                            <description>MOCO User Trimming  1000_0000 : -128   1000_0001 : -127   1000_0010 : -126   . . .  1111_1111 : -1  0000_0000 : Center Code  0000_0001 : +1  . . .  0111_1101 : +125  0111_1110 : +126  0111_1111 : +127These bits are added to original MOCO trimming bits</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOCOUTCR</name>
                    <description>HOCO User Trimming Control Register</description>
                    <addressOffset>0x062</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>HOCOUTRM</name>
                            <description>HOCO User Trimming  1000_0000 : -128   1000_0001 : -127   1000_0010 : -126   . . .  1111_1111 : -1  0000_0000 : Center Code  0000_0001 : +1  . . .  0111_1101 : +125  0111_1110 : +126  0111_1111 : +127These bits are added to original HOCO trimming bits</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MOMCR</name>
                    <description>Main Clock Oscillator Mode Oscillation Control Register</description>
                    <addressOffset>0x413</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>AUTODRVEN</name>
                            <description>Main Clock Oscillator Drive Capability Auto Switching Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MOSEL</name>
                            <description>Main Clock Oscillator Switching</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MODRV0</name>
                            <description>Main Clock Oscillator Drive Capability 0 Switching</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SOSCCR</name>
                    <description>Sub,clock oscillator control register</description>
                    <addressOffset>0x480</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SOSTP</name>
                            <description>Sub,Clock Oscillator Stop</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SOMCR</name>
                    <description>Sub Clock Oscillator Mode Control Register</description>
                    <addressOffset>0x481</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFD</resetMask>
                    <fields>
                        <field>
                            <name>SODRV1</name>
                            <description>Sub Clock Oscillator Drive Capability Switching</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LOCOCR</name>
                    <description>Low,Speed On,Chip Oscillator Control Register</description>
                    <addressOffset>0x490</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LCSTP</name>
                            <description>LOCO Stop</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LOCOUTCR</name>
                    <description>LOCO User Trimming Control Register</description>
                    <addressOffset>0x492</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LOCOUTRM</name>
                            <description>LOCO User Trimming  1000_0000 : -128   1000_0001 : -127   1000_0010 : -126   . . .  1111_1111 : -1  0000_0000 : Center Code  0000_0001 : +1  . . .  0111_1101 : +125  0111_1110 : +126  0111_1111 : +127These bits are added to original LOCO trimming bits</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MOSCWTCR</name>
                    <description>Main Clock Oscillator Wait Control Register</description>
                    <addressOffset>0x0A2</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x05</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MSTS</name>
                            <description>Main clock oscillator wait time setting</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HOCOWTCR</name>
                    <description>High,speed on,chip oscillator wait control register</description>
                    <addressOffset>0x0A5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x02</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>HSTS</name>
                            <description>HOCO wait time settingWaiting time (sec) = setting of the HSTS[2:0] bits/fLOCO(Trimmed) + 3/fLOC(Untrimmed) </description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SBYCR</name>
                    <description>Standby Control Register</description>
                    <addressOffset>0x00C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x4000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SSBY</name>
                            <description>Software Standby</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OPE</name>
                            <description>Output Port Enable</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
