amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>MSTPCRA</name>
                    <description>Module Stop Control Register A</description>
                    <addressOffset>0x01C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFBFFF1C</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MSTPA22</name>
                            <description>DMA Controller/Data Transfer Controller Module Stop</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPA7</name>
                            <description>Standny RAM Module Stop</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPA6</name>
                            <description>ECCRAM Module Stop</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPA5</name>
                            <description>High,Speed RAM Module Stop</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPA1</name>
                            <description>RAM1 Module Stop</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPA0</name>
                            <description>RAM0 Module Stop</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNZCR</name>
                    <description>Snooze Control Register</description>
                    <addressOffset>0x092</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SNZE</name>
                            <description>Snooze Mode Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZDTCEN</name>
                            <description>DTC Enable in Snooze Mode</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RXDREQEN</name>
                            <description>RXD0 Snooze Request Enable NOTE: Do not set to 1 other than in asynchronous mode.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNZEDCR</name>
                    <description>Snooze End Control Register</description>
                    <addressOffset>0x094</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SCI0UMTED</name>
                            <description>SCI0 address unmatch Snooze End EnableNote: Do not set to 1 other than in asynchronous mode.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>AD1UMTED</name>
                            <description>AD compare mismatch 1 Snooze End Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>AD1MATED</name>
                            <description>AD compare match 1 Snooze End Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>AD0UMTED</name>
                            <description>AD compare mismatch 0 Snooze End Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>AD0MATED</name>
                            <description>AD compare match 0 Snooze End Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DTCNZRED</name>
                            <description>Not Last DTC transmission completion Snooze End Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DTCZRED</name>
                            <description>Last DTC transmission completion Snooze End Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>AGT1UNFED</name>
                            <description>AGT1 underflow Snooze End Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNZREQCR</name>
                    <description>Snooze Request Control Register</description>
                    <addressOffset>0x098</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SNZREQEN30</name>
                            <description>Snooze Request Enable 30Enable AGT1 compare match B snooze request</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN29</name>
                            <description>Snooze Request Enable 29Enable AGT1 compare match A snooze request</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN28</name>
                            <description>Snooze Request Enable 28Enable AGT1 underflow snooze request</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN25</name>
                            <description>Snooze Request Enable 25Enable RTC period snooze request</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN24</name>
                            <description>Snooze Request Enable 24Enable RTC alarm snooze request</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN22</name>
                            <description>Snooze Request Enable 22Enable Comparator,OC0 snooze request</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN17</name>
                            <description>Snooze Request Enable 17Enable KR snooze request</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN15</name>
                            <description>Snooze Request Enable 15Enable IRQ15 pin snooze request</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN14</name>
                            <description>Snooze Request Enable 14Enable IRQ14 pin snooze request</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN13</name>
                            <description>Snooze Request Enable 13Enable IRQ13 pin snooze request</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN12</name>
                            <description>Snooze Request Enable 12Enable IRQ12 pin snooze request</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN11</name>
                            <description>Snooze Request Enable 11Enable IRQ11 pin snooze request</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN10</name>
                            <description>Snooze Request Enable 10Enable IRQ10 pin snooze request</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN9</name>
                            <description>Snooze Request Enable 9Enable IRQ9 pin snooze request</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN8</name>
                            <description>Snooze Request Enable 8Enable IRQ8 pin snooze request</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN7</name>
                            <description>Snooze Request Enable 7Enable IRQ7 pin snooze request</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN6</name>
                            <description>Snooze Request Enable 6Enable IRQ6 pin snooze request</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN5</name>
                            <description>Snooze Request Enable 5Enable IRQ5 pin snooze request</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN4</name>
                            <description>Snooze Request Enable 4Enable IRQ4 pin snooze request</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN3</name>
                            <description>Snooze Request Enable 3Enable IRQ3 pin snooze request</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN2</name>
                            <description>Snooze Request Enable 2Enable IRQ2 pin snooze request</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN1</name>
                            <description>Snooze Request Enable 1Enable IRQ1 pin snooze request</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SNZREQEN0</name>
                            <description>Snooze Request Enable 0Enable IRQ0 pin snooze request</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OPCCR</name>
                    <description>Operating Power Control Register</description>
                    <addressOffset>0x0A0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>OPCMTSF</name>
                            <description>Operating Power Control Mode Transition Status Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OPCM</name>
                            <description>Operating Power Control Mode Select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SOPCCR</name>
                    <description>Sub Operating Power Control Register</description>
                    <addressOffset>0x0AA</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SOPCMTSF</name>
                            <description>Sub Operating Power Control Mode Transition Status Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SOPCM</name>
                            <description>Sub Operating Power Control Mode Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
