amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>DPSIFR2</name>
                    <description>Deep Standby Interrupt Flag Register 2</description>
                    <addressOffset>0x408</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DNMIF</name>
                            <description>NMI Pin Deep Standby Cancel Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DRTCAIF</name>
                            <description>RTC Alarm interrupt Deep Standby Cancel Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DTRTCIIF</name>
                            <description>RTC Interval interrupt Deep Standby Cancel Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLVD2IF</name>
                            <description>LVD2 Deep Standby Cancel Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLVD1IF</name>
                            <description>LVD1 Deep Standby Cancel Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPSIFR3</name>
                    <description>Deep Standby Interrupt Flag Register 3</description>
                    <addressOffset>0x409</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DAGT1IF</name>
                            <description>AGT1 Underflow Deep Standby Cancel Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DUSBHSIF</name>
                            <description>USBHS Suspend/Resume Deep Standby Cancel Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DUSBFSIF</name>
                            <description>USBFS Suspend/Resume Deep Standby Cancel Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPSIEGR0</name>
                    <description>Deep Standby Interrupt Edge Register 0</description>
                    <addressOffset>0x40A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DIRQ7EG</name>
                            <description>IRQ7-DS Pin Edge Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIRQ6EG</name>
                            <description>IRQ6-DS Pin Edge Select</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIRQ5EG</name>
                            <description>IRQ5-DS Pin Edge Select</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIRQ4EG</name>
                            <description>IRQ4-DS Pin Edge Select</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIRQ3EG</name>
                            <description>IRQ3-DS Pin Edge Select</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIRQ2EG</name>
                            <description>IRQ2-DS Pin Edge Select</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIRQ1EG</name>
                            <description>IRQ1-DS Pin Edge Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIRQ0EG</name>
                            <description>IRQ0-DS Pin Edge Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPSIEGR1</name>
                    <description>Deep Standby Interrupt Edge Register 1</description>
                    <addressOffset>0x40B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DIRQ14EG</name>
                            <description>IRQ14-DS Pin Edge Select</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIRQ13EG</name>
                            <description>IRQ13-DS Pin Edge Select</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIRQ12EG</name>
                            <description>IRQ12-DS Pin Edge Select</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIRQ11EG</name>
                            <description>IRQ11-DS Pin Edge Select</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIRQ10EG</name>
                            <description>IRQ10-DS Pin Edge Select</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIRQ9EG</name>
                            <description>IRQ9-DS Pin Edge Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIRQ8EG</name>
                            <description>IRQ8-DS Pin Edge Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPSIEGR2</name>
                    <description>Deep Standby Interrupt Edge Register 2</description>
                    <addressOffset>0x40C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DNMIEG</name>
                            <description>NMI Pin Edge Select</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLVD2IEG</name>
                            <description>LVD2 Edge Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLVD1IEG</name>
                            <description>LVD1 Edge Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYOCDCR</name>
                    <description>System Control OCD Control Register</description>
                    <addressOffset>0x40E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFE</resetMask>
                    <fields>
                        <field>
                            <name>DBGEN</name>
                            <description>Debugger Enable bit</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOCDF</name>
                            <description>Deep Standby OCD flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STCONR</name>
                    <description>Standby Condition Register</description>
                    <addressOffset>0x40F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xC3</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>STCON</name>
                            <description>SSTBY condition bit</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x2</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>LVD%sCR1</name>
                    <description>Voltage Monitor %s Circuit Control Register 1</description>
                    <addressOffset>0x0E0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>IRQSEL</name>
                            <description>Voltage Monitor Interrupt Type Select</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IDTSEL</name>
                            <description>Voltage Monitor Interrupt Generation Condition Select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x2</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>LVD%sSR</name>
                    <description>Voltage Monitor %s Circuit Status Register</description>
                    <addressOffset>0x0E1</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x02</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MON</name>
                            <description>Voltage Monitor 1 Signal Monitor Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DET</name>
                            <description>Voltage Monitor Voltage Change Detection Flag NOTE: Only 0 can be written to this bit. After writing 0 to this bit, it takes 2 system clock cycles for the bit to be read as 0.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVCMPCR</name>
                    <description>Voltage Monitor Circuit Control Register</description>
                    <addressOffset>0x417</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LVD2E</name>
                            <description>Voltage Detection 2 Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD1E</name>
                            <description>Voltage Detection 1 Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVDLVLR</name>
                    <description>Voltage Detection Level Select Register</description>
                    <addressOffset>0x418</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xF3</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LVD2LVL</name>
                            <description>Voltage Detection 2 Level Select (Standard voltage during fall in voltage)</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD1LVL</name>
                            <description>Voltage Detection 1 Level Select (Standard voltage during fall in voltage)</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
