amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>RBWAR</name>
                    <description>Receive Buffer Write Address Register</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RBWAR</name>
                            <description>Receive Buffer Write Address RegisterThe RBWAR register indicates the last address that the EDMAC has written data to when writing to the receive buffer.Refer to the address indicated by the RBWAR register to recognize which address in the receive buffer the EDMAC is writing data to. Note that the address that the EDMAC is outputting to the receive buffer may not match the read value of the RBWAR register during data reception.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDFAR</name>
                    <description>Receive Descriptor Fetch Address Register</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RDFAR</name>
                            <description>Receive Descriptor Fetch Address RegisterThe RDFAR register indicates the start address of the last fetched receive descriptor when the EDMAC fetches descriptor information from the receive descriptor.Refer to the address indicated by the RDFAR register to recognize which receive descriptor information the EDMAC is using for the current processing. Note that the address of the receive descriptor that the EDMAC fetches may not match the read value of the RDFAR register during data reception.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TBRAR</name>
                    <description>Transmit Buffer Read Address Register</description>
                    <addressOffset>0x0D4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TBRAR</name>
                            <description>Transmit Buffer Read Address RegisterThe TBRAR register indicates the last address that the EDMAC has read data from when reading data from the transmit buffer.Refer to the address indicated by the TBRAR register to recognize which address in the transmit buffer the EDMAC is reading from. Note that the address that the EDMAC is outputting to the transmit buffer may not match the read value of the TBRAR register.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDFAR</name>
                    <description>Transmit Descriptor Fetch Address Register</description>
                    <addressOffset>0xD8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TDFAR</name>
                            <description>Transmit Descriptor Fetch Address RegisterThe TDFAR register indicates the start address of the last fetched transmit descriptor when the EDMAC fetches descriptor information from the transmit descriptor.Refer to the address indicated by the TDFAR register to recognize which transmit descriptor information the EDMAC is using for the current processing. Note that the address of the transmit descriptor that the EDMAC fetches may not match the read value of the TDFAR register.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>ETHERC0</name>
            <description>Ethernet Controller Channel 0</description>
            <baseAddress>0x40064100</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x28</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x50</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x60</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC0</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC8</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xD0</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xE4</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>ECMR</name>
                    <description>ETHERC Mode Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TPC</name>
                            <description>PAUSE Frame Transmit</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ZPF</name>
                            <description>0 Time PAUSE Frame Enable</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PFR</name>
                            <description>PAUSE Frame Receive Mode</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RXF</name>
                            <description>Receive Flow Control Operating Mode</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TXF</name>
                            <description>Transmit Flow Control Operating Mode</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PRCEF</name>
                            <description>CRC Error Frame Receive Mode</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MPDE</name>
                            <description>Magic Packet Detection Enable</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RE</name>
                            <description>Reception Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TE</name>
                            <description>Transmission Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ILB</name>
                            <description>Internal Loopback Mode</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RTM</name>
                            <description>Bit Rate</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DM</name>
                            <description>Duplex Mode</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PRM</name>
                            <description>Promiscuous Mode</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFLR</name>
                    <description>Receive Frame Maximum Length Register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RFL</name>
                            <description>Receive Frame Maximum LengthThe set value becomes the maximum frame length. The minimum value that can be set is 1,518 bytes, and the maximum value that can be set is 2,048 bytes. Values that are less than 1,518 bytes are regarded as 1,518 bytes, and values larger than 2,048 bytes are regarded as 2,048 bytes.</description>
                            <lsb>0</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECSR</name>
                    <description>ETHERC Status Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BFR</name>
                            <description>Continuous Broadcast Frame Reception Flag</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PSRTO</name>
                            <description>PAUSE Frame Retransmit Over Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LCHNG</name>
                            <description>LCHNG Link Signal Change Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MPD</name>
                            <description>Magic Packet Detect Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ICD</name>
                            <description>False Carrier Detect Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECSIPR</name>
                    <description>ETHERC Interrupt Enable Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BFSIPR</name>
                            <description>Continuous Broadcast Frame Reception Interrupt Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PSRTOIP</name>
                            <description>PAUSE Frame Retransmit Over Interrupt Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LCHNGIP</name>
                            <description>LINK Signal Change Interrupt Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MPDIP</name>
                            <description>Magic Packet Detect Interrupt Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ICDIP</name>
                            <description>False Carrier Detect Interrupt Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PIR</name>
                    <description>PHY Interface Register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFF7</resetMask>
                    <fields>
                        <field>
                            <name>MDI</name>
                            <description>MII/RMII Management Data,InThis bit indicates the level of the ETn_MDIO pin. The write value should be 0.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MDO</name>
                            <description>MII/RMII Management Data,OutThe MDO bit value is output from the ETn_MDIO pin when the MMD bit is 1 (write). The value is not output when the MMD bit is 0 (read).</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMD</name>
                            <description>MII/RMII Management Mode</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MDC</name>
                            <description>MII/RMII Management Data ClockThe MDC bit value is output from the ETn_MDC pin to supply the management data clock to the MII or RMII.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSR</name>
                    <description>PHY Status Register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFE</resetMask>
                    <fields>
                        <field>
                            <name>LMON</name>
                            <description>ETn_LINKSTA Pin Status FlagThe link status can be read by connecting the link signal output from the PHY,LSI to the ETn_LINKSTA pin. For details on the polarity, refer to the specifications of the connected PHY,LSI.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
