amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>PTPEDMAC</name>
            <description>DMA Controller for EPTPC</description>
            <baseAddress>0x40064400</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x28</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x30</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x38</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x48</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x50</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x58</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x64</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x78</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC8</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xD4</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>EDMR</name>
                    <description>PTPEDMAC Mode Register</description>
                    <addressOffset>0x000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DE</name>
                            <description>Big Endian Mode/Little Endian ModeNOTE: This setting applies to data for the transmit/receive buffer. It does not apply to transmit/receive descriptors and registers.</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DL</name>
                            <description>Transmit/Receive DescriptorLength</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SWR</name>
                            <description>Software Reset (The read value is 0.)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EDTRR</name>
                    <description>EDMAC Transmit Request Register</description>
                    <addressOffset>0x008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TR</name>
                            <description>Transmit Request (The read value is 0.)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EDRRR</name>
                    <description>EDMAC Receive Request Register</description>
                    <addressOffset>0x010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RR</name>
                            <description>Receive Request</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDLAR</name>
                    <description>Transmit Descriptor List Start Address Register</description>
                    <addressOffset>0x018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TDLAR</name>
                            <description>The start address of the transmit descriptor list is set. Set the start address according to the descriptor length selected by the EDMR.DL[1:0] bits.16-byte boundary: Lower 4 bits = 0000b32-byte boundary: Lower 5 bits = 00000b64-byte boundary: Lower 6 bits = 000000b</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDLAR</name>
                    <description>Receive Descriptor List Start Address Register</description>
                    <addressOffset>0x020</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RDLAR</name>
                            <description>The start address of the receive descriptor list is set. Set the start address according to the descriptor length selected by the EDMR.DL[1:0] bits.16-byte boundary: Lower 4 bits = 0000b32-byte boundary: Lower 5 bits = 00000b64-byte boundary: Lower 6 bits = 000000b</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EESR</name>
                    <description>PTP/EDMAC Status Register</description>
                    <addressOffset>0x028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TWB</name>
                            <description>Write,Back Complete Flag</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TABT</name>
                            <description>Transmit Abort Detect Flag</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RFCOF</name>
                            <description>Receive Frame Counter Overflow Flag</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADE</name>
                            <description>Address Error Flag</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TC</name>
                            <description>Frame Transfer Complete Flag</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TDE</name>
                            <description>Transmit Descriptor Empty Flag</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TFUF</name>
                            <description>Transmit FIFO Underflow Flag</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FR</name>
                            <description>Frame Receive Flag</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RDE</name>
                            <description>Receive Descriptor Empty Flag</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RFOF</name>
                            <description>Receive FIFO Overflow Flag</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MACE</name>
                            <description>MAC Address Mismatch Flag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PVER</name>
                            <description>PTP v2 Packet Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TYPE</name>
                            <description>PTP v2 Message Type Flag</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EESIPR</name>
                    <description>PTP/EDMAC Status Interrupt Enable Register</description>
                    <addressOffset>0x030</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TWBIP</name>
                            <description>Write,Back Complete Interrupt Request Enable</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TABTIP</name>
                            <description>Transmit Abort Detect Interrupt Request Enable</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RFCOFIP</name>
                            <description>Receive Frame Counter Overflow Interrupt Request Enable</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADEIP</name>
                            <description>Address Error Interrupt Request Enable</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TCIP</name>
                            <description>Frame Transfer Complete Interrupt Request Enable</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TDEIP</name>
                            <description>Transmit Descriptor Empty Interrupt Request Enable</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TFUFIP</name>
                            <description>Transmit FIFO Underflow Interrupt Request Enable</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FRIP</name>
                            <description>Frame Receive Interrupt Request Enable</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RDEIP</name>
                            <description>Receive Descriptor Empty Interrupt Request Enable</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RFOFIP</name>
                            <description>Receive FIFO Overflow Interrupt Request Enable</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MACEIP</name>
                            <description>MAC Address Mismatch Interrupt Request Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PVERIP</name>
                            <description>PTP v2 Packet Receive Interrupt Request Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMFCR</name>
                    <description>Missed,Frame Counter Register</description>
                    <addressOffset>0x040</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MFC</name>
                            <description>Missed,Frame CounterThese bits indicate the number of frames that are discarded and not transferred to the receive buffer during reception.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>clear</modifiedWriteValues>
                        </field>
                    </fields>
                </register>
