amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>EPTPC</name>
            <description>PTP Module for the Ethernet Controller</description>
            <baseAddress>0x40065000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0C</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4C</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x60</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x80</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x90</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xB0</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x124</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x170</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x210</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2D0</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x300</offset>
                <size>96</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x304</offset>
                <size>96</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x308</offset>
                <size>96</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x30C</offset>
                <size>96</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x37C</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x400</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40C</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x414</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x420</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x430</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>MIESR</name>
                    <description>MINT Interrupt Source Status Register</description>
                    <addressOffset>0x000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CYC5</name>
                            <description>Pulse Output Timer 5 Rising Edge Detection Flag</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYC4</name>
                            <description>Pulse Output Timer 4 Rising Edge Detection Flag</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYC3</name>
                            <description>Pulse Output Timer 3 Rising Edge Detection Flag</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYC2</name>
                            <description>Pulse Output Timer 2 Rising Edge Detection Flag</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYC1</name>
                            <description>Pulse Output Timer 1 Rising Edge Detection Flag</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYC0</name>
                            <description>Pulse Output Timer 0 Rising Edge Detection Flag</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SY0</name>
                            <description>SYNFP0 Status Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ST</name>
                            <description>STCA Status Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MIEIPR</name>
                    <description>MINT Interrupt Request Permission Register</description>
                    <addressOffset>0x004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CYC5</name>
                            <description>Pulse Output Timer 5 Rising Edge Detection Interrupt Request Permission</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYC4</name>
                            <description>Pulse Output Timer 4 Rising Edge Detection Interrupt Request Permission</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYC3</name>
                            <description>Pulse Output Timer 3 Rising Edge Detection Interrupt Request Permission</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYC2</name>
                            <description>Pulse Output Timer 2 Rising Edge Detection Interrupt Request Permission</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYC1</name>
                            <description>Pulse Output Timer 1 Rising Edge Detection Interrupt Request Permission</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYC0</name>
                            <description>Pulse Output Timer 0 Rising Edge Detection Interrupt Request Permission</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SY0</name>
                            <description>SYNFP0 Status Interrupt Request Permission</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ST</name>
                            <description>STCA Status Interrupt Request Permission</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ELIPPR</name>
                    <description>ELC Output/IPLS Interrupt Request Permission Register</description>
                    <addressOffset>0x010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00003F3F</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PLSN</name>
                            <description>Pulse Output Timer Falling Edge Detection IPLS Interrupt Request Permission</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PLSP</name>
                            <description>Pulse Output Timer Rising Edge Detection IPLS Interrupt Request Permission</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYCN5</name>
                            <description>Pulse Output Timer 5 Falling Edge Detection Event Output Enable</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYCN4</name>
                            <description>Pulse Output Timer 4 Falling Edge Detection Event Output Enable</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYCN3</name>
                            <description>Pulse Output Timer 3 Falling Edge Detection Event Output Enable</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYCN2</name>
                            <description>Pulse Output Timer 2 Falling Edge Detection Event Output Enable</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYCN1</name>
                            <description>Pulse Output Timer 1 Falling Edge Detection Event Output Enable</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYCN0</name>
                            <description>Pulse Output Timer 0 Falling Edge Detection Event Output Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYCP5</name>
                            <description>Pulse Output Timer 5 Rising Edge Detection Event Output Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYCP4</name>
                            <description>Pulse Output Timer 4 Rising Edge Detection Event Output Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYCP3</name>
                            <description>Pulse Output Timer 3 Rising Edge Detection Event Output Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYCP2</name>
                            <description>Pulse Output Timer 2 Rising Edge Detection Event Output Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYCP1</name>
                            <description>Pulse Output Timer 1 Rising Edge Detection Event Output Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CYCP0</name>
                            <description>Pulse Output Timer 0 Rising Edge Detection Event  Output Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
