amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>PW10VRM</name>
                    <description>Positive Gradient Worst 10 Value Registers</description>
                    <addressOffset>0x214</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PW10VRM</name>
                            <description>These bits are for reading the middle,order 32 bits of the positive gradient value.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PW10VRL</name>
                    <description>Positive Gradient Worst 10 Value Registers</description>
                    <addressOffset>0x218</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PW10VRL</name>
                            <description>These bits are for reading the lower,order 32 bits of the positive gradient value.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MW10RU</name>
                    <description>Negative Gradient Worst 10 Value Registers</description>
                    <addressOffset>0x2D0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MW10RU</name>
                            <description>These bits are for reading the higher,order 32 bits of the negative gradient value.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MW10RM</name>
                    <description>Negative Gradient Worst 10 Value Registers</description>
                    <addressOffset>0x2D4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MW10RM</name>
                            <description>These bits are for reading the middle,order 32 bits of the negative gradient value.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MW10RL</name>
                    <description>Negative Gradient Worst 10 Value Registers</description>
                    <addressOffset>0x2D8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MW10RL</name>
                            <description>These bits are for reading the lower,order 32 bits of the negative gradient value.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-5</dimIndex>
                    <name>TMSTTRU%s</name>
                    <description>Timer Start Time Setting Register %s</description>
                    <addressOffset>0x300</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TMSTTRU</name>
                            <description>These bits hold the setting for the higher,order 32 bits of the start time of the pulse output timer in nanoseconds.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-5</dimIndex>
                    <name>TMSTTRL%s</name>
                    <description>Timer Start Time Setting Register %s</description>
                    <addressOffset>0x304</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TMSTTRL</name>
                            <description>These bits hold the setting for the lower,order 32 bits of the start time of the pulse output timer in nanoseconds.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-5</dimIndex>
                    <name>TMCYCR%s</name>
                    <description>Timer Cycle Setting Registers %s</description>
                    <addressOffset>0x308</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TMCYCR</name>
                            <description>These bits set the cycle of the pulse output timer in nanoseconds. Set a value that is equivalent to at least four cycles of the STCA clock.</description>
                            <lsb>0</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-5</dimIndex>
                    <name>TMPLSR%s</name>
                    <description>Timer Pulse Width Setting Register %s</description>
                    <addressOffset>0x30C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TMPLSR</name>
                            <description>These bits set the width at high level of the pulse signal from the timer in nanoseconds. Set a value that is equivalent to at least two cycles of the STCA clock.</description>
                            <lsb>0</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMSTARTR</name>
                    <description>Timer Start Register</description>
                    <addressOffset>0x37C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EN5</name>
                            <description>Pulse Output Timer 5 Start</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EN4</name>
                            <description>Pulse Output Timer 4 Start</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EN3</name>
                            <description>Pulse Output Timer 3 Start</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EN2</name>
                            <description>Pulse Output Timer 2 Start</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EN1</name>
                            <description>Pulse Output Timer 1 Start</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EN0</name>
                            <description>Pulse Output Timer 0 Start</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
