amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>EPTPC0</name>
            <description>PTP Module 0 for the Ethernet Controller</description>
            <baseAddress>0x40065800</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0C</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x50</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x80</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x90</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA0</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC0</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xE0</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x120</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x160</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x164</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C0</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>SYSR</name>
                    <description>SYNFP Status Register</description>
                    <addressOffset>0x000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GENDN</name>
                            <description>Generation Stop Completion Detection Flag</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RESDN</name>
                            <description>Response Stop Completion Detection Flag</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>INFABT</name>
                            <description>Control Information Abnormality Detection Flag</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RECLP</name>
                            <description>Loop Reception Detection Flag</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DRQOVR</name>
                            <description>Delay_Req Reception FIFO Overflow Detection Flag</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>INTDEV</name>
                            <description>Receive logMessageInterval Value Out,of,Range Flag</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DRPTO</name>
                            <description>Delay_Resp/Pdelay_Resp Reception Timeout Detection Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MPDUD</name>
                            <description>meanPathDelay Value Update Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>INTCHG</name>
                            <description>Receive logMessageInterval Value Change Detection Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OFMUD</name>
                            <description>offsetFromMaster Value Update Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYIPR</name>
                    <description>SYNFP Status Notification Permission Register</description>
                    <addressOffset>0x004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GENDN</name>
                            <description>SYSR.GENDN Status Notification Permission</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RESDN</name>
                            <description>SYSR.RESDN Status Notification Permission</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>INFABT</name>
                            <description>SYSR.INFABT Status Notification Permission</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RECLP</name>
                            <description>SYSR.RECLP Status Notification Permission</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DRQOVR</name>
                            <description>SYSR.DRQOVR Status Notification Permission</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>INTDEV</name>
                            <description>SYSR.INTDEV Status Notification Permission</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DRPTO</name>
                            <description>SYSR.DRPTO Status Notification Permission</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MPDUD</name>
                            <description>SYSR.MPDUD Status Notification Permission</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>INTCHG</name>
                            <description>SYSR.INTCHG Status Notification Permission</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OFMUD</name>
                            <description>SYSR.OFMUD Status Notification Permission</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYMACRU</name>
                    <description>SYNFP MAC Address Registers</description>
                    <addressOffset>0x010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SYMACRU</name>
                            <description>These bits hold the setting for the higher,order 24 bits of the local MAC address.</description>
                            <lsb>0</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYMACRL</name>
                    <description>SYNFP MAC Address Registers</description>
                    <addressOffset>0x014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SYMACRL</name>
                            <description>These bits hold the setting for the lower,order 24 bits of the local MAC address.</description>
                            <lsb>0</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYLLCCTLR</name>
                    <description>SYNFP LLC,CTL Value Register</description>
                    <addressOffset>0x018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CTL</name>
                            <description>LLC,CTL FieldThese bits specify the value used for the control field in the LLC sublayer when generating IEEE802.3 frames.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYIPADDRR</name>
                    <description>SYNFP Local IP Address Register</description>
                    <addressOffset>0x01C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SYIPADDRR</name>
                            <description>These bits hold the setting for the local IP address.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSPVRR</name>
                    <description>SYNFP Specification Version Setting Register</description>
                    <addressOffset>0x040</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TRSP</name>
                            <description>transportSpecific Field ValueThese bits are used to set the transportSpecific field value of the PTP v2 header.When a message is received, this value is compared with the transportSpecific field of the received frame.In generating messages, the value is used for the transportSpecific field of the frame for transmission.Set these bits to 0000b (IEEE 1588).</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VER</name>
                            <description>versionPTP Field ValueThese bits are used to set the versionPTP field value of the PTP v2 header.When a message is received, this value is compared with the versionPTP field of the received frame.In generating messages, the value is used for the versionPTP field of the frame for transmission.Set these bits to 0010b (PTP v2).</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYDOMR</name>
                    <description>SYNFP Domain Number Setting Register</description>
                    <addressOffset>0x044</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DNUM</name>
                            <description>domainNumber Field Value SettingThese bits are used to set the domainNumber field value of the PTP v2 header.When a message is received, this value is compared with the domainNumber field of the received frame as a condition for PTP reception processing.In generating messages, the value is used for the domainNumber field of the frame for transmission.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
