amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>ANFR</name>
                    <description>Announce Message Flag Field Setting Register</description>
                    <addressOffset>0x050</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FLAG14</name>
                            <description>PTP profile Specific 2</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG13</name>
                            <description>PTP profile Specific 1</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG10</name>
                            <description>unicastFlag</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG8</name>
                            <description>alternateMasterFlag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG5</name>
                            <description>frequencyTraceableThis bit is used to set the logical value of the frequencyTraceable member of timePropertiesDS.</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG4</name>
                            <description>timeTraceableThis bit is used to set the logical value of the timeTraceable member of timePropertiesDS.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG3</name>
                            <description>ptpTimescaleThis bit is used to set the logical value of the ptpTimescale member of timePropertiesDS.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG2</name>
                            <description>currentUtcOffsetValidThis bit is used to set the logical value of the currentUtcOffsetValid member of timePropertiesDS.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG1</name>
                            <description>leap59This bit is used to set the logical value of the leap59 member of timePropertiesDS.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG0</name>
                            <description>leap61This bit is used to set the logical value of the leap61 member of timePropertiesDS.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYNFR</name>
                    <description>Sync Message Flag Field Setting Register</description>
                    <addressOffset>0x054</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FLAG14</name>
                            <description>PTP profile Specific 2</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG13</name>
                            <description>PTP profile Specific 1</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG10</name>
                            <description>unicastFlag</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG9</name>
                            <description>twoStepFlag</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG8</name>
                            <description>alternateMasterFlag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DYRQFR</name>
                    <description>Delay_Req Message Flag Field Setting Register</description>
                    <addressOffset>0x058</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FLAG14</name>
                            <description>PTP profile Specific 2</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG13</name>
                            <description>PTP profile Specific 1</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG10</name>
                            <description>unicastFlag</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DYRPFR</name>
                    <description>Delay_Resp Message Flag Field Setting Register</description>
                    <addressOffset>0x05C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FLAG14</name>
                            <description>PTP profile Specific 2</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG13</name>
                            <description>PTP profile Specific 1</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG10</name>
                            <description>unicastFlag</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG9</name>
                            <description>woStepFlag</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FLAG8</name>
                            <description>alternateMasterFlag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYCIDRU</name>
                    <description>SYNFP Local Clock ID Registers</description>
                    <addressOffset>0x060</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SYCIDRU</name>
                            <description>These bits hold the setting for the higher,order 32 bits of the clock,ID of your port.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYCIDRL</name>
                    <description>SYNFP Local Clock ID Registers</description>
                    <addressOffset>0x064</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SYCIDRL</name>
                            <description>These bits hold the setting for the lower,order 32 bits of the clock,ID of your port.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYPNUMR</name>
                    <description>SYNFP Local Port Number Register</description>
                    <addressOffset>0x068</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PNUM</name>
                            <description>Local Port Number SettingThese bits hold the setting for the port number of the local port.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYRVLDR</name>
                    <description>SYNFP Register Value Load Directive Register</description>
                    <addressOffset>0x080</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ANUP</name>
                            <description>Announce Message Generation Information Update</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>STUP</name>
                            <description>State Update</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BMUP</name>
                            <description>BMC Update</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYRFL1R</name>
                    <description>SYNFP Reception Filter Register 1</description>
                    <addressOffset>0x090</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PDFUP2</name>
                            <description>Pdelay_Resp_Follow_Up Message Processing</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PDFUP0</name>
                            <description>Pdelay_Resp_Follow_Up Message Processing</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PDRP2</name>
                            <description>Pdelay_Resp Message Processing</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PDRP0</name>
                            <description>Pdelay_Resp Message Processing</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PDRQ2</name>
                            <description>Pdelay_Req Message Processing</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PDRQ0</name>
                            <description>Pdelay_Req Message Processing</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DRP2</name>
                            <description>Delay_Resp Message Processing</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DRP0</name>
                            <description>Delay_Resp Message Processing</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DRQ2</name>
                            <description>Delay_Req Message Processing</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DRQ0</name>
                            <description>Delay_Req Message Processing</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FUP2</name>
                            <description>Follow_Up Message Processing</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FUP0</name>
                            <description>Follow_Up Message Processing</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SYNC2</name>
                            <description>Sync Message Processing</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SYNC0</name>
                            <description>Sync Message Processing</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ANCE0</name>
                            <description>Announce Message Processing</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
