amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>SYRFL2R</name>
                    <description>SYNFP Reception Filter Register 2</description>
                    <addressOffset>0x094</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ILL0</name>
                            <description>Illegal Message Processing Setting</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SIG0</name>
                            <description>Signaling Message Processing Setting</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MAN0</name>
                            <description>Management Message Processing Setting</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYTRENR</name>
                    <description>SYNFP Transmission Enable Register</description>
                    <addressOffset>0x098</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PDRQ</name>
                            <description>Pdelay_Req Message Transmission Enable</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DRQ</name>
                            <description>Delay_Req Message Transmission Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SYNC</name>
                            <description>Sync Message Transmission Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ANCE</name>
                            <description>Announce Message Transmission Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MTCIDU</name>
                    <description>Master Clock ID Registers</description>
                    <addressOffset>0x0A0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MTCIDU</name>
                            <description>These bits hold the setting for the higher,order 32 bits of the clock,ID of the master clock.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MTCIDL</name>
                    <description>Master Clock ID Registers</description>
                    <addressOffset>0x0A4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MTCIDL</name>
                            <description>These bits hold the setting for the lower,order 32 bits of the clock,ID of the master clock.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MTPID</name>
                    <description>Master clock port number register</description>
                    <addressOffset>0x0A8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PNUM</name>
                            <description>Master Clock Port Number SettingThese bits hold the setting for the port number of the master clock.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYTLIR</name>
                    <description>SYNFP Transmission Interval Setting Register</description>
                    <addressOffset>0x0C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000001</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DREQ</name>
                            <description>Delay_Req Transmission Interval Average Value/ Pdelay_Req Transmission Interval SettingThe bits set the average interval for the transmission of Delay_Req messages and the interval for the transmission of Pdelay_Req messages.The setting is also placed in the logMessageInterval field of Delay_Resp messages.</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNC</name>
                            <description>Sync Message Transmission Interval SettingThese bits set the interval for the transmission of Sync messages. The setting is also placed in the logMessageInterval field of transmitted Sync messages.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ANCE</name>
                            <description>Announce Message Transmission Interval SettingThese bits set the interval for the transmission of Announce messages.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYRLIR</name>
                    <description>SYNFP Received logMessageInterval Value Indication Register</description>
                    <addressOffset>0x0C4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DRESP</name>
                            <description>Delay_Resp Message logMessageInterval Field IndicationThese bits indicate the logMessageInterval field value of a received Delay_Resp message.</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SYNC</name>
                            <description>Sync Message logMessageInterval Field IndicationThese bits indicate the logMessageInterval field value of a received Sync message.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ANCE</name>
                            <description>Announce Message logMessageInterval Field IndicationThese bits indicate the logMessageInterval field value of a received Announce message.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OFMRU</name>
                    <description>offsetFromMaster Value Registers</description>
                    <addressOffset>0x0C8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>OFMRU</name>
                            <description>These bits indicate the higher,order 32 bits of the calculated offsetFromMaster value.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OFMRL</name>
                    <description>offsetFromMaster Value Registers</description>
                    <addressOffset>0x0CC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>OFMRL</name>
                            <description>These bits indicate the lower,order 32 bits of the calculated offsetFromMaster value.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MPDRU</name>
                    <description>meanPathDelay Value Registers</description>
                    <addressOffset>0x0D0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MPDRU</name>
                            <description>These bits indicate the higher,order 32 bits of the calculated meanPathDelay value.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MPDRL</name>
                    <description>meanPathDelay Value Registers</description>
                    <addressOffset>0x0D4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MPDRL</name>
                            <description>These bits indicate the lower,order 32 bits of the calculated meanPathDelay value.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GMPR</name>
                    <description>grandmasterPriority Field Setting Register</description>
                    <addressOffset>0x0E0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GMPR1</name>
                            <description>grandmasterPriority1 Field Value SettingThese bits are used to set the value of the grandmasterPriority1 fields of Announce messages.</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GMPR2</name>
                            <description>grandmasterPriority2 Field Value SettingThese bits are used to set the value of the grandmasterPriority2 fields of Announce messages.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GMCQR</name>
                    <description>grandmasterClockQuality Field Setting Register</description>
                    <addressOffset>0x0E4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GMCQR</name>
                            <description>These bits are used to set the value of the grandmasterClockQuality fields of Announce messages. The correspondence between bits and the grandmasterClockQuality fields is as listed below.b31 to b24: clockClassb23 to b16: clockAccuracyb15 to b0: offsetScaledLogVariance</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GMIDRU</name>
                    <description>grandmasterIdentity Field Setting Registers</description>
                    <addressOffset>0x0E8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GMIDRU</name>
                            <description>These bits hold the setting for the higher,order 32 bits of the value of the grandmasterIdentity fields of Announce messages.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GMIDRL</name>
                    <description>grandmasterIdentity Field Setting Registers</description>
                    <addressOffset>0x0EC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GMIDRL</name>
                            <description>These bits hold the setting for the lower,order 32 bits of the value of the grandmasterIdentity fields of Announce messages.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CUOTSR</name>
                    <description>currentUtcOffset/timeSource Field Setting Register</description>
                    <addressOffset>0x0F0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CUTO</name>
                            <description>currentUtcOffset Field SettingThese bits set the value of the currentUtcOffset fields of Announce messages.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSRC</name>
                            <description>timeSource Field SettingThese bits set the value of the timeSource fields of Announce messages.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRR</name>
                    <description>stepsRemoved Field Setting Register</description>
                    <addressOffset>0x0F4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SRMV</name>
                            <description>stepsRemoved Field Value SettingThese bits set the value of the stepsRemoved fields of Announce messages.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PPMACRU</name>
                    <description>PTP,primary Message Destination MAC Address Setting Registers</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00011B19</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PPMACRU</name>
                            <description>These bits hold the setting for the higher,order 24 bits of the destination MAC address for PTP,primary messages.</description>
                            <lsb>0</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PPMACRL</name>
                    <description>PTP,primary Message Destination MAC Address Setting Registers</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PPMACRL</name>
                            <description>These bits hold the setting for the lower,order 24 bits of the destination MAC address for PTP,primary messages.</description>
                            <lsb>0</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDMACRU</name>
                    <description>PTP,pdelay Message MAC Address Setting Registers</description>
                    <addressOffset>0x108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000180C2</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PDMACRU</name>
                            <description>These bits hold the setting for the higher,order 24 bits of the destination MAC address for PTP,pdelay messages.</description>
                            <lsb>0</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
