amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>PDMACRL</name>
                    <description>PTP,pdelay Message MAC Address Setting Registers</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000000E</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PDMACRL</name>
                            <description>These bits hold the setting for the lower,order 24 bits of the destination MAC address for PTP,pdelay messages.</description>
                            <lsb>0</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PETYPER</name>
                    <description>PTP Message EtherType Setting Register</description>
                    <addressOffset>0x110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000088F7</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TYPE</name>
                            <description>PTP Message EtherType Value SettingThese bits hold the setting for the EtherType field value for frames in the Ethernet II format.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PPIPR</name>
                    <description>PTP,primary Message Destination IP Address Setting Register</description>
                    <addressOffset>0x120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xE0000181</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PPIPR</name>
                            <description>These bits hold the setting for the destination IP address for PTPprimary messages.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDIPR</name>
                    <description>PTP,pdelay Message Destination IP Address Setting Register</description>
                    <addressOffset>0x124</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xE000006B</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PDIPR</name>
                            <description>These bits hold the setting for the destination IP address for PTPpdelay messages.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PETOSR</name>
                    <description>PTP Event Message TOS Setting Register</description>
                    <addressOffset>0x128</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EVTO</name>
                            <description>PTP Event Message TOS Field Value SettingThese bits hold the setting for the value of the TOS field within the IPv4 headers of PTP event messages.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PGTOSR</name>
                    <description>PTP general Message TOS Setting Register</description>
                    <addressOffset>0x12C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GETO</name>
                            <description>PTP general Message TOS Field Value SettingThese bits hold the setting for the value of the TOS field within the IPv4 headers of PTP general messages.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PPTTLR</name>
                    <description>PTP,primary Message TTL Setting Register</description>
                    <addressOffset>0x130</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000080</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PRTL</name>
                            <description>PTP,primary Message TTL Field Value SettingThese bits hold the setting for the value of the TTL field within the IPv4 headers of PTP,primary messages.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDTTLR</name>
                    <description>PTP,pdelay Message TTL Setting Register</description>
                    <addressOffset>0x134</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000001</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PDTL</name>
                            <description>PTP,pdelay Message TTL Field ValueThese bits hold the setting for the value of the TTL field within the IPv4 headers of PTP,pdelay messages.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEUDPR</name>
                    <description>PTP Event Message UDP Destination Port Number Setting Register</description>
                    <addressOffset>0x138</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000013F</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EVUPT</name>
                            <description>PTP Event Message Destination Port Number SettingThese bits hold the setting for the value of the destination port number field within the UDP headers of PTP event messages.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PGUDPR</name>
                    <description>PTP general Message UDP Destination Port Number Setting Register</description>
                    <addressOffset>0x13C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000140</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GEUPT</name>
                            <description>PTP general Message Destination Port NumberThese bits hold the setting for the value of the destination port number field within the UDP headers of PTP general messages.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FFLTR</name>
                    <description>Frame Reception Filter Setting Register</description>
                    <addressOffset>0x140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXTPRM</name>
                            <description>Extended Promiscuous ModeSetting</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ENB</name>
                            <description>Reception Filter EnableNOTE: The setting of these bits is only effective when EXTPRM=0.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PRT</name>
                            <description>Frame Reception EnableNOTE: The setting of these bits is only effective when EXTPRM=0 and ENB=1.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL</name>
                            <description>Receive MAC Address SelectNOTE: The setting of these bits is only effective when EXTPRM=0, ENB=1and RPT=1.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>FMAC%sRU</name>
                    <description>Frame Reception Filter MAC Address %s Setting Registers</description>
                    <addressOffset>0x160</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FMACRU</name>
                            <description>These bits hold the setting for the higher,order 24 bits of the destination MAC address for received multicast frames.</description>
                            <lsb>0</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>FMAC%sRL</name>
                    <description>Frame Reception Filter MAC Address %s Setting Registers</description>
                    <addressOffset>0x164</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FMACRL</name>
                            <description>These bits hold the setting for the lower,order 24 bits of the destination MAC address for received multicast frames.</description>
                            <lsb>0</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DASYMRU</name>
                    <description>Asymmetric Delay Setting Registers</description>
                    <addressOffset>0x1C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DASYMRU</name>
                            <description>These bits hold the setting for the higher,order 16 bits of the asymmetric delay value.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DASYMRL</name>
                    <description>Asymmetric Delay Setting Registers</description>
                    <addressOffset>0x1C4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DASYMRL</name>
                            <description>These bits hold the setting for the lower,order 32 bits of the asymmetric delay value.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSLATR</name>
                    <description>Timestamp Latency Setting Register</description>
                    <addressOffset>0x1C8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>INGP</name>
                            <description>Output Port Timestamp Latency SettingThese bits hold the setting for the time stamp latency (ns) for the output ports.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EGP</name>
                            <description>Input Port Timestamp Latency SettingThese bits hold the setting for the time stamp latency (ns) for the input ports.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYCONFR</name>
                    <description>SYNFP Operation Setting Register</description>
                    <addressOffset>0x1CC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FILDIS</name>
                            <description>Receive Message domainNumber Filter Disable</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SBDIS</name>
                            <description>Sync Message Transmission Bandwidth Securing Disable</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TCYC</name>
                            <description>PTP Message Transmission Interval SettingThese bits are used to set the time from the completion of one transmission to the start of the next in cycles of the transmission clock. A value n in these bits means that a transmission interval of n cycles will be secured.No interval is secured if the setting is 00h.We recommend the setting 28h (40 cycles).</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYFORMR</name>
                    <description>SYNFP Frame Format Setting Register</description>
                    <addressOffset>0x1D0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FORM1</name>
                            <description>Ethernet Frame Format Setting</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FORM0</name>
                            <description>Ethernet/UDP Encapsulation</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTOUTR</name>
                    <description>Response Message Reception Timeout Register</description>
                    <addressOffset>0x1D4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RSTOUTR</name>
                            <description>Response Message Reception Timeout Time SettingA response message not being received within n x 1024 (ns), where n is the setting, is judged to represent a timeout.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
