amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>EPTPC_CFG</name>
            <description>EPTPC Configulation</description>
            <baseAddress>0x40064500</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x80</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PTRSTR</name>
                    <description>EPTPC Reset Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESET</name>
                            <description>EPTPC Software Reset</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STCSELR</name>
                    <description>STCA Clock Select Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000006</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SCLKSEL</name>
                            <description>STCA Clock Select</description>
                            <lsb>8</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SCLKDIV</name>
                            <description>PCLKA Clock Frequency Division</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BYPASS</name>
                    <description>Bypass 1588 module Register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BYPASS0</name>
                            <description>Bypass 1588 module for Ether 0ch </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>SDHI0</name>
            <description>SD Host Interface 0</description>
            <baseAddress>0x40062000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>84</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x58</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x68</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1B0</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C0</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1E0</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>SD_CMD</name>
                    <description>Command Type Register</description>
                    <addressOffset>0x000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMD12AT</name>
                            <description>Multiple Block Transfer Mode (enabled at multiple block transfer)</description>
                            <lsb>14</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TRSTP</name>
                            <description>Single/Multiple Block Transfer (enabled when the command with data is handled)</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDRW</name>
                            <description>Write/Read Mode (enabled when the command with data is handled)</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDTP</name>
                            <description>Data Mode (Command Type)</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RSPTP</name>
                            <description>Mode/Response TypeNOTE: As some commands cannot be used in normal mode, see section 1.4.10, Example of SD_CMD Register Setting to select mode/response type.</description>
                            <lsb>8</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ACMD</name>
                            <description>Command Type Select</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDIDX</name>
                            <description>Command IndexThese bits specify Command Format[45:40] (command index).[Examples]CMD6: SD_CMD[7:0] = 8'b00_000110CMD18: SD_CMD[7:0] = 8'b00_010010ACMD13: SD_CMD[7:0] = 8'b01_001101</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_ARG</name>
                    <description>SD Command Argument Register</description>
                    <addressOffset>0x008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SD_ARG</name>
                            <description>Argument RegisterSet command format[39:8] (argument)</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_ARG1</name>
                    <description>SD Command Argument Register 1</description>
                    <addressOffset>0x00C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SD_ARG1</name>
                            <description>Argument Register 1Set command format[39:24] (argument)</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_STOP</name>
                    <description>Data Stop Register</description>
                    <addressOffset>0x010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SEC</name>
                            <description>Block Count EnableSet SEC to 1 at multiple block transfer.When SD_CMD is set as follows to start the command sequence while SEC is set to 1, CMD12 is automatically issued to stop multi,block transfer with the number of blocks which is set to SD_SECCNT.1. CMD18 or CMD25 in normal mode (SD_CMD[10:8] = 000)2. SD_CMD[15:13] = 001 in extended mode (CMD12 is automatically issued, multiple block transfer)When the command sequence is halted because of a communications error or timeout, CMD12 is not automatically issued.NOTE: Do not change the value of this bit when the CBSY bit in SD_INFO2 is set to 1.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>STP</name>
                            <description>Stop- When STP is set to 1 during multiple block transfer, CMD12 is issued to halt the transfer through the SD host interface.However, if a command sequence is halted because of a communications error or timeout, CMD12 is not issued. Although continued buffer access is possible even after STP has been set to 1, the buffer access error bit (ERR5 or ERR4) in SD_INFO2 will be set accordingly.- When STP has been set to 1 during transfer for single block write, the access end flag is set when SD_BUF becomes empty, and CMD12 is not issued. If SD_BUF does contain data, the access end flag is set on completion of reception of the busy state without CMD12 having been issued.- When STP has been set to 1 during transfer for single block read, the access end flag is set immediately after setting of the STP bit and CMD12 is not issued.- When STP is set to 1 during reception of the busy state after an R1b response, the access end flag is set on completion of reception of the busy state without CMD12 having been issued.- When STP is set to 1 after a command sequence has been completed, CMD12 is not issued and the access end flag is not set.- Set STP to 1 after the response end flag has been set.- Set STP to 0 after the response end flag has been set.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_SECCNT</name>
                    <description>Block Count Register</description>
                    <addressOffset>0x014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SD_SECCNT</name>
                            <description>Number of Transfer BlocksNOTE: Do not change the value of this bit when the CBSY bit in SD_INFO2 is set to 1.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_RSP10</name>
                    <description>SD Card Response Register 10</description>
                    <addressOffset>0x018</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SD_RSP10</name>
                            <description>Store the response from the SD card/MMC</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_RSP1</name>
                    <description>SD Card Response Register 1</description>
                    <addressOffset>0x01C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SD_RSP1</name>
                            <description>Store the response from the SD card/MMC</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_RSP32</name>
                    <description>SD Card Response Register 32</description>
                    <addressOffset>0x020</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SD_RSP32</name>
                            <description>Store the response from the SD card/MMC</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_RSP3</name>
                    <description>SD Card Response Register 3</description>
                    <addressOffset>0x024</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SD_RSP3</name>
                            <description>Store the response from the SD card/MMC</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_RSP54</name>
                    <description>SD Card Response Register 54</description>
                    <addressOffset>0x028</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SD_RSP54</name>
                            <description>Store the response from the SD card/MMC</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_RSP5</name>
                    <description>SD Card Response Register 5</description>
                    <addressOffset>0x02C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SD_RSP5</name>
                            <description>Store the response from the SD card/MMC</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_RSP76</name>
                    <description>SD Card Response Register 76</description>
                    <addressOffset>0x030</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SD_RSP76</name>
                            <description>Store the response from the SD card/MMC</description>
                            <lsb>0</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_RSP7</name>
                    <description>SD Card Response Register 7</description>
                    <addressOffset>0x034</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SD_RSP7</name>
                            <description>Store the response from the SD card/MMC</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
