amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>SD_SIZE</name>
                    <description>Transfer Data Length Register</description>
                    <addressOffset>0x04C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000200</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LEN</name>
                            <description>Transfer Data SizeThese bits specify a size between 1 and 512 bytes for the transfer of single blocks.In cases of multiple block transfer with automatic issuing of CMD12 (CMD18 and CMD25), the only specifiable transfer data size is 512 bytes. Furthermore, in cases of multiple block transfer without automatic issuing of CMD12, as well as 512 bytes, 32, 64, 128, and 256 bytes are specifiable. However, in the reading of 32, 64, 128, and 256 bytes for the transfer of multiple blocks, this is restricted to multiple block transfer by CMD53.Additionally, if a command accompanies data transfer, do not set these bits to 0.</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_OPTION</name>
                    <description>SD Card Access Control Option Register</description>
                    <addressOffset>0x050</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x000040EE</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WIDTH</name>
                            <description>Bus WidthNOTE: The initial value is applied at a reset and when the SOFT_RST.SDRST flag is 0.</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WIDTH8</name>
                            <description>Bus Widthsee b15, WIDTH bit</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOUTMASK</name>
                            <description>Timeout MASKWhen timeout occurs in case of inactivating timeout, software reset should be executed to terminate command sequence.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TOP</name>
                            <description>Timeout Counter</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CTOP</name>
                            <description>Card Detect Time Counter</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_ERR_STS1</name>
                    <description>SD Error Status Register 1</description>
                    <addressOffset>0x058</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00002000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CRCTK</name>
                            <description>CRC Status TokenStore the CRC status token value (normal value is 010b)</description>
                            <lsb>12</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CRCTKE</name>
                            <description> CRC Status Token Error</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RDCRCE</name>
                            <description> Read Data CRC Error</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RSPCRCE1</name>
                            <description> Response CRC Error 1NOTE: In cases where CMD12 is issued by setting a command index in SD_CMD, this is indicated in RSPCRCE0.</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RSPCRCE0</name>
                            <description> Response CRC Error 0NOTE: other than a response to a command issued within a command sequence</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CRCLENE</name>
                            <description> CRC Status Token Length Error</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RDLENE</name>
                            <description> Read Data Length Error</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RSPLENE1</name>
                            <description> Response Length Error 1NOTE: In cases where CMD12 is issued by setting a command index in SD_CMD, this is indicated in RSPLENE0.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RSPLENE0</name>
                            <description> Response Length Error 0NOTE: other than a response to a command issued within a command sequence</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDE1</name>
                            <description>Command Error 1NOTE: In cases where CMD12 is issued by setting a command index in SD_CMD, this is Indicated in CMDE0.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDE0</name>
                            <description>Command Error 0NOTE: other than a response to a command issued within a command sequence</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_ERR_STS2</name>
                    <description>SD Error Status Register 2</description>
                    <addressOffset>0x05C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CRCBSYTO</name>
                            <description>CRC Status Token Busy Timeout</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CRCTO</name>
                            <description>CRC Status Token Timeout</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RDTO</name>
                            <description>Read Data Timeout </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BSYTO1</name>
                            <description> Busy Timeout 1</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BSYTO0</name>
                            <description> Busy Timeout 0</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RSPTO1</name>
                            <description>Response Timeout 1 </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RSPTO0</name>
                            <description>Response Timeout 0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_BUF0</name>
                    <description>SD Buffer Register</description>
                    <addressOffset>0x060</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>SD_BUF</name>
                            <description>SD Buffer RegisterWhen writing to the SD card, the write data is written to this register. When reading from the SD card, the read data is read from this register. This register is internally connected to two 512-byte buffers.If both buffers are not empty when executing multiple block read, SD/MMC clock is stopped to suspend receiving data. When one of buffers is empty, SD/MMC clock is supplied to resume receiving data.  </description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SDIO_MODE</name>
                    <description>SDIO Mode Control Register</description>
                    <addressOffset>0x068</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>C52PUB</name>
                            <description>SDIO None AbortNOTE: See manual </description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IOABT</name>
                            <description>SDIO AbortNOTE: See manual</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RWREQ</name>
                            <description>Read Wait Request</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>INTEN</name>
                            <description> SDIO Mode</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SDIO_INFO1</name>
                    <description>SDIO Interrupt Flag Register 1</description>
                    <addressOffset>0x06C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFF9</resetMask>
                    <fields>
                        <field>
                            <name>EXWT</name>
                            <description>EXWT Status FlagNOTE: See manual</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                        </field>
                        <field>
                            <name>EXPUB52</name>
                            <description>EXPUB52 Status FlagNOTE: See manual</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                        </field>
                        <field>
                            <name>IOIRQ</name>
                            <description>SDIO Interrupt Status</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SDIO_INFO1_MASK</name>
                    <description>SDIO_INFO1 Interrupt Mask Register</description>
                    <addressOffset>0x070</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000C007</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXWTM</name>
                            <description>EXWT Interrupt Request Mask Control</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EXPUB52M</name>
                            <description>EXPUB52 Interrupt Request Mask Control</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IOIRQM</name>
                            <description>IOIRQ Interrupt Mask Control</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_DMAEN</name>
                    <description>DMA Mode Enable Register</description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00001010</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DMAEN</name>
                            <description>SD_BUF Read/Write DMA Transfer</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SOFT_RST</name>
                    <description>Software Reset Register</description>
                    <addressOffset>0x1C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000007</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SDRST</name>
                            <description>Software Reset of SD I/F Unit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SDIF_MODE</name>
                    <description>SD Interface Mode Setting Register</description>
                    <addressOffset>0x1CC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>NOCHKCR</name>
                            <description>CRC Check Mask (for MMC test commands)</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
