amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SPMON</name>
            <description>CPU Stack Pointer Monitor</description>
            <baseAddress>0x40000D00</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>14</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>MSPMPUOAD</name>
                    <description>Stack Pointer Monitor Operation After Detection Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>Write Keyword The data written to these bits are not stored.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OAD</name>
                            <description>Operation after detection</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSPMPUCTL</name>
                    <description>Stack Pointer Monitor Access Control Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ERROR</name>
                            <description>SP_main monitor error flag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>SP_main monitor enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSPMPUPT</name>
                    <description>Stack Pointer Monitor Protection Register</description>
                    <addressOffset>0x06</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>Write Keyword The data written to these bits are not stored.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PROTECT</name>
                            <description>Protection of register (MSPMPUAC, MSPMPUSA and MSPMPUSE)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSPMPUSA</name>
                    <description>Main Stack Pointer Monitor Start Address Register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>MSPMPUSA</name>
                            <description>Region start address register Address where the region starts, for use in region determination.NOTE: Range: 0x1FF00000-0x200FFFFC         The low,order 2 bits are fixed to 0.</description>
                            <lsb>2</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x1FF00000</minimum>
                                    <maximum>0x200FFFFC</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSPMPUEA</name>
                    <description>Main Stack Pointer Monitor End Address Register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>MSPMPUEA</name>
                            <description>Region end address register Address where the region starts, for use in region determination.NOTE: Range: 0x1FF00003-0x200FFFFF         The low,order 2 bits are fixed to 1.</description>
                            <lsb>2</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x1FF00003</minimum>
                                    <maximum>0x200FFFFF</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSPMPUOAD</name>
                    <description>Stack Pointer Monitor Operation After Detection Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>Write Keyword The data written to these bits are not stored.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OAD</name>
                            <description>Operation after detection</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSPMPUCTL</name>
                    <description>Stack Pointer Monitor Access Control Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFEFF</resetMask>
                    <fields>
                        <field>
                            <name>ERROR</name>
                            <description>SP_process monitor error flag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>SP_process monitor enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSPMPUPT</name>
                    <description>Stack Pointer Monitor Protection Register</description>
                    <addressOffset>0x16</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>Write Keyword The data written to these bits are not stored.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PROTECT</name>
                            <description>Protection of register (PSPMPUAC, PSPMPUSA and PSPMPUSE)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSPMPUSA</name>
                    <description>Process Stack Pointer Monitor Start Address Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>PSPMPUSA</name>
                            <description>Region start address register Address where the region starts, for use in region determination.NOTE: Range: 0x1FF00000-0x200FFFFC         The low,order 2 bits are fixed to 0.</description>
                            <lsb>2</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x1FF00000</minimum>
                                    <maximum>0x200FFFFC</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSPMPUEA</name>
                    <description>Process Stack Pointer Monitor End Address Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>PSPMPUEA</name>
                            <description>Region end address register Address where the region starts, for use in region determination.NOTE: Range: 0x1FF00003-0x200FFFFF         The low,order 2 bits are fixed to 1.</description>
                            <lsb>2</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x1FF00003</minimum>
                                    <maximum>0x200FFFFF</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
