amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>ADC120</name>
            <description>12bit A/D Converter 0</description>
            <baseAddress>0x4005C000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>13</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0E</offset>
                <size>34</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>10</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x62</offset>
                <size>22</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x7A</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x80</offset>
                <size>9</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8C</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x90</offset>
                <size>21</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA6</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xA8</offset>
                <size>5</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xB0</offset>
                <size>33</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xD2</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xDD</offset>
                <size>11</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xEA</offset>
                <size>6</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1A0</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1B0</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1B4</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1E0</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>ADCSR</name>
                    <description>A/D Control Register</description>
                    <addressOffset>0x000</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADST</name>
                            <description>A/D Conversion Start</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADCS</name>
                            <description>Scan Mode Select</description>
                            <lsb>13</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TRGE</name>
                            <description>Trigger Start Enable</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EXTRG</name>
                            <description>Trigger Select</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DBLE</name>
                            <description>Double Trigger Mode Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>GBADIE</name>
                            <description>Group B Scan End Interrupt Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DBLANS</name>
                            <description>Double Trigger Channel SelectThese bits select one analog input channel for double triggered operation. The setting is only effective while double trigger mode is selected.</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADANSA0</name>
                    <description>A/D Channel Select Register A0</description>
                    <addressOffset>0x004</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ANSA07</name>
                            <description>AN007 Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ANSA06</name>
                            <description>AN006 Select</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ANSA05</name>
                            <description>AN005 Select</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ANSA04</name>
                            <description>AN004 Select</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ANSA03</name>
                            <description>AN003 Select</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ANSA02</name>
                            <description>AN002 Select</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ANSA01</name>
                            <description>AN001 Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ANSA00</name>
                            <description>AN000 Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADANSA1</name>
                    <description>A/D Channel Select Register A1</description>
                    <addressOffset>0x006</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ANSA20</name>
                            <description>AN020 Select</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ANSA19</name>
                            <description>AN019 Select</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ANSA18</name>
                            <description>AN018 Select</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ANSA17</name>
                            <description>AN017 Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ANSA16</name>
                            <description>AN016 Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADADS0</name>
                    <description>A/D,Converted Value Addition/Average Channel Select Register 0</description>
                    <addressOffset>0x008</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADS07</name>
                            <description>A/D,Converted Value Addition/Average Channel AN007 Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADS06</name>
                            <description>A/D,Converted Value Addition/Average Channel AN006 Select</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADS05</name>
                            <description>A/D,Converted Value Addition/Average Channel AN005 Select</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADS04</name>
                            <description>A/D,Converted Value Addition/Average Channel AN004 Select</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADS03</name>
                            <description>A/D,Converted Value Addition/Average Channel AN003 Select</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADS02</name>
                            <description>A/D,Converted Value Addition/Average Channel AN002 Select</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADS01</name>
                            <description>A/D,Converted Value Addition/Average Channel AN001 Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADS00</name>
                            <description>A/D,Converted Value Addition/Average Channel AN000 Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADADS1</name>
                    <description>A/D,Converted Value Addition/Average Channel Select Register 1</description>
                    <addressOffset>0x00A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADS20</name>
                            <description>A/D,Converted Value Addition/Average Channel AN020 Select</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADS19</name>
                            <description>A/D,Converted Value Addition/Average Channel AN019 Select</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADS18</name>
                            <description>A/D,Converted Value Addition/Average Channel AN018 Select</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADS17</name>
                            <description>A/D,Converted Value Addition/Average Channel AN017 Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADS16</name>
                            <description>A/D,Converted Value Addition/Average Channel AN016 Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADADC</name>
                    <description>A/D,Converted Value Addition/Average Count Select Register</description>
                    <addressOffset>0x00C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>AVEE</name>
                            <description>Average mode enable bit.Note: The AVEE bit converts twice, and only when converting it four times, is effective. Please do not set (ADADC.AVEE=1) to conversion (ADADC.ADC 2:0=010b) three times when you select the average mode.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADC</name>
                            <description>Addition frequency selection bit.NOTE: AVEE bit is valid at the only setting of ADC[2:0] bits = 001b or 011b. When average mode is selected by setting the ADADC.AVEE bit to 1, do not set the addition count to three times (ADADC.ADC[2:0] = 010b)</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
