amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>ADCMPDR0</name>
                    <description>A/D Compare Function Window A Lower,Side Level Setting Register</description>
                    <addressOffset>0x09C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADCMPDR0</name>
                            <description>The ADCMPDR0 register sets the reference data when the compare window A function is used. ADCMPDR0 sets the lower,side level of window A.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPDR1</name>
                    <description>A/D Compare Function Window A Upper,Side Level Setting Register</description>
                    <addressOffset>0x09E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADCMPDR1</name>
                            <description>The ADCMPDR1 register sets the reference data when the compare window A function is used. ADCMPDR1 sets the upper,side level of window A..</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPSR0</name>
                    <description>A/D Compare Function Window A Channel Status Register 0</description>
                    <addressOffset>0x0A0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMPSTCHA07</name>
                            <description>Compare window A flag of AN007</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPSTCHA06</name>
                            <description>Compare window A flag of AN006</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPSTCHA05</name>
                            <description>Compare window A flag of AN005</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPSTCHA03</name>
                            <description>Compare window A flag of AN003</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPSTCHA02</name>
                            <description>Compare window A flag of AN002</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPSTCHA01</name>
                            <description>Compare window A flag of AN001</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPSTCHA00</name>
                            <description>Compare window A flag of AN000</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPSR1</name>
                    <description>A/D Compare Function Window A Channel Status Register 1</description>
                    <addressOffset>0x0A2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMPSTCHA19</name>
                            <description>Compare window A flag of AN019</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPSTCHA18</name>
                            <description>Compare window A flag of AN018</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPSTCHA17</name>
                            <description>Compare window A flag of AN017</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPSTCHA16</name>
                            <description>Compare window A flag of AN016</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPSER</name>
                    <description>A/D Compare Function Window A Extended Input Channel Status Register</description>
                    <addressOffset>0x0A4</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CMPSTOCA</name>
                            <description>Compare Window A Internal Reference Voltage Compare Flag When window A operation is enabled (ADCMPCR.CMPAE = 1b), this bit indicates the temperature sensor output comparison result. When window A operation is disabled (ADCMPCR.CMPAE = 0b), comparison conditions for CMPSTTSA are not met any time.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPSTTSA</name>
                            <description>Compare Window A Temperature Sensor Output Compare Flag When window A operation is enabled (ADCMPCR.CMPAE = 1b), this bit indicates the temperature sensor output comparison result. When window A operation is disabled (ADCMPCR.CMPAE = 0b), comparison conditions for CMPSTTSA are not met any time.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPBNSR</name>
                    <description>A/D Compare Function Window B Channel Selection Register</description>
                    <addressOffset>0x0A6</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CMPLB</name>
                            <description>Compare window B Compare condition setting bit.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPCHB</name>
                            <description>Compare window B channel selection bit.The channel that compares it on the condition of compare window B is selected.</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADWINLLB</name>
                    <description>A/D Compare Function Window B Lower,Side Level Setting Register</description>
                    <addressOffset>0x0A8</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADWINLLB</name>
                            <description>This register is used to compare A window function is used to set the lower level of the window B.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADWINULB</name>
                    <description>A/D Compare Function Window B Upper,Side Level Setting Register</description>
                    <addressOffset>0x0AA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ADWINULB</name>
                            <description>This register is used to compare A window function is used to set the higher level of the window B.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPBSR</name>
                    <description>A/D Compare Function Window B Status Register</description>
                    <addressOffset>0x0AC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CMPSTB</name>
                            <description>Compare window B flag.It is a status flag that shows the comparative result of CH (AN100-AN103, AN105-AN107, AN116-AN119, temperature sensor, and internal reference voltage) made the object of window B relation condition.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADSSTRL</name>
                    <description>A/D Sampling State Register L</description>
                    <addressOffset>0x0DD</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0B</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SST</name>
                            <description>Sampling Time Setting (AN116-AN119)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x05</minimum>
                                    <maximum>0xFF</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADSSTRT</name>
                    <description>A/D Sampling State Register T</description>
                    <addressOffset>0x0DE</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0B</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SST</name>
                            <description>Sampling Time Setting (temperature sensor output)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x05</minimum>
                                    <maximum>0xFF</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADSSTRO</name>
                    <description>A/D Sampling State Register O</description>
                    <addressOffset>0x0DF</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0B</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SST</name>
                            <description>Sampling Time Setting (Internal reference voltage)</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x05</minimum>
                                    <maximum>0xFF</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x1</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>ADSSTR0%s</name>
                    <description>A/D Sampling State Register %s (Corresponding Channel is AN10%s )</description>
                    <addressOffset>0x0E0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0B</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SST</name>
                            <description>Sampling time setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x05</minimum>
                                    <maximum>0xFF</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x1</dimIncrement>
                    <dimIndex>5-7</dimIndex>
                    <name>ADSSTR0%s_1</name>
                    <description>A/D Sampling State Register %s (Corresponding Channel is AN10%s )</description>
                    <addressOffset>0x0E5</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0B</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SST</name>
                            <description>Sampling time setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x05</minimum>
                                    <maximum>0xFF</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
