amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>MSTP</name>
            <description>Module Stop Control B,C,D</description>
            <baseAddress>0x40047000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>MSTPCRB</name>
                    <description>Module Stop Control Register B</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MSTPB31</name>
                            <description>Serial Communication Interface 0 Module Stop</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB30</name>
                            <description>Serial Communication Interface 1 Module Stop</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB29</name>
                            <description>Serial Communication Interface 2 Module Stop</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB28</name>
                            <description>Serial Communication Interface 3 Module Stop</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB27</name>
                            <description>Serial Communication Interface 4 Module Stop</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB26</name>
                            <description>Serial Communication Interface 5 Module Stop</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB25</name>
                            <description>Serial Communication Interface 6 Module Stop</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB24</name>
                            <description>Serial Communication Interface 7 Module Stop</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB23</name>
                            <description>Serial Communication Interface 8 Module Stop</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB22</name>
                            <description>Serial Communication Interface 9 Module Stop</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB19</name>
                            <description>Serial Peripheral Interface 0 Module Stop</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB18</name>
                            <description>Serial Peripheral Interface Module Stop</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB15</name>
                            <description>ETHERC0 and EDMAC0 Module Stop</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB13</name>
                            <description>EPTPC and PTPEDMAC Module Stop</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB12</name>
                            <description>Universal Serial Bus 2.0 HS Interface Module Stop</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB11</name>
                            <description>Universal Serial Bus 2.0 FS Interface Module Stop</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB9</name>
                            <description>I2C Bus Interface 0 Module Stop</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB8</name>
                            <description>I2C Bus Interface 1 Module Stop</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB7</name>
                            <description>I2C Bus Interface 2 Module Stop</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB6</name>
                            <description>Queued Serial Peripheral Interface Module Stop</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB5</name>
                            <description>IrDA Module Stop</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB2</name>
                            <description>RCAN0 Module Stop</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB1</name>
                            <description>RCAN1 Module Stop</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSTPCRC</name>
                    <description>Module Stop Control Register C</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MSTPC31</name>
                            <description>TSIP Module Stop</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC14</name>
                            <description>Event Link Controller Module Stop</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC13</name>
                            <description>Data Operation Circuit Module Stop</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC12</name>
                            <description>Synchronous Digital Hierarchy/ Multi Media Card 0 Module Stop</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC11</name>
                            <description>Synchronous Digital Hierarchy/ Multi Media Card 1 Module Stop</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC9</name>
                            <description>Sampling Rate Converter Module Stop</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC8</name>
                            <description>Synchronous Serial Interface 0 Module Stop</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC7</name>
                            <description>Synchronous Serial Interface 1 Module Stop</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC6</name>
                            <description>2DG engine Module Stop</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC5</name>
                            <description>JPEG codec engine Module Stop</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC4</name>
                            <description>Grafic LCD Controler Module Stop</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC3</name>
                            <description>Capacitive Touch Sensing Unit Module Stop</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC2</name>
                            <description>Parallel Data Capture Module Stop</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC1</name>
                            <description>CRC Calculator Module Stop</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC0</name>
                            <description>CAC Module Stop</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
