amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>MSTPCRD</name>
                    <description>Module Stop Control Register D</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MSTPD28</name>
                            <description>Comparator,OC0 Module Stop</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD27</name>
                            <description>Comparator,OC1 Module Stop</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD26</name>
                            <description>Comparator,OC2 Module Stop</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD25</name>
                            <description>Comparator,OC3 Module Stop</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD24</name>
                            <description>Comparator,OC4 Module Stop</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD23</name>
                            <description>Comparator,OC5 Module Stop</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD22</name>
                            <description>Temperature Sensor Module Stop</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD20</name>
                            <description>D/A Converter 0 Module Stop</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD16</name>
                            <description>12-bit A/D Converter 0 Module Stop</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD15</name>
                            <description>12-bit A/D Converter 1 Module Stop</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD14</name>
                            <description>PGI Module Stop</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD6</name>
                            <description>GPT ch13-ch8 Module Stop</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD5</name>
                            <description>GPT ch7-ch0 Module Stop</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD3</name>
                            <description>AGT0 Module StopNote: AGT0 is in the module stop state when the count source is either of PCLKB, PCLKB/2 or PCLKB/8. In case the count source is sub,clock or LOCO, this bit should be set to 1 except when accessing the registers of AGT0.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD2</name>
                            <description>AGT1 Module StopNote: AGT1 is in the module stop state when the count source is either of PCLKB, PCLKB/2 or PCLKB/8. In case the count source is sub,clock or LOCO, this bit should be set to 1 except when accessing the registers of AGT1.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
