amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>GTPBR</name>
                    <description>General PWM Timer Cycle Setting Buffer Register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GTPBR</name>
                            <description>Cycle Setting Buffer Register</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GTDTCR</name>
                    <description>General PWM Timer Dead Time Control Register</description>
                    <addressOffset>0x88</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TDE</name>
                            <description>Negative,Phase Waveform Setting</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GTDVU</name>
                    <description>General PWM Timer Dead Time Value Register U</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>GTDVU</name>
                            <description>Dead Time Value Register U</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="GPT328">
            <name>GPT329</name>
            <description>General PWM Timer 9 (32-bit Enhanced)</description>
            <baseAddress>0x40078900</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT328">
            <name>GPT3210</name>
            <description>General PWM Timer 10 (32-bit Enhanced)</description>
            <baseAddress>0x40078A00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT328">
            <name>GPT3211</name>
            <description>General PWM Timer 11 (32-bit Enhanced)</description>
            <baseAddress>0x40078B00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT328">
            <name>GPT3212</name>
            <description>General PWM Timer 12 (32-bit Enhanced)</description>
            <baseAddress>0x40078C00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPT328">
            <name>GPT3213</name>
            <description>General PWM Timer 13 (32-bit Enhanced)</description>
            <baseAddress>0x40078D00</baseAddress>
        </peripheral>
        <peripheral>
            <name>RTC</name>
            <description>Realtime Clock</description>
            <baseAddress>0x40044000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x02</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x02</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x06</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x06</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0A</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0C</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0E</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x12</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x12</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x16</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x16</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1A</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1A</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1E</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x22</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x24</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x28</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2A</offset>
                <size>5</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>6</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x52</offset>
                <size>48</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x52</offset>
                <size>48</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x54</offset>
                <size>48</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x54</offset>
                <size>48</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x56</offset>
                <size>48</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x56</offset>
                <size>48</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x5A</offset>
                <size>48</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x5A</offset>
                <size>48</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x5C</offset>
                <size>48</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>R64CNT</name>
                    <description>64-Hz Counter</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x80</resetMask>
                    <fields>
                        <field>
                            <name>F1HZ</name>
                            <description>1Hz</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F2HZ</name>
                            <description>2Hz</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F4HZ</name>
                            <description>4Hz</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F8HZ</name>
                            <description>8Hz</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F16HZ</name>
                            <description>16Hz</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F32HZ</name>
                            <description>32Hz</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F64HZ</name>
                            <description>64Hz</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSECCNT</name>
                    <description>Second Counter</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>SEC10</name>
                            <description>10-Second Count Counts from 0 to 5 for 60-second counting.</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEC1</name>
                            <description>1-Second Count Counts from 0 to 9 every second. When a carry is generated, 1 is added to the tens place.</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BCNT0</name>
                    <description>Binary Counter 0</description>
                    <alternateRegister>RSECCNT</alternateRegister>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>BCNT0</name>
                            <description>The BCNT0 counter is a readable/writable 32-bit binary counter b7 to b0.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RMINCNT</name>
                    <description>Minute Counter</description>
                    <addressOffset>0x04</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>MIN10</name>
                            <description>10-Minute Count Counts from 0 to 5 for 60-minute counting.</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MIN1</name>
                            <description>1-Minute Count Counts from 0 to 9 every minute. When a carry is generated, 1 is added to the tens place.</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BCNT1</name>
                    <description>Binary Counter 1</description>
                    <alternateRegister>RMINCNT</alternateRegister>
                    <addressOffset>0x04</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>BCNT1</name>
                            <description>The BCNT1 counter is a readable/writable 32-bit binary counter b15 to b8.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RHRCNT</name>
                    <description>Hour Counter</description>
                    <addressOffset>0x06</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>PM</name>
                            <description>Time Counter Setting for a.m./p.m.</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HR10</name>
                            <description>10-Hour Count Counts from 0 to 2 once per carry from the ones place.</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HR1</name>
                            <description>1-Hour Count Counts from 0 to 9 once per hour. When a carry is generated, 1 is added to the tens place.</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BCNT2</name>
                    <description>Binary Counter 2</description>
                    <alternateRegister>RHRCNT</alternateRegister>
                    <addressOffset>0x06</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>BCNT2</name>
                            <description>The BCNT2 counter is a readable/writable 32-bit binary counter b23 to b16.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RWKCNT</name>
                    <description>Day,of,Week Counter</description>
                    <addressOffset>0x08</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DAYW</name>
                            <description>Day,of,Week Counting</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BCNT3</name>
                    <description>Binary Counter 3</description>
                    <alternateRegister>RWKCNT</alternateRegister>
                    <addressOffset>0x08</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>BCNT3</name>
                            <description>The BCNT3 counter is a readable/writable 32-bit binary counter b31 to b24.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDAYCNT</name>
                    <description>Day Counter</description>
                    <addressOffset>0x0A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xC0</resetMask>
                    <fields>
                        <field>
                            <name>DATE10</name>
                            <description>10-Day Count Counts from 0 to 3 once per carry from the ones place.</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATE1</name>
                            <description>1-Day Count Counts from 0 to 9 once per day. When a carry is generated, 1 is added to the tens place.</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
