amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>RCR1</name>
                    <description>RTC Control Register 1</description>
                    <addressOffset>0x22</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x0A</resetMask>
                    <fields>
                        <field>
                            <name>PES</name>
                            <description>Periodic Interrupt Select</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RTCOS</name>
                            <description>RTCOUT Output Select</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PIE</name>
                            <description>Periodic Interrupt Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CIE</name>
                            <description>Carry Interrupt Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>AIE</name>
                            <description>Alarm Interrupt Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCR2</name>
                    <description>RTC Control Register 2</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x0E</resetMask>
                    <fields>
                        <field>
                            <name>CNTMD</name>
                            <description>Count Mode Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HR24</name>
                            <description>Hours Mode</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>AADJP</name>
                            <description>Automatic Adjustment Period Select (When the LOCO clock is selected, the setting of this bit is disabled.)</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>AADJE</name>
                            <description>Automatic Adjustment Enable (When the LOCO clock is selected, the setting of this bit is disabled.)</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RTCOE</name>
                            <description>RTCOUT Output Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADJ30</name>
                            <description>30-Second Adjustment</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RESET</name>
                            <description>RTC Software Reset</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>START</name>
                            <description>Start</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCR4</name>
                    <description>RTC Control Register 4</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFE</resetMask>
                    <fields>
                        <field>
                            <name>RCKSEL</name>
                            <description>Count Source Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFRH</name>
                    <description>Frequency Register H</description>
                    <addressOffset>0x2A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFE</resetMask>
                    <fields>
                        <field>
                            <name>RFC16</name>
                            <description>Frequency Comparison Value (b16) To generate the operating clock from the LOCOclock, this bit sets the comparison value of the 128-Hz clock cycle.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFRL</name>
                    <description>Frequency Register L</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                    <fields>
                        <field>
                            <name>RFC</name>
                            <description>Frequency Comparison Value(b15-b0) To generate the operating clock from the main clock, this bit sets the comparison value of the 128-Hz clock cycle.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RADJ</name>
                    <description>Time Error Adjustment Register</description>
                    <addressOffset>0x2E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>PMADJ</name>
                            <description>Plus,Minus</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADJ</name>
                            <description>Adjustment Value These bits specify the adjustment value from the prescaler.</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x2</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RTCCR%s</name>
                    <description>Time Capture Control Register %s</description>
                    <addressOffset>0x40</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>TCNF</name>
                            <description>Time Capture Noise Filter Control</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TCST</name>
                            <description>Time Capture Status</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TCCT</name>
                            <description>Time Capture Control</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RSECCP%s</name>
                    <description>Second Capture Register %s</description>
                    <addressOffset>0x52</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>SEC10</name>
                            <description>10-Second Capture Capture value for the tens place of seconds</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SEC1</name>
                            <description>1-Second Capture Capture value for the ones place of seconds</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>BCNT0CP%s</name>
                    <description>BCNT0 Capture Register %s</description>
                    <alternateRegister>RSECCP%s</alternateRegister>
                    <addressOffset>0x52</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>BCNT0CP</name>
                            <description>BCNT0CP is a read,only register that captures the BCNT0 value when a time capture event is detected.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RMINCP%s</name>
                    <description>Minute Capture Register %s</description>
                    <addressOffset>0x54</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>MIN10</name>
                            <description>10-Minute Capture Capture value for the tens place of minutes</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MIN1</name>
                            <description>1-Minute Capture Capture value for the ones place of minutes</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>BCNT1CP%s</name>
                    <description>BCNT1 Capture Register %s</description>
                    <alternateRegister>RMINCP%s</alternateRegister>
                    <addressOffset>0x54</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>BCNT1CP</name>
                            <description>BCNT1CP is a read,only register that captures the BCNT1 value when a time capture event is detected.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RHRCP%s</name>
                    <description>Hour Capture Register %s</description>
                    <addressOffset>0x56</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>PM</name>
                            <description>A.m./p.m. select for time counter setting.</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HR10</name>
                            <description>10-Minute Capture Capture value for the tens place of minutes</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HR1</name>
                            <description>1-Minute Capture Capture value for the ones place of minutes</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>BCNT2CP%s</name>
                    <description>BCNT2 Capture Register %s</description>
                    <alternateRegister>RHRCP%s</alternateRegister>
                    <addressOffset>0x56</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>BCNT2CP</name>
                            <description>BCNT2CP is a read,only register that captures the BCNT2 value when a time capture event is detected.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RDAYCP%s</name>
                    <description>Date Capture Register %s</description>
                    <addressOffset>0x5A</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>DATE10</name>
                            <description>10-Day Capture Capture value for the tens place of minutes</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATE1</name>
                            <description>1-Day Capture Capture value for the ones place of minutes</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>BCNT3CP%s</name>
                    <description>BCNT3 Capture Register %s</description>
                    <alternateRegister>RDAYCP%s</alternateRegister>
                    <addressOffset>0x5A</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>BCNT3CP</name>
                            <description>BCNT3CP is a read,only register that captures the BCNT3 value when a time capture event is detected.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>3</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-2</dimIndex>
                    <name>RMONCP%s</name>
                    <description>Month Capture Register %s</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>MON10</name>
                            <description>10-Month Capture Capture value for the tens place of months</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MON1</name>
                            <description>1-Month Capture Capture value for the ones place of months</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
