amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SSIE0</name>
            <description>Serial Sound Interface Enhanced (SSIE)</description>
            <baseAddress>0x4004E000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>SSICR</name>
                    <description>Control Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CKS</name>
                            <description>Oversampling Clock Select</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TUIEN</name>
                            <description>Transmit Underflow Interrupt Enable</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TOIEN</name>
                            <description>Transmit Overflow Interrupt Enable</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RUIEN</name>
                            <description>Receive Underflow Interrupt Enable</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ROIEN</name>
                            <description>Receive Overflow Interrupt Enable</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IIEN</name>
                            <description>Idle Mode Interrupt Enable</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CHNL</name>
                            <description>Channels</description>
                            <lsb>22</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DWL</name>
                            <description>Data Word Length</description>
                            <lsb>19</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SWL</name>
                            <description>System Word LengthSet the system word length to the bit clock frequency/2 fs.</description>
                            <lsb>16</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SWSD</name>
                            <description>Serial WS Direction NOTE: Only the following settings are allowed: (SCKD, SWSD) = (0, 0) and (1, 1). Other settings are prohibited.</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SCKP</name>
                            <description>Serial Bit Clock Polarity</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SWSP</name>
                            <description>Serial WS Polarity</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SPDP</name>
                            <description>Serial Padding Polarity</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SDTA</name>
                            <description>Serial Data Alignment</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PDTA</name>
                            <description>Parallel Data Alignment</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DEL</name>
                            <description>Serial Data Delay</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CKDV</name>
                            <description>Serial Oversampling Clock Division Ratio</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MUEN</name>
                            <description>Mute EnableNOTE: When this module is muted, the value of outputting serial data is rewritten to 0 but data transmission is not stopped. Write dummy data to the SSIFTDR not to generate a transmit underflow because the number of data in the transmit FIFO is decreasing.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEN</name>
                            <description>Transmit Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>REN</name>
                            <description>Receive Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSISR</name>
                    <description>Status Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x02000013</resetValue>
                    <resetMask>0x3E00007F</resetMask>
                    <fields>
                        <field>
                            <name>TUIRQ</name>
                            <description>Transmit Underflow Error Interrupt Status Flag NOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TOIRQ</name>
                            <description>Transmit Overflow Error Interrupt Status Flag NOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RUIRQ</name>
                            <description>Receive Underflow Error Interrupt Status Flag NOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ROIRQ</name>
                            <description>Receive Overflow Error Interrupt Status Flag NOTE: Writable only to clear the flag. Confirm the value is 1 and then write 0.</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IIRQ</name>
                            <description>Idle Mode Interrupt Status Flag</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TCHNO</name>
                            <description>Transmit Channel Number</description>
                            <lsb>5</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TSWNO</name>
                            <description>Transmit Serial Word Number</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCHNO</name>
                            <description>Receive Channel Number.These bits are read as 00b.</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSWNO</name>
                            <description>Receive Serial Word Number</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IDST</name>
                            <description>Idle Mode Status Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSIFCR</name>
                    <description>FIFO Control Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AUCKE</name>
                            <description>Oversampling Clock Enable</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SSIRST</name>
                            <description>SSI soft ware reset</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TTRG</name>
                            <description>Transmit Data Trigger Number NOTE: The values in parenthesis are the number of empty stages in SSIFTDR at which the TDE flag is set.</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RTRG</name>
                            <description>Receive Data Trigger Number</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TIE</name>
                            <description>Transmit Interrupt Enable NOTE: TXI can be cleared by clearing either the TDE flag (see the description of the TDE bit for details) or TIE bit.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RIE</name>
                            <description>Receive Interrupt Enable NOTE: RXI can be cleared by clearing either the RDF flag (see the description of the RDF bit for details) or RIE bit.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TFRST</name>
                            <description>Transmit FIFO Data Register Reset</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RFRST</name>
                            <description>Receive FIFO Data Register Reset</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSIFSR</name>
                    <description>FIFO Status Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TDC</name>
                            <description>Transmit Data Indicate Flag(Indicates the number of data units stored in SSIFTDR)</description>
                            <lsb>24</lsb>
                            <msb>27</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TDE</name>
                            <description>Transmit Data Empty Flag NOTE: Since the SSIFTDR register is a 32-byte FIFO register, the maximum number of bytes that can be written to it while the TDE flag is 1 is 8 - TDC[3:0]. If writing data to the SSIFTDR register is continued after all the data is written, writing will be invalid and an overflow occurs.</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RDC</name>
                            <description>Receive Data Indicate Flag(Indicates the number of data units stored in SSIFRDR)</description>
                            <lsb>8</lsb>
                            <msb>11</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDF</name>
                            <description>Receive Data Full Flag NOTE:  Since the SSIFRDR register is a 32-byte FIFO register, the maximum number of data bytes that can be read from it while the RDF flag is 1 is indicated in the RDC[3:0] flags. If reading data from the SSIFRDR register is continued after all the data is read, undefined values will be read.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSIFTDR</name>
                    <description>Transmit FIFO Data Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>SSIFTDR</name>
                            <description>SSIFTDR is a write,only FIFO register consisting of eight stages of 32-bit registers for storing data to be serially transmitted.  NOTE: that when the SSIFTDR register is full of data (32 bytes), the next data cannot be written to it. If writing is attempted, it will be ignored and an overflow occurs.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
