amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>SSIFRDR</name>
                    <description>Receive FIFO Data Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>SSIFRDR</name>
                            <description>SSIFRDR is a read,only FIFO register consisting of eight stages of 32-bit registers for storing serially received data.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSIOFR</name>
                    <description>Audio Format Register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BCKASTP</name>
                            <description>Whether to Enable Stopping BCK Output When SSIE is in Idle Status</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LRCONT</name>
                            <description>Whether to Enable LRCK/FS Continuation</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OMOD</name>
                            <description>Audio Format Select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSISCR</name>
                    <description>Status Control Register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TDES</name>
                            <description>TDE Setting Condition Select</description>
                            <lsb>8</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RDFS</name>
                            <description>RDF Setting Condition Select</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="SSIE0">
            <name>SSIE1</name>
            <description>Serial Sound Interface Enhanced (SSIE)</description>
            <baseAddress>0x4004E100</baseAddress>
        </peripheral>
        <peripheral>
            <name>USBFS</name>
            <description>USB 2.0 FS Module</description>
            <baseAddress>0x40090000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x28</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x36</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x46</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x54</offset>
                <size>14</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x64</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x68</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x6C</offset>
                <size>22</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x90</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x92</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xD0</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xF0</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x400</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>SYSCFG</name>
                    <description>System Configuration Control Register</description>
                    <addressOffset>0x000</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SCKE</name>
                            <description>USB Clock Enable</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DCFM</name>
                            <description>Controller Function Select</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DRPD</name>
                            <description>D+/D- Line Resistor Control</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DPRPU</name>
                            <description>D+ Line Resistor Control</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USBE</name>
                            <description>USB Operation Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSSTS0</name>
                    <description>System Configuration Status Register 0 </description>
                    <addressOffset>0x004</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                    <fields>
                        <field>
                            <name>OVCMON</name>
                            <description>External USB0_OVRCURA/ USB0_OVRCURB Input Pin MonitorThe OCVMON[1] bit indicates the status of the USBHS_OVRCURA pin. The OCVMON[0] bit indicates the status of the USBHS_OVRCURB pin.</description>
                            <lsb>14</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HTACT</name>
                            <description>USB Host Sequencer Status Monitor</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SOFEA</name>
                            <description>Active Monitor When the Host Controller is Selected.</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IDMON</name>
                            <description>External ID0 Input Pin Monitor</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LNST</name>
                            <description>USB Data Line Status Monitor</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DVSTCTR0</name>
                    <description>Device State Control Register 0</description>
                    <addressOffset>0x008</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HNPBTOA</name>
                            <description>Host Negotiation Protocol (HNP) Control     This bit is used when switching from device B to device A while in OTG mode. If the HNPBTOA bit is 1, the internal function control keeps the suspended state until the HNP processing ends even  though SYSCFG.DPRPU = 0 or SYSCFG.DCFM = 1 is set.</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EXICEN</name>
                            <description>USB0_EXICEN Output Pin Control</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>VBUSEN</name>
                            <description>USB0_VBUSEN Output Pin Control</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WKUP</name>
                            <description>Wakeup Output</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RWUPE</name>
                            <description>Wakeup Detection Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>USBRST</name>
                            <description>USB Bus Reset Output</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RESUME</name>
                            <description>Resume Output</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>UACT</name>
                            <description>USB Bus Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RHST</name>
                            <description>USB Bus Reset Status</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFIFO</name>
                    <description>CFIFO Port Register</description>
                    <addressOffset>0x014</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FIFOPORT</name>
                            <description>FIFO PortRead receive data from the FIFO buffer or write transmit data to the FIFO buffer by accessing these bits.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFIFOL</name>
                    <description>CFIFO Port Register L</description>
                    <alternateRegister>CFIFO</alternateRegister>
                    <addressOffset>0x014</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>D0FIFO</name>
                    <description>D0FIFO Port Register</description>
                    <addressOffset>0x018</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FIFOPORT</name>
                            <description>FIFO PortRead receive data from the FIFO buffer or write transmit data to the FIFO buffer by accessing these bits.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>D0FIFOL</name>
                    <description>D0FIFO Port Register L</description>
                    <alternateRegister>D0FIFO</alternateRegister>
                    <addressOffset>0x018</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>D1FIFO</name>
                    <description>D1FIFO Port Register</description>
                    <addressOffset>0x01C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FIFOPORT</name>
                            <description>FIFO PortRead receive data from the FIFO buffer or write transmit data to the FIFO buffer by accessing these bits.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>D1FIFOL</name>
                    <description>D1FIFO Port Register L</description>
                    <alternateRegister>D1FIFO</alternateRegister>
                    <addressOffset>0x01C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
