amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>PIPECFG</name>
                    <description>Pipe Configuration Register</description>
                    <addressOffset>0x068</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TYPE</name>
                            <description>Transfer Type</description>
                            <lsb>14</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BFRE</name>
                            <description>BRDY Interrupt Operation Specification</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DBLB</name>
                            <description>Double Buffer Mode</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SHTNAK</name>
                            <description>Pipe Disabled at End of Transfer</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DIR</name>
                            <description>Transfer Direction</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>Endpoint NumberThese bits specify the endpoint number for the selected pipe.Setting 0000b means unused pipe. </description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PIPEMAXP</name>
                    <description>Pipe Maximum Packet Size Register </description>
                    <addressOffset>0x06C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFBF</resetMask>
                    <fields>
                        <field>
                            <name>DEVSEL</name>
                            <description>Device Select</description>
                            <lsb>12</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MXPS</name>
                            <description>Maximum Packet SizePIPE1 and PIPE2:  1 byte (001h) to 256 bytes (100h)PIPE3 to PIPE5:   8 bytes (008h), 16 bytes (010h),  32 bytes (020h), 64 bytes (040h)   (Bits [8:7] and [2:0] are not provided.)PIPE6 to PIPE9:  1 byte (001h) to 64 bytes (040h)  (Bits [8:7] are not provided.)</description>
                            <lsb>0</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PIPEPERI</name>
                    <description>Pipe Cycle Control Register</description>
                    <addressOffset>0x06E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IFIS</name>
                            <description>Isochronous IN Buffer Flush</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IITV</name>
                            <description>Interval Error Detection IntervalSpecifies the interval error detection timing for the selected pipe in terms of frames, which is expressed as nth power of 2.</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>5</dim>
                    <dimIncrement>0x002</dimIncrement>
                    <dimIndex>1-5</dimIndex>
                    <name>PIPE%sCTR</name>
                    <description>Pipe %s Control Register</description>
                    <addressOffset>0x070</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BSTS</name>
                            <description>Buffer Status</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>INBUFM</name>
                            <description>Transmit Buffer Monitor</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ATREPM</name>
                            <description>Auto Response Mode</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ACLRM</name>
                            <description>Auto Buffer Clear Mode</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SQCLR</name>
                            <description>Sequence Toggle Bit Clear</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SQSET</name>
                            <description>Sequence Toggle Bit Set</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SQMON</name>
                            <description>Sequence Toggle Bit Confirmation</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PBUSY</name>
                            <description>Pipe Busy</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Response PID</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x002</dimIncrement>
                    <dimIndex>6-9</dimIndex>
                    <name>PIPE%sCTR_1</name>
                    <description>Pipe %s Control Register</description>
                    <addressOffset>0x07A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BSTS</name>
                            <description>Buffer Status</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ACLRM</name>
                            <description>Auto Buffer Clear Mode</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SQCLR</name>
                            <description>Sequence Toggle Bit Clear</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SQSET</name>
                            <description>Sequence Toggle Bit Set</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SQMON</name>
                            <description>Sequence Toggle Bit Confirmation</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PBUSY</name>
                            <description>Pipe Busy</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PID</name>
                            <description>Response PID</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>5</dim>
                    <dimIncrement>0x004</dimIncrement>
                    <dimIndex>1-5</dimIndex>
                    <name>PIPE%sTRE</name>
                    <description>Pipe %s Transaction Counter Enable Register</description>
                    <addressOffset>0x090</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TRENB</name>
                            <description>Transaction Counter Enable</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TRCLR</name>
                            <description>Transaction Counter Clear</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>5</dim>
                    <dimIncrement>0x004</dimIncrement>
                    <dimIndex>1-5</dimIndex>
                    <name>PIPE%sTRN</name>
                    <description>Pipe %s Transaction Counter Register</description>
                    <addressOffset>0x092</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TRNCNT</name>
                            <description>Transaction Counter</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>6</dim>
                    <dimIncrement>0x002</dimIncrement>
                    <dimIndex>0-5</dimIndex>
                    <name>DEVADD%s</name>
                    <description>Device Address %s Configuration Register</description>
                    <addressOffset>0x0D0</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>USBSPD</name>
                            <description>Transfer Speed of Communication Target Device</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PHYSLEW</name>
                    <description>PHY Cross Point Adjustment Register </description>
                    <addressOffset>0x0F0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000000E</resetValue>
                    <resetMask>0xFF4CFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SLEWF01</name>
                            <description>Receiver Cross Point Adjustment 01</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SLEWF00</name>
                            <description>Receiver Cross Point Adjustment 00</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SLEWR01</name>
                            <description>Receiver Cross Point Adjustment 01</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SLEWR00</name>
                            <description>Receiver Cross Point Adjustment 00</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPUSR0R</name>
                    <description>Deep Software Standby USB Transceiver Control/Pin Monitor Register</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFF4CFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DVBSTS0</name>
                            <description>USB VBUS InputIndicates the VBUS input signal of the USB.</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DOVCB0</name>
                            <description>USB OVRCURB InputIndicates the OVRCURB input signal of the USB.</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DOVCA0</name>
                            <description>USB OVRCURA InputIndicates the OVRCURA input signal of the USB.</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DM0</name>
                            <description>USB D,InputIndicates the D- input signal of the USB.</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DP0</name>
                            <description>USB0 D+ InputIndicates the D+ input signal of the USB.</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FIXPHY0</name>
                            <description>USB Transceiver Output Fix</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DRPD0</name>
                            <description>D+/D- Pull,Down Resistor Control</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RPUE0</name>
                            <description>DP Pull,Up Resistor Control</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SRPC0</name>
                            <description>USB Single End Receiver Control</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
