amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>DPUSR1R</name>
                    <description>Deep Software Standby USB Suspend/Resume Interrupt Register</description>
                    <addressOffset>0x404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DVBINT0</name>
                            <description>USB VBUS Interrupt Source Recovery</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOVRCRB0</name>
                            <description>USB OVRCURB Interrupt Source Recovery</description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOVRCRA0</name>
                            <description>USB OVRCURA Interrupt Source Recovery</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DMINT0</name>
                            <description>USB DM Interrupt Source Recovery</description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DPINT0</name>
                            <description>USB DP Interrupt Source Recovery</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DVBSE0</name>
                            <description>USB VBUS Interrupt Enable/Clear</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOVRCRBE0</name>
                            <description>USB OVRCURB Interrupt Enable/Clear</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOVRCRAE0</name>
                            <description>USB OVRCURA Interrupt Enable/Clear</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DMINTE0</name>
                            <description>USB DM Interrupt Enable/Clear</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DPINTE0</name>
                            <description>USB DP Interrupt Enable/Clear</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>SRCRAM</name>
            <description>Sampling Rate Converter RAM</description>
            <baseAddress>0x40048000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>22208</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>5552</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-5551</dimIndex>
                    <name>SRCFCTR[%s]</name>
                    <description>Filter Coefficient Table [%s]</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFC00000</resetMask>
                    <fields>
                        <field>
                            <name>SRCFCOE</name>
                            <description>Stores a filter coefficient value.</description>
                            <lsb>0</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
