amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>NMISR</name>
                    <description>Non,Maskable Interrupt Status Register</description>
                    <addressOffset>0x140</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SPEST</name>
                            <description>MPU Stack Error Interrupt Status Flag</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSMST</name>
                            <description>MPU Bus Master Error Interrupt Status Flag</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSSST</name>
                            <description>MPU Bus Slave Error Interrupt Status Flag</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RECCST</name>
                            <description>RAM ECC Error Interrupt Status Flag</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RPEST</name>
                            <description>RAM Parity Error Interrupt Status Flag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NMIST</name>
                            <description>NMI Status Flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OSTST</name>
                            <description>Oscillation Stop Detection Interrupt Status Flag</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD2ST</name>
                            <description>Voltage,Monitoring 2 Interrupt Status Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD1ST</name>
                            <description>Voltage,Monitoring 1 Interrupt Status Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WDTST</name>
                            <description>WDT Underflow/Refresh Error Status Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IWDTST</name>
                            <description>IWDT Underflow/Refresh Error Status Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NMIER</name>
                    <description>Non,Maskable Interrupt Enable Register</description>
                    <addressOffset>0x120</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SPEEN</name>
                            <description>MPU Stack Error Interrupt Enable</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSMEN</name>
                            <description>MPU Bus Master Error Interrupt Enable</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSSEN</name>
                            <description>MPU Bus Slave Error Interrupt Enable</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RECCEN</name>
                            <description>RAM ECC Error Interrupt Enable</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RPEEN</name>
                            <description>RAM Parity Error Interrupt Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NMIEN</name>
                            <description>NMI Pin Interrupt Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OSTEN</name>
                            <description>Oscillation Stop Detection Interrupt Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD2EN</name>
                            <description>Voltage,Monitoring 2 Interrupt Enable</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD1EN</name>
                            <description>Voltage,Monitoring 1 Interrupt Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WDTEN</name>
                            <description>WDT Underflow/Refresh Error Interrupt Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IWDTEN</name>
                            <description>IWDT Underflow/Refresh Error Interrupt Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NMICLR</name>
                    <description>Non,Maskable Interrupt Status Clear Register</description>
                    <addressOffset>0x130</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SPECLR</name>
                            <description>SPEST Clear</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSMCLR</name>
                            <description>BUSMST Clear</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BUSSCLR</name>
                            <description>BUSSST Clear</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RECCCLR</name>
                            <description>RECCST Clear</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RPECLR</name>
                            <description>RPEST Clear</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NMICLR</name>
                            <description>NMIST Clear</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OSTCLR</name>
                            <description>OSTST Clear</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD2CLR</name>
                            <description>LVD2ST Clear</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD1CLR</name>
                            <description>LVD1ST Clear</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WDTCLR</name>
                            <description>WDTST Clear</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IWDTCLR</name>
                            <description>IWDTST Clear</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NMICR</name>
                    <description>NMI Pin Interrupt Control Register</description>
                    <addressOffset>0x100</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>NFLTEN</name>
                            <description>NMI Digital Filter Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NFCLKSEL</name>
                            <description>NMI Digital Filter Sampling Clock</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NMIMD</name>
                            <description>NMI Detection Set</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>96</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-95</dimIndex>
                    <name>IELSR%s</name>
                    <description>INT Event Link Setting Register %s</description>
                    <addressOffset>0x300</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DTCE</name>
                            <description>DTC Activation Enable</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IR</name>
                            <description>Interrupt Status Flag</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IELS</name>
                            <description>Event selection to NVIC</description>
                            <lsb>0</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>DELSR%s</name>
                    <description>DMAC Event Link Setting Register %s</description>
                    <addressOffset>0x280</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IR</name>
                            <description>Interrupt Status Flag for DMAC</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DELS</name>
                            <description>DMAC Event Link Select</description>
                            <lsb>0</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SELSR0</name>
                    <description>SYS Event Link Setting Register</description>
                    <addressOffset>0x200</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SELS</name>
                            <description>SYS Event Link Select</description>
                            <lsb>0</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
