amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>GPT_ODC</name>
            <description>PWM Delay Generation Circuit</description>
            <baseAddress>0x4007B000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x18</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1A</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x28</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x28</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2A</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>GTDLYCR</name>
                    <description>PWM Output Delay Control Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DLYRST</name>
                            <description>PWM Delay Generation Circuit Reset</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLLEN</name>
                            <description>DLL Operation Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GTDLYCR2</name>
                    <description>PWM Output Delay Control Register2</description>
                    <addressOffset>0x02</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DLYEN3</name>
                            <description>PWM Delay Generation Circuit enable for channel 3</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLYEN2</name>
                            <description>PWM Delay Generation Circuit enable for channel 2</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLYEN1</name>
                            <description>PWM Delay Generation Circuit enable for channel 1</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLYEN0</name>
                            <description>PWM Delay Generation Circuit enable for channel 0</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLYBS3</name>
                            <description>PWM Delay Generation Circuit bypass for channel 3</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLYBS2</name>
                            <description>PWM Delay Generation Circuit bypass for channel 2</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLYBS1</name>
                            <description>PWM Delay Generation Circuit bypass for channel 1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DLYBS0</name>
                            <description>PWM Delay Generation Circuit bypass for channel 0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>GTDLYR%sA</name>
                    <description>GTIOC%sA Rising Output Delay Register</description>
                    <alternateRegister>GTDLYR%s</alternateRegister>
                    <addressOffset>0x18</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DLY</name>
                            <description>GTIOCnA Output Rising Edge Delay Setting</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>GTDLYR%sB</name>
                    <description>GTIOC%sB Rising Output Delay Register</description>
                    <alternateRegister>GTDLYR%s</alternateRegister>
                    <addressOffset>0x1A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DLY</name>
                            <description>GTIOCnB Output Rising Edge Delay Setting</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>GTDLYF%sA</name>
                    <description>GTIOC%sA Falling Output Delay Register</description>
                    <alternateRegister>GTDLYF%s</alternateRegister>
                    <addressOffset>0x28</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DLY</name>
                            <description>GTIOCnA Output Falling Edge Delay Setting</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-3</dimIndex>
                    <name>GTDLYF%sB</name>
                    <description>GTIOC%sB Falling Output Delay Register</description>
                    <alternateRegister>GTDLYF%s</alternateRegister>
                    <addressOffset>0x2A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DLY</name>
                            <description>GTIOCnB Output Falling Edge Delay Setting</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
