amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>AGT0</name>
            <description>Asynchronous General purpose Timer 0</description>
            <baseAddress>0x40084000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>6</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0C</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>AGT</name>
                    <description>AGT Counter Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AGT</name>
                            <description>16bit counter and reload registerNOTE : When 1 is written to the TSTOP bit in the AGTCRn register, the 16-bit counter is forcibly stopped and set to FFFFH.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AGTCMA</name>
                    <description>AGT Compare Match A Register</description>
                    <addressOffset>0x02</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AGTCMA</name>
                            <description>AGT Compare Match A RegisterNOTE : When 1 is written to the TSTOP bit in the AGTCRn register, set to FFFFH</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AGTCMB</name>
                    <description>AGT Compare Match B Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>AGTCMB</name>
                            <description>AGT Compare Match B RegisterNOTE : When 1 is written to the TSTOP bit in the AGTCR register, set to FFFFH</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AGTCR</name>
                    <description>AGT Control Register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TCMBF</name>
                            <description>AGT compare match B flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TCMAF</name>
                            <description>AGT compare match A flag</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TUNDF</name>
                            <description>AGT underflow flag</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEDGF</name>
                            <description>Active edge judgement flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TSTOP</name>
                            <description>AGT count forced stop</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TCSTF</name>
                            <description>AGT count status flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TSTART</name>
                            <description>AGT count start</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AGTMR1</name>
                    <description>AGT Mode Register 1</description>
                    <addressOffset>0x09</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TCK</name>
                            <description>AGT count source select</description>
                            <lsb>4</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEDGPL</name>
                            <description>AGTIO edge polarity select</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TMOD</name>
                            <description>AGT operating mode select</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AGTMR2</name>
                    <description>AGT Mode Register 2</description>
                    <addressOffset>0x0A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LPM</name>
                            <description>AGT Low Power Mode</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CKS</name>
                            <description>fsub/LOCO count source clock frequency division ratio select</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AGTIOC</name>
                    <description>AGT I/O Control Register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TIOGT</name>
                            <description>AGTIO count control</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TIPF</name>
                            <description>AGTIO input filter select</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TOE</name>
                            <description>AGTO output enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TEDGSEL</name>
                            <description>I/O polarity switchFunction varies depending on the operating mode. </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AGTISR</name>
                    <description>AGT Event Pin Select Register</description>
                    <addressOffset>0x0D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>EEPS</name>
                            <description>AGTEE  polarty selection</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AGTCMSR</name>
                    <description>AGT Compare Match Function Select Register</description>
                    <addressOffset>0x0E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TOPOLB</name>
                            <description>AGTOB polarity select</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TOEB</name>
                            <description>AGTOB output enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TCMEB</name>
                            <description>Compare match B register enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TOPOLA</name>
                            <description>AGTOA polarity select</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TOEA</name>
                            <description>AGTOA output enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TCMEA</name>
                            <description>Compare match A register enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AGTIOSEL</name>
                    <description>AGT Pin Select Register</description>
                    <addressOffset>0x0F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TIES</name>
                            <description>AGTIO input enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SEL</name>
                            <description>AGTIO pin select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
