amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="AGT0">
            <name>AGT1</name>
            <description>Asynchronous General purpose Timer 1</description>
            <baseAddress>0x40084100</baseAddress>
        </peripheral>
        <peripheral>
            <name>FCACHE</name>
            <description>Flash Cache</description>
            <baseAddress>0x4001C000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x30</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x32</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x104</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x11C</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x120</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x124</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x127</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x130</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x138</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>FCACHEE</name>
                    <description>Flash Cache Enable Register</description>
                    <addressOffset>0x100</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FCACHEEN</name>
                            <description>FCACHE Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCACHEIV</name>
                    <description>Flash Cache Invalidate Register</description>
                    <addressOffset>0x104</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FCACHEIV</name>
                            <description>FCACHE Invalidation</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>oneToSet</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLWT</name>
                    <description>Flash Wait Cycle Register</description>
                    <addressOffset>0x11C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FLWT</name>
                            <description>Flash Wait Cycle</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>BUS</name>
            <description>BUS Control</description>
            <baseAddress>0x40003000</baseAddress>
            <addressBlock>
                <offset>0x802</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x812</offset>
                <size>112</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x80A</offset>
                <size>128</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x880</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x02</offset>
                <size>128</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>128</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>128</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC00</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC10</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC14</offset>
                <size>3</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC20</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC24</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC40</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC44</offset>
                <size>6</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC50</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1800</offset>
                <size>176</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1804</offset>
                <size>176</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1000</offset>
                <size>10</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100C</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1010</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1100</offset>
                <size>10</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x110C</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1128</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CS0CR</name>
                    <description>CS0 Control Register</description>
                    <addressOffset>0x0802</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0021</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MPXEN</name>
                            <description>Address/Data Multiplexed I/O Interface Select</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EMODE</name>
                            <description>Endian Mode</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BSIZE</name>
                            <description>External Bus Width Select</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EXENB</name>
                            <description>Operation Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>7</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>1-7</dimIndex>
                    <name>CS%sCR</name>
                    <description>CS%s Control Register</description>
                    <addressOffset>0x0812</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MPXEN</name>
                            <description>Address/Data Multiplexed I/O Interface Select</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EMODE</name>
                            <description>Endian Mode</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BSIZE</name>
                            <description>External Bus Width Select</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EXENB</name>
                            <description>Operation Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>8</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>0-7</dimIndex>
                    <name>CS%sREC</name>
                    <description>CS%s Recovery Cycle Register</description>
                    <addressOffset>0x080A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WRCV</name>
                            <description>Write Recovery</description>
                            <lsb>8</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RRCV</name>
                            <description>Read Recovery</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSRECEN</name>
                    <description>CS Recovery Cycle Insertion Enable Register</description>
                    <addressOffset>0x0880</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x3E3E</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RCVENM7</name>
                            <description>Multiplexed Bus Recovery Cycle Insertion Enable 7</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RCVENM6</name>
                            <description>Multiplexed Bus Recovery Cycle Insertion Enable 6</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RCVENM5</name>
                            <description>Multiplexed Bus Recovery Cycle Insertion Enable 5</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RCVENM4</name>
                            <description>Multiplexed Bus Recovery Cycle Insertion Enable 4</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RCVENM3</name>
                            <description>Multiplexed Bus Recovery Cycle Insertion Enable 3</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RCVENM2</name>
                            <description>Multiplexed Bus Recovery Cycle Insertion Enable 2</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RCVENM1</name>
                            <description>Multiplexed Bus Recovery Cycle Insertion Enable 1</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RCVENM0</name>
                            <description>Multiplexed Bus Recovery Cycle Insertion Enable 0</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RCVEN7</name>
                            <description>Separate Bus Recovery Cycle Insertion Enable 7</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RCVEN6</name>
                            <description>Separate Bus Recovery Cycle Insertion Enable 6</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RCVEN5</name>
                            <description>Separate Bus Recovery Cycle Insertion Enable 5</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RCVEN4</name>
                            <description>Separate Bus Recovery Cycle Insertion Enable 4</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RCVEN3</name>
                            <description>Separate Bus Recovery Cycle Insertion Enable 3</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RCVEN2</name>
                            <description>Separate Bus Recovery Cycle Insertion Enable 2</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RCVEN1</name>
                            <description>Separate Bus Recovery Cycle Insertion Enable 1</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RCVEN0</name>
                            <description>Separate Bus Recovery Cycle Insertion Enable 0</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
