amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>SDSR</name>
                    <description>SDRAM Status Register</description>
                    <addressOffset>0x0C50</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SRFST</name>
                            <description>Self,Refresh Transition/Recovery Status</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>INIST</name>
                            <description>Initialization Status</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MRSST</name>
                            <description>Mode Register Setting Status</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>11</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>1-11</dimIndex>
                    <name>BUS%sERRADD</name>
                    <description>Bus Error Address Register %s</description>
                    <addressOffset>0x1800</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>BERAD</name>
                            <description>Bus Error AddressWhen a bus error occurs, It stores an error address.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>11</dim>
                    <dimIncrement>0x10</dimIncrement>
                    <dimIndex>1-11</dimIndex>
                    <name>BUS%sERRSTAT</name>
                    <description>Bus Error Status Register %s</description>
                    <addressOffset>0x1804</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFE</resetMask>
                    <fields>
                        <field>
                            <name>ERRSTAT</name>
                            <description>Bus Error StatusWhen bus error assert, error flag occurs.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ACCSTAT</name>
                            <description>Error access statusThe status at the time of the error</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>M4I,M4D</dimIndex>
                    <name>BUSMCNT%s</name>
                    <description>Master Bus Control Register %s</description>
                    <addressOffset>0x1000</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IERES</name>
                            <description>Ignore Error Responses</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUSMCNTSYS</name>
                    <description>Master Bus Control Register SYS</description>
                    <addressOffset>0x1008</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IERES</name>
                            <description>Ignore Error Responses</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUSMCNTDMA</name>
                    <description>Master Bus Control Register DMA</description>
                    <addressOffset>0x100C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IERES</name>
                            <description>Ignore Error Responses</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>EDM,GPX</dimIndex>
                    <name>BUSMCNT%s_1</name>
                    <description>Master Bus Control Register %s</description>
                    <addressOffset>0x1010</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>IERES</name>
                            <description>Ignore Error Responses</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>FLI,RAMH</dimIndex>
                    <name>BUSSCNT%s</name>
                    <description>Slave Bus Control Register %s</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EWRES</name>
                            <description>Early Write ResponseWhether the next write request is accepted or not until a response for the write transaction comes back. </description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ARBMET</name>
                            <description>Arbitration MethodSpecify the priority between groups</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BUSSCNTMBIU</name>
                    <description>Slave Bus Control Register MBIU</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EWRES</name>
                            <description>Early Write ResponseWhether the next write request is accepted or not until a response for the write transaction comes back. </description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ARBMET</name>
                            <description>Arbitration MethodSpecify the priority between groups</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>RAM0,RAM1</dimIndex>
                    <name>BUSSCNT%s_1</name>
                    <description>Slave Bus Control Register %s</description>
                    <addressOffset>0x110C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EWRES</name>
                            <description>Early Write ResponseWhether the next write request is accepted or not until a response for the write transaction comes back. </description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ARBMET</name>
                            <description>Arbitration MethodSpecify the priority between groups</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>P0B,P2B,P3B,P4B</dimIndex>
                    <name>BUSSCNT%s_2</name>
                    <description>Slave Bus Control Register %s</description>
                    <addressOffset>0x1114</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EWRES</name>
                            <description>Early Write ResponseWhether the next write request is accepted or not until a response for the write transaction comes back. </description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ARBMET</name>
                            <description>Arbitration MethodSpecify the priority between groups</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>P6B,P7B</dimIndex>
                    <name>BUSSCNT%s_3</name>
                    <description>Slave Bus Control Register %s</description>
                    <addressOffset>0x1128</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EWRES</name>
                            <description>Early Write ResponseWhether the next write request is accepted or not until a response for the write transaction comes back. </description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ARBMET</name>
                            <description>Arbitration MethodSpecify the priority between groups</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>FBU,EXT,EXT2,GPX</dimIndex>
                    <name>BUSSCNT%s_4</name>
                    <description>Slave Bus Control Register %s</description>
                    <addressOffset>0x1130</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EWRES</name>
                            <description>Early Write ResponseWhether the next write request is accepted or not until a response for the write transaction comes back. </description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ARBMET</name>
                            <description>Arbitration MethodSpecify the priority between groups</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
