amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>DAC12</name>
            <description>12-bit D/A converter</description>
            <baseAddress>0x4005E000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>7</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x101C</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x2</dimIncrement>
                    <dimIndex>0,1</dimIndex>
                    <name>DADR%s</name>
                    <description>D/A Data Register %s</description>
                    <addressOffset>0x00</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DADR</name>
                            <description>D/A Data RegisterNOTE: When DADPR.DPSEL = 0, the high,order 4 bits are fixed to 0: right justified format. When DADPR.DPSEL = 1, the low,order 4 bits are fixed to 0: left justified format.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DACR</name>
                    <description>D/A Control Register </description>
                    <addressOffset>0x0004</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1F</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DAOE1</name>
                            <description>D/A Output Enable 1</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DAOE0</name>
                            <description>D/A Output Enable 0</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DAE</name>
                            <description>D/A Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DADPR</name>
                    <description>DADRm  Format Select Register </description>
                    <addressOffset>0x0005</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DPSEL</name>
                            <description>DADRm Format Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAADSCR</name>
                    <description>D/A,A/D Synchronous Start Control Register </description>
                    <addressOffset>0x0006</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DAADST</name>
                            <description>D/A,A/D Synchronous Conversion</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAAMPCR</name>
                    <description>D/A Output Amplifier Control Register </description>
                    <addressOffset>0x0008</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DAAMP1</name>
                            <description>Amplifier Control 1</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DAAMP0</name>
                            <description>Amplifier Control 0</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAASWCR</name>
                    <description>D/A Amplifier Stabilization Wait Control Register</description>
                    <addressOffset>0x101C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DAASW1</name>
                            <description>D/A Amplifier Stabilization Wait 1</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DAASW0</name>
                            <description>D/A Amplifier Stabilization Wait 0</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
