amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>AMI</name>
            <description>ADC,DAC Interface</description>
            <baseAddress>0x4005F000</baseAddress>
            <addressBlock>
                <offset>0xC0</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DAADUSR</name>
                    <description>D/A A/D Synchronous Unit Select Register </description>
                    <addressOffset>0xC0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>AMADSEL1</name>
                            <description>A/D Unit 1 Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>JPEG</name>
            <description>JPEG Codec</description>
            <baseAddress>0x400E6000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x03</offset>
                <size>15</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x58</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8C</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>JCMOD</name>
                    <description> JPEG Code Mode Register</description>
                    <addressOffset>0x000</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DSP</name>
                            <description>Compression/Decompression Set Note: When changing between processing for compression and for decompression, be sure to reset this module in advance by setting the JCUSRST bit in the software reset control register 2 (SWRSTCR2) of the power,downmodes.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>REDU</name>
                            <description>Pixel FormatNOTE: Read,only in Decompression.</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JCCMD</name>
                    <description>JPEG Code Command Register</description>
                    <addressOffset>0x001</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>BRST</name>
                            <description>Bus Reset. NOTE: When this module is in operation, the bus reset command should not be issued.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>JEND</name>
                            <description>Interrupt Request Clear Command This bit is valid only for the interrupt sources corresponding to bits INS6, INS5, and INS3 in JINTS0. To clear an interrupt request, set this bit to 1</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>JRST</name>
                            <description>JPEG Core Process Stop Clear CommandTo clear the process,stopped state caused by requests to read the image size and pixel format (enabled by the INT3 bit in JINTE0), set this bit to 1.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>JSRT</name>
                            <description>JPEG Core Process Start CommandTo start JPEG core processing, set this bit to 1. Do not write this bit to 1 again while this module is in operation.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JCQTN</name>
                    <description>JPEG Code Quantization Table Number Register</description>
                    <addressOffset>0x003</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>QT3</name>
                            <description>Quantization table number for the third color component NOTE: Read,only in Decompression.</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>QT2</name>
                            <description>Quantization table number for the second color component NOTE: Read,only in Decompression.</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>QT1</name>
                            <description>Quantization table number for the first color componentNOTE: Read,only in Decompression.</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JCHTN</name>
                    <description>JPEG Code Huffman Table Number Register</description>
                    <addressOffset>0x004</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>HTA3</name>
                            <description>Huffman table number (AC) for the third color componentNOTE: Read,only in Decompression.</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HTD3</name>
                            <description>Huffman table number (DC) for the third color component NOTE: Read,only in Decompression.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HTA2</name>
                            <description>Huffman table number (AC) for the second color componentNOTE: Read,only in Decompression.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HTD2</name>
                            <description>Huffman table number (DC) for the second color component NOTE: Read,only in Decompression.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HTA1</name>
                            <description>Huffman table number (AC) for the first color componentNOTE: Read,only in Decompression.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HTD1</name>
                            <description>Huffman table number (DC) for the first color component NOTE: Read,only in Decompression.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JCDRIU</name>
                    <description>JPEG Code DRI Upper Register</description>
                    <addressOffset>0x005</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DRIU</name>
                            <description>Upper Bytes of MCUs Preceding RST MarkerWhen both upper and lower bytes are set to 00h, neither a DRI nor an RST marker is placed.NOTE: Read,only in Decompression.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JCDRID</name>
                    <description>JPEG Code DRI Lower Register</description>
                    <addressOffset>0x006</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DRID</name>
                            <description>Lower Bytes of MCUs Preceding RST MarkerWhen both upper and lower bytes are set to 00h, neither a DRI nor an RST marker is placed.NOTE: Read,only in Decompression.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JCVSZU</name>
                    <description>JPEG Code Vertical Size Upper Register</description>
                    <addressOffset>0x007</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>VSZU</name>
                            <description>Upper Bytes of Vertical Image SizeIn decompression process, a downloaded value from the JPEG coded data is set. NOTE: Read,only in Decompression.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JCVSZD</name>
                    <description>JPEG Code Vertical Size Lower Register</description>
                    <addressOffset>0x008</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>VSZD</name>
                            <description>Lower Bytes of Vertical Image SizeIn decompression process, a downloaded value from the JPEG coded data is set. NOTE: Read,only in Decompression.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JCHSZU</name>
                    <description>JPEG Code Horizontal Size Upper Register </description>
                    <addressOffset>0x009</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>HSZU</name>
                            <description>Upper Bytes of Horizontal Image SizeIn decompression process, a downloaded value from the JPEG coded data is set. NOTE: Read,only in Decompression.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JCHSZD</name>
                    <description>JPEG Coded Horizontal Size Lower Register</description>
                    <addressOffset>0x00A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>HSZD</name>
                            <description>Lower Bytes of Horizontal Image SizeIn decompression process, a downloaded value from the JPEG coded data is set. NOTE: Read,only in Decompression.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JCDTCU</name>
                    <description>JPEG Code Data Count Upper Register</description>
                    <addressOffset>0x00B</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DCU</name>
                            <description>Upper bytes of the counted amount of data to be compressed The values of this register are reset before compression starts.NOTE: Read,only in Decompression.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JCDTCM</name>
                    <description>JPEG Code Data Count Middle Register</description>
                    <addressOffset>0x00C</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DCM</name>
                            <description>Middle bytes of the counted amount of data to be compressedThe values of this register are reset before compression starts. NOTE: Read,only in Decompression.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JCDTCD</name>
                    <description>JPEG Code Data Count Lower Register</description>
                    <addressOffset>0x00D</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>DCD</name>
                            <description> Lower bytes of the counted amount of data to be compressedThe values of this register are reset before compression starts.NOTE: Read,only in Decompression.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JINTE0</name>
                    <description>JPEG Interrupt Enable Register 0</description>
                    <addressOffset>0x00E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>INT7</name>
                            <description>This bit enables an interrupt to be generated when the number of data in the restart interval of the Huffman,coding segment is not correct in decompression.When this bit is not set to enable interrupt generation, an error code is not returned.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>INT6</name>
                            <description>This bit enables an interrupt to be generated when the total number of data in the Huffman,coding segment is not correct in decompression. When this bit is not set to enable interrupt generation, an error code is not returned.</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>INT5</name>
                            <description>This bit enables an interrupt to be generated when the final number of MCU data in the Huffman,coding segment is not correct in decompression. When this bit is not set to enable interrupt generation, an error code is not returned.</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>INT3</name>
                            <description>This bit enables an interrupt to be generated when it has been determined that the image size and the subsampling setting of the compressed data can be read through analyzing the data. </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
