amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>JINTS0</name>
                    <description>JPEG Interrupt Status Register 0 </description>
                    <addressOffset>0x00F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>INS6</name>
                            <description>This bit is set to 1 when this module completes compression process normally.</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                        </field>
                        <field>
                            <name>INS5</name>
                            <description>This bit is set to 1 when a compressed data error occurs.</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                        </field>
                        <field>
                            <name>INS3</name>
                            <description> This bit is set to 1 when the image size and pixel format can be read. When an interrupt occurs, this module stops processing and the state is indicated by the JCRST register. To make this module resume processing, set the JPEG core process stop clear command bit (JRST) in JCCMD. </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JCDERR</name>
                    <description>JPEG Code Decode Error Register</description>
                    <addressOffset>0x010</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0A</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ERR</name>
                            <description>Error Code  (See tables )Identify the type of the error which has occurred in the compressed data analysis for decompression.</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JCRST</name>
                    <description>JPEG Code Reset Register</description>
                    <addressOffset>0x011</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RST</name>
                            <description>Operating State</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JIFECNT</name>
                    <description>JPEG Interface Compression Control Register</description>
                    <addressOffset>0x040</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>JOUTSWAP</name>
                            <description>Byte/Halfword/Word Swap Output coded data in compression is swapped.</description>
                            <lsb>8</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DINRINI</name>
                            <description>Address Initialization when Resuming Input of Image Data Lines This bit is only valid when the count mode for stopping the input of image data lines is on. Set this bit before writing 1 to the data,line resume command bit. </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DINRCMD</name>
                            <description>Input Image Data Lines Resume Command This bit is valid only when the count mode for stopping the input of image data lines is on. Setting this bit to 1 resumes reading input image data. This bit is always read as 0. </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DINLC</name>
                            <description> Count Mode Setting for Stopping Input Image Data Lines </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DINSWAP</name>
                            <description> Byte/Halfword Swap </description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JIFESA</name>
                    <description>JPEG Interface Compression Source Address Register</description>
                    <addressOffset>0x044</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ESA</name>
                            <description> Input Image Data Source Address (in 8-byte units) The lower three bits should be set to 0.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JIFESOFST</name>
                    <description>JPEG Interface Compression Line Offset Register</description>
                    <addressOffset>0x048</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ESMW</name>
                            <description>Input Image Data Lines Offset(in 8-byte units)The lower three bits should be set to 0.</description>
                            <lsb>0</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JIFEDA</name>
                    <description>JPEG Interface Compression Destination Address Register</description>
                    <addressOffset>0x04C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EDA</name>
                            <description>Input Image Data Lines Offset (in 8-byte units) The lower three bits should be set to 0.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JIFESLC</name>
                    <description>JPEG Interface Compression Source Line Count Register</description>
                    <addressOffset>0x050</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFF8FFF8</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LINES</name>
                            <description>Number of Input Image Data Lines to be Read (in 8-line units) The lower three bits should be set to 0. </description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JIFDCNT</name>
                    <description>JPEG Interface Decompression Control Register </description>
                    <addressOffset>0x058</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x01000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VINTER</name>
                            <description>Vertical SubsamplingSubsamples vertical output image data. </description>
                            <lsb>28</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HINTER</name>
                            <description>Horizontal Subsampling Subsamples horizontal output image data.</description>
                            <lsb>26</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OPF</name>
                            <description>Specifies output image data pixel format.</description>
                            <lsb>24</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>JINRINI</name>
                            <description>Address Initialization when Input Coded Data is Resumed This bit is only valid when the count mode for stopping the input of coded data is on. Set this bit before writing 1 to the data resume command bit. </description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>JINRCMD</name>
                            <description>Input Coded Data Resume CommandThis bit is valid only when the count mode for stopping the input of coded data is on. Setting this bit to 1 resumes reading input coded data. This bit is always read as 0.</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>JINC</name>
                            <description>Count Mode Setting for Stopping Input Coded Data </description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>JINSWAP</name>
                            <description>Byte/Word/Longword Swap Input coded data in decompression is swapped. </description>
                            <lsb>8</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUTRINI</name>
                            <description>Address Initialization when Resuming Output of Image Data Lines This bit is only valid when the count mode for stopping the output of image data lines is on. Set this bit before writing 1 to the data,line resume command bit. </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUTRCMD</name>
                            <description>Output Image Data Lines Resume Command This bit is valid only when the count mode for stopping the output of image data lines is on. Setting this bit to 1 resumes writing image data. This bit is always read as 0. </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>DOUTLC</name>
                            <description>Count Mode for Stopping Output Image Data Lines</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUTSWAP</name>
                            <description>Byte/Word Swap Output image data in decompression is swapped. </description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JIFDSA</name>
                    <description>JPEG Interface Decompression Source Address Register</description>
                    <addressOffset>0x05C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DSA</name>
                            <description>Input Coded Data Source AddressInput Coded Data Source Address (in 8-byte units) The lower three bits should be set to 0. </description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JIFDDOFST</name>
                    <description>JPEG Interface Decompression Line Offset Register</description>
                    <addressOffset>0x060</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DDMW</name>
                            <description>Output Image Data Lines Offset (in 8-byte units) The lower three bits should be set to 0. </description>
                            <lsb>0</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JIFDDA</name>
                    <description>JPEG Interface Decompression Destination Address Register</description>
                    <addressOffset>0x064</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DDA</name>
                            <description>Output Image Data Destination Address (in 8-byte units) The lower three bits should be set to 0. </description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JIFDSDC</name>
                    <description>JPEG Interface Decompression Source Data Count Register</description>
                    <addressOffset>0x068</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFF8FFF8</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>JDATAS</name>
                            <description> Amount of Input Coded Data to be Read (in 8-byte units) The lower three bits should be set to 0. </description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JIFDDLC</name>
                    <description>JPEG Interface Decompression Destination Line Count Register</description>
                    <addressOffset>0x06C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFF8FFF8</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LINES</name>
                            <description>Number of Input Image Lines to Be ReadThe lower three bits should be set to 0. These bits are read as0.Number of input image data lines to be read, in 8-line units.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JIFDADT</name>
                    <description>JPEG Interface Decompression alpha Set Register </description>
                    <addressOffset>0x070</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ALPHA</name>
                            <description>Setting of the alpha value for output in ARGB8888 format.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
