amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>JINTE1</name>
                    <description>JPEG Interrupt Enable Register 1</description>
                    <addressOffset>0x08C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CBTEN</name>
                            <description> Enables or disables a data transfer processing interrupt request (JDTI) when the CBTF bit in JINTS1 is set to 1. </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DINLEN</name>
                            <description> Enables or disables a data transfer processing interrupt request (JDTI) when the DINLF bit in JINTS1 is set to 1.</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DBTEN</name>
                            <description>Enables or disables a data transfer processing interrupt request (JDTI) when the DBTF bit in JINTS1 is set to 1.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>JINEN</name>
                            <description>Enables or disables a data transfer processing interrupt request (JDTI) when the JINF bit in JINTS1 is set to 1.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUTLEN</name>
                            <description>Enables or disables a data transfer processing interrupt request (JDTI) when the DOUTLF bit in JINTS1 is set to 1</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>JINTS1</name>
                    <description>JPEG Interrupt Status Register 1</description>
                    <addressOffset>0x090</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CBTF</name>
                            <description> This bit is set to 1 when the last output coded data is written in compression.</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                        <field>
                            <name>DINLF</name>
                            <description>This bit is set to 1 when the number of input image data lines indicated by JIFESLC is read in compression.  This bit is valid only when the DINLC bit in JIFECNT is set to 1. </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                        <field>
                            <name>DBTF</name>
                            <description> This bit is set to 1 when the last output image data is written in decompression. </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                        <field>
                            <name>JINF</name>
                            <description> This bit is set to 1 when the amount of input coded data indicated by JIFDSDC is read in decompression.  This bit is valid only when the JINC bit in JIFDCNT is set to 1.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                        <field>
                            <name>DOUTLF</name>
                            <description>In decompression, this bit is set to 1 when the number of lines of output image data indicated by JIFDDLC have been written. This bit is only valid when the DOUTLC bit in JIFDCNT is set to 1. </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <readAction>modify</readAction>
                        </field>
                    </fields>
                </register>
