amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>POEG</name>
            <description>Port Output Enable Module for GPT</description>
            <baseAddress>0x40042000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1024</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>4</dim>
                    <dimIncrement>0x100</dimIncrement>
                    <dimIndex>A,B,C,D</dimIndex>
                    <name>POEGG%s</name>
                    <description>POEG Group %s Setting Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>NFCS</name>
                            <description>Noise Filter Clock Select</description>
                            <lsb>30</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>NFEN</name>
                            <description>Noise Filter Enable</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>INV</name>
                            <description>GTETRG Input Reverse</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ST</name>
                            <description>GTETRG Input Status Flag</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CDRE5</name>
                            <description>Comparator Disable Request Enable 5Note: Can be modified only once after a reset.</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CDRE4</name>
                            <description>Comparator Disable Request Enable 4Note: Can be modified only once after a reset.</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CDRE3</name>
                            <description>Comparator Disable Request Enable 3Note: Can be modified only once after a reset.</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CDRE2</name>
                            <description>Comparator Disable Request Enable 2Note: Can be modified only once after a reset.</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CDRE1</name>
                            <description>Comparator Disable Request Enable 1Note: Can be modified only once after a reset.</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CDRE0</name>
                            <description>Comparator Disable Request Enable 0Note: Can be modified only once after a reset.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OSTPE</name>
                            <description>Oscillation Stop Detection EnableNote: Can be modified only once after a reset.</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IOCE</name>
                            <description>Enable for GPT Output,Disable RequestNote: Can be modified only once after a reset.</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PIDE</name>
                            <description>Port Input Detection EnableNote: Can be modified only once after a reset.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SSF</name>
                            <description>Software Stop Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OSTPF</name>
                            <description>Oscillation Stop Detection Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>IOCF</name>
                            <description>Real Time Overcurrent Detection Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PIDF</name>
                            <description>Port Input Detection Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
