amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>MKIVLR</name>
                    <description>Mask Invalid Register </description>
                    <addressOffset>0x428</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>MB31</name>
                            <description>mailbox 31 Mask Invalid </description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB30</name>
                            <description>mailbox 30 Mask Invalid </description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB29</name>
                            <description>mailbox 29 Mask Invalid</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB28</name>
                            <description>mailbox 28 Mask Invalid</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB27</name>
                            <description>mailbox 27 Mask Invalid</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB26</name>
                            <description>mailbox 26 Mask Invalid </description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB25</name>
                            <description>mailbox 25 Mask Invalid </description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB24</name>
                            <description>mailbox 24 Mask Invalid </description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB23</name>
                            <description>mailbox 23 Mask Invalid </description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB22</name>
                            <description>mailbox 22 Mask Invalid </description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB21</name>
                            <description>mailbox 21 Mask Invalid </description>
                            <lsb>21</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB20</name>
                            <description>mailbox 20 Mask Invalid </description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB19</name>
                            <description>mailbox 19 Mask Invalid </description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB18</name>
                            <description>mailbox 18 Mask Invalid </description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB17</name>
                            <description>mailbox 17 Mask Invalid </description>
                            <lsb>17</lsb>
                            <msb>17</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB16</name>
                            <description>mailbox 16 Mask Invalid </description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB15</name>
                            <description>mailbox 15 Mask Invalid </description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB14</name>
                            <description>mailbox 14 Mask Invalid </description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB13</name>
                            <description>mailbox 13 Mask Invalid </description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB12</name>
                            <description>mailbox 12 Mask Invalid  </description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB11</name>
                            <description>mailbox 11 Mask Invalid </description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB10</name>
                            <description>mailbox 10 Mask Invalid </description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB9</name>
                            <description>mailbox 9 Mask Invalid </description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB8</name>
                            <description>mailbox 8 Mask Invalid </description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB7</name>
                            <description>mailbox 7 Mask Invalid </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB6</name>
                            <description>mailbox 6 Mask Invalid </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB5</name>
                            <description>mailbox 5 Mask Invalid </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB4</name>
                            <description>mailbox 4 Mask Invalid </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB3</name>
                            <description>mailbox 3 Mask Invalid </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB2</name>
                            <description>mailbox 2 Mask Invalid </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB1</name>
                            <description>mailbox 1 Mask Invalid </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MB0</name>
                            <description>mailbox 0 Mask Invalid  </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
