amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
                <register>
                    <name>EIER</name>
                    <description>Error Interrupt Enable Register </description>
                    <addressOffset>0x84C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>BLIE</name>
                            <description>Bus Lock Interrupt Enable </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OLIE</name>
                            <description>Overload Frame Transmit Interrupt Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ORIE</name>
                            <description>Overrun Interrupt Enable </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BORIE</name>
                            <description>Bus,Off Recovery Interrupt Enable </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BOEIE</name>
                            <description>Bus,Off Entry Interrupt Enable </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EPIE</name>
                            <description>Error,Passive Interrupt Enable </description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EWIE</name>
                            <description>Error,Warning Interrupt Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BEIE</name>
                            <description>Bus Error Interrupt Enable </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIFR</name>
                    <description>Error Interrupt Factor Judge Register </description>
                    <addressOffset>0x84D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>BLIF</name>
                            <description>Bus Lock Detect Flag </description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OLIF</name>
                            <description>Overload Frame Transmission Detect Flag </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ORIF</name>
                            <description>Receive Overrun Detect Flag </description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BORIF</name>
                            <description>Bus,Off Recovery Detect Flag </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BOEIF</name>
                            <description>Bus,Off Entry Detect Flag </description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EPIF</name>
                            <description>Error,Passive Detect Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>EWIF</name>
                            <description>Error,Warning Detect Flag </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BEIF</name>
                            <description>Bus Error Detect Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RECR</name>
                    <description>Receive Error Count Register </description>
                    <addressOffset>0x84E</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RECR</name>
                            <description>Receive error count functionRECR increments or decrements the counter value according to the error status of the CAN module during reception.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TECR</name>
                    <description>Transmit Error Count Register </description>
                    <addressOffset>0x84F</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TECR</name>
                            <description>Transmit error count functionTECR increments or decrements the counter value according to the error status of the CAN module during transmission.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECSR</name>
                    <description>Error Code Store Register </description>
                    <addressOffset>0x850</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>EDPM</name>
                            <description>Error Display Mode Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>ADEF</name>
                            <description>ACK Delimiter Error Flag</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BE0F</name>
                            <description>Bit Error (dominant) Flag</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>BE1F</name>
                            <description>Bit Error (recessive) Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CEF</name>
                            <description>CRC Error Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>AEF</name>
                            <description>ACK Error Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FEF</name>
                            <description>Form Error Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SEF</name>
                            <description>Stuff Error Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSSR</name>
                    <description>Channel Search Support Register </description>
                    <addressOffset>0x851</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>CSSR</name>
                            <description>When the value for the channel search is input, the channel number is output to MSSR.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSSR</name>
                    <description>Mailbox Search Status Register </description>
                    <addressOffset>0x852</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SEST</name>
                            <description>Search Result Status</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MBNST</name>
                            <description>Search Result Mailbox Number Status These bits output the smallest mailbox number that is searched in each mode of MSMR.</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSMR</name>
                    <description>Mailbox Search Mode Register </description>
                    <addressOffset>0x853</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>MBSM</name>
                            <description>Mailbox Search Mode Select </description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSR</name>
                    <description>Time Stamp Register </description>
                    <addressOffset>0x854</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TSR</name>
                            <description>Free,running counter value for the time stamp function</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFSR</name>
                    <description>Acceptance Filter Support Register </description>
                    <addressOffset>0x856</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0x0000</resetMask>
                    <fields>
                        <field>
                            <name>AFSR</name>
                            <description>After the standard ID of a received message is written, the value converted for data table search can be read.</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TCR</name>
                    <description>Test Control Register </description>
                    <addressOffset>0x858</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>TSTM</name>
                            <description>CAN Test Mode Select </description>
                            <lsb>1</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TSTE</name>
                            <description>CAN Test Mode Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
