amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="CAN0">
            <name>CAN1</name>
            <description>CAN1 Module   </description>
            <baseAddress>0x40051000</baseAddress>
        </peripheral>
        <peripheral>
            <name>PDC</name>
            <description>Parallel Data Capture Unit</description>
            <baseAddress>0x40094000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PCCR0</name>
                    <description>PDC Control Register 0</description>
                    <addressOffset>0x000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EDS</name>
                            <description>Endian Select</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PCKDIV</name>
                            <description>PCKO Frequency Division Ratio Select</description>
                            <lsb>11</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PCKOE</name>
                            <description>PCKO Output Enable</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HERIE</name>
                            <description>Horizontal Byte Number Setting Error Interrupt Enable</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>VERIE</name>
                            <description>Vertical Line Number Setting Error Interrupt Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>UDRIE</name>
                            <description>Underrun Interrupt Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OVIE</name>
                            <description>Overrun Interrupt Enable </description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FEIE</name>
                            <description>Frame End Interrupt Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DFIE</name>
                            <description>Receive Data Ready Interrupt Enable </description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PRST</name>
                            <description>PDC Reset</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>HPS</name>
                            <description>HSYNC Signal Polarity Select</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>VPS</name>
                            <description>VSYNC Signal Polarity Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PCKE</name>
                            <description>Channel 0 GTCNT Count Clear</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCCR1</name>
                    <description>PDC Control Register 1 </description>
                    <addressOffset>0x004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PCE</name>
                            <description>PDC Operation Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCSR</name>
                    <description>PDC Status Register </description>
                    <addressOffset>0x008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HERF</name>
                            <description>Horizontal Byte Number Setting Error Flag</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>VERF</name>
                            <description>Vertical Line Number Setting Error Flag</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>UDRF</name>
                            <description>Underrun Flag</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>OVRF</name>
                            <description>Overrun Flag</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FEF</name>
                            <description>Frame End Flag</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FEMPF</name>
                            <description>FIFO Empty Flag</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>FBSY</name>
                            <description>Frame Busy Flag</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCMONR</name>
                    <description>PDC Pin Monitor Register </description>
                    <addressOffset>0x00C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HSYNC</name>
                            <description>HSYNC Signal Status Flag </description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>VSYNC</name>
                            <description>VSYNC Signal Status Flag </description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCDR</name>
                    <description>PDC Receive Data Register </description>
                    <addressOffset>0x010</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PCDR</name>
                            <description>The PDC includes a 32-bit,wide, 22-stage FIFO for the storage of captured data. The PCDR register is a 4-byte space to which the FIFO is mapped, and four bytes of data are read from the PCDR register at a time.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VCR</name>
                    <description>Vertical Capture Register </description>
                    <addressOffset>0x014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>VSZ</name>
                            <description>Vertical Capture Size Number of lines to be captured.</description>
                            <lsb>16</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VST</name>
                            <description>Vertical Capture Start Line PositionNumber of the line where capture is to start.</description>
                            <lsb>0</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCR</name>
                    <description>Horizontal Capture Register </description>
                    <addressOffset>0x018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HSZ</name>
                            <description>Horizontal Capture Size Number of bytes to capture horizontally.</description>
                            <lsb>16</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HST</name>
                            <description>Horizontal Capture Start Byte Position Horizontal position in bytes where capture is to start.</description>
                            <lsb>0</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
