amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>QSPI</name>
            <description>Quad,SPI</description>
            <baseAddress>0x64000000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x20</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x30</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x4C</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x800</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>SFMSMD</name>
                    <description>Transfer Mode Control Register</description>
                    <addressOffset>0x000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SFMCCE</name>
                            <description>Read instruction code selection.</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMOSW</name>
                            <description>Setup time adjustment for serial transmission</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMOHW</name>
                            <description>Hold time adjustment for serial transmission</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMOEX</name>
                            <description>Extension of the I/O buffer output enable signal for the serial interface</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMMD3</name>
                            <description>SPI mode selection. An initial value is determined by input to CFGMD3.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMPAE</name>
                            <description>Selection of the function for stopping prefetch at locations other than on byte boundaries</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMPFE</name>
                            <description>Selection of the prefetch function</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMSE</name>
                            <description>Selection of the prefetch function</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMRM</name>
                            <description>Serial interface read mode selection</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMSSC</name>
                    <description>Chip Selection Control Register</description>
                    <addressOffset>0x004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000037</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SFMSLD</name>
                            <description>QSSL signal output timing selection</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMSHD</name>
                            <description>QSSL signal release timing selection</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMSW</name>
                            <description>Selection of a minimum high,level width of the QSSL signal</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMSKC</name>
                    <description>Clock Control Register</description>
                    <addressOffset>0x008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000008</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SFMDTY</name>
                            <description>Selection of a duty ratio correction function for the SCK signal</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMDV</name>
                            <description>Serial interface reference cycle selection (* Pay attention to the irregularity.)NOTE: When PCLKA multiplied by an odd number is selected, the high,level width of the SCK signal is longer than the low,level width by 1 x PCLKA before duty ratio correction.</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMSST</name>
                    <description>Status Register</description>
                    <addressOffset>0x00C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000080</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PFOFF</name>
                            <description>Prefetch function operation state</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PFFUL</name>
                            <description>Prefetch buffer state</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>PFCNT</name>
                            <description>Number of bytes of prefetched dataRange: 00000 - 10010  (No combination other than the above is available.)</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMCOM</name>
                    <description>Communication Port Register</description>
                    <addressOffset>0x010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFF00</resetMask>
                    <fields>
                        <field>
                            <name>SFMD</name>
                            <description>Port for direct communication with the SPI bus.Input/output to and from this port is converted to an SPI bus cycle. This port is accessible in the direct communication mode (DCOM=1) only.Access to this port is ignored in the ROM access mode.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMCMD</name>
                    <description>Communication Mode Control Register</description>
                    <addressOffset>0x014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DCOM</name>
                            <description>Selection of a mode of communication with the SPI bus</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMCST</name>
                    <description>Communication Status Register</description>
                    <addressOffset>0x018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EROMR</name>
                            <description>Status of ROM access detection in the direct communication modeNOTE: Writing of 0 only is possible. Writing of 1 is ignored.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>COMBSY</name>
                            <description>SPI bus cycle completion state in direct communication</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMSIC</name>
                    <description>Instruction Code Register</description>
                    <addressOffset>0x020</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SFMCIC</name>
                            <description>Serial ROM instruction code to substitute</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMSAC</name>
                    <description>Address Mode Control Register</description>
                    <addressOffset>0x024</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SFM4BC</name>
                            <description>Selection of a default instruction code, when Serial Interface address width is selected 4 bytes.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMAS</name>
                            <description>Selection the number of address bits of the serial interface</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMSDC</name>
                    <description>Dummy Cycle Control Register</description>
                    <addressOffset>0x028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0000FF00</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SFMXD</name>
                            <description>Mode data for serial ROM. (Control XIP mode)</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMXEN</name>
                            <description>XIP mode permission</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMXST</name>
                            <description>XIP mode status</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMDN</name>
                            <description>Selection of the number of dummy cycles of Fast Read instructions</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMSPC</name>
                    <description>SPI Protocol Control Register</description>
                    <addressOffset>0x030</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000010</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SFMSDE</name>
                            <description>Selection of the minimum time of input output switch, when Dual SPI protocol or Quad SPI protocol is selected.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMSPI</name>
                            <description>Selection of SPI protocolNOTE: Serial ROM's SPI protocol is required to be set by software separately.</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMPMD</name>
                    <description>Port Control Register</description>
                    <addressOffset>0x034</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SFMWPL</name>
                            <description>Specify level of WP pin</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMCNT1</name>
                    <description>External QSPI Address Register 1</description>
                    <addressOffset>0x804</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>QSPI_EXT</name>
                            <description>BANK Switching AddressWhen accessing from 0x6000_0000 to 0x63FF_FFFF, Addres bus is Set QSPI_EXT[5:0] to high,order 6bits of SHADDR[31:0]NOTE: Setting 6'h3F is prihibited.</description>
                            <lsb>26</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
