amcelroy/ra-pac/svd_patch/R7FA6M3AH.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="ACMPHS1">
            <name>ACMPHS2</name>
            <description>High,Speed Analog Comparator 2</description>
            <baseAddress>0x40085200</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ACMPHS1">
            <name>ACMPHS3</name>
            <description>High,Speed Analog Comparator 3</description>
            <baseAddress>0x40085300</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ACMPHS1">
            <name>ACMPHS4</name>
            <description>High,Speed Analog Comparator 4</description>
            <baseAddress>0x40085400</baseAddress>
        </peripheral>
        <peripheral derivedFrom="ACMPHS1">
            <name>ACMPHS5</name>
            <description>High,Speed Analog Comparator 5</description>
            <baseAddress>0x40085500</baseAddress>
        </peripheral>
        <peripheral>
            <name>ELC</name>
            <description>Event Link Controller </description>
            <baseAddress>0x40041000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x02</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x10</offset>
                <size>76</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>ELCR</name>
                    <description>Event Link Controller Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ELCON</name>
                            <description>All Event Link Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x2</dimIncrement>
                    <dimIndex>0,1</dimIndex>
                    <name>ELSEGR%s</name>
                    <description>Event Link Software Event Generation Register %s</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>WI</name>
                            <description>ELSEGR Register Write Disable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>WE</name>
                            <description>SEG Bit Write Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>SEG</name>
                            <description>Software Event Generation</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>19</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>0-18</dimIndex>
                    <name>ELSR%s</name>
                    <description>Event Link Setting Register %s</description>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ELS</name>
                            <description>Event Link Select</description>
                            <lsb>0</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>WDT</name>
            <description>Watchdog Timer </description>
            <baseAddress>0x40044200</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x02</offset>
                <size>5</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>WDTRR</name>
                    <description>WDT Refresh Register </description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xFF</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>WDTRR</name>
                            <description>WDTRR is an 8-bit register that  refreshes the down,counter of the WDT.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDTCR</name>
                    <description>WDT Control Register </description>
                    <addressOffset>0x02</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x33F3</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RPSS</name>
                            <description>Window Start Position Selection</description>
                            <lsb>12</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>RPES</name>
                            <description>Window End Position Selection</description>
                            <lsb>8</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CKS</name>
                            <description>Clock Division Ratio Selection</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TOPS</name>
                            <description>Timeout Period Selection</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDTSR</name>
                    <description>WDT Status Register </description>
                    <addressOffset>0x04</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>REFEF</name>
                            <description>Refresh Error Flag </description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>UNDFF</name>
                            <description>Underflow Flag</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>CNTVAL</name>
                            <description>Down,Counter ValueValue counted by the down,counter</description>
                            <lsb>0</lsb>
                            <msb>13</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDTRCR</name>
                    <description>WDT Reset Control Register </description>
                    <addressOffset>0x06</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>RSTIRQS</name>
                            <description>Reset Interrupt Request Selection</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDTCSTPR</name>
                    <description>WDT Count Stop Control Register </description>
                    <addressOffset>0x08</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SLCSTP</name>
                            <description>Sleep,Mode Count Stop Control</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
